{"id": 1167, "text": "Sino-Global Shares Soar as Shipping Firm Expands Into Bitcoin Mining Sino-Global announced a new COO and CTO as it plans to start mining.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [54, 61, "Coin"], [69, 80, "Organization"]]}
{"id": 1168, "text": "AWS Marketplace Is Selling Origin’s Decentralized Ecommerce Service Origin Protocol's OGN token was up nearly 50% at press time.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"], [86, 89, "Coin"]]}
{"id": 1169, "text": "After GME, Dogecoin and Bitcoin, Chinese Traders Are Betting What Will Pump Next For Chinese investors, including Justin Sun, FOMO has surpassed fear of losing money.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 19, "Coin"], [24, 31, "Coin"]]}
{"id": 1170, "text": "First Mover: Ethereum, DOGE on Own Journeys as Inflation Bets Fuel Bitcoin Altcoins like Chainlink get big boost from DeFi growth on Ethereum, while inflation bets boost bitcoin and dogecoin gets (Elon Musk) moonshot.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 21, "Coin"], [23, 27, "Coin"], [89, 98, "Coin"], [133, 141, "Coin"], [170, 177, "Coin"], [182, 190, "Coin"]]}
{"id": 1171, "text": "‘Coin Signals’ Trader Arrested on $5M Crypto Fund Fraud Charges Jeremy Spence bilked his investors out of $5 million, according to a criminal complaint.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1172, "text": "BOE’s Bailey, Western Union CEO Part of Davos Panel on Digital Currencies The session will focus on the diminishing role of cash and the emergence of central bank digital currencies, moves accelerated by the pandemic.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 27, "Organization"]]}
{"id": 1173, "text": "Anti-Privacy Regulations Pose Risks for Crypto Investors,  Bank of America Says Cryptocurrencies \"challenge the ability of governments to levy taxes and to control capital flows more broadly,\" the report says.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[58, 74, "Organization"]]}
{"id": 1174, "text": "NFT Marketplace Rarible Closes $1.75M Seed Raise From 1kx, Coinbase Ventures The startup will use the funds to build a DAO governance structure.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[59, 76, "Organization"], [16, 23, "Coin"]]}
{"id": 1175, "text": "Unstoppable Domains Brings .Crypto Addresses Directly to Web Browsers The new service means web users can directly access decentralized websites form any browser.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1176, "text": "Bitcoin Breaks Below $30K, Erasing Almost All of 2021’s Gains Bitcoin gains in 2021 dropped below 1% as strong selling continues.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [62, 69, "Coin"]]}
{"id": 1177, "text": "Coinbase Ventures, Paradigm Invest $12M in Synthetix DeFi Platform Three prominent venture capital firms bought tokens directly from the DAO's treasury.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 17, "Organization"], [19, 27, "Organization"]]}
{"id": 1178, "text": "Kiss’ Gene Simmons Buys $300,000 Worth of  Cardano The Kiss bassist and frontman says he believes in Cardano because of its affordability compared with other cryptocurrencies.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[43, 50, "Coin"], [101, 108, "Coin"]]}
{"id": 1179, "text": "Blockchain Bites: Crypto in the Red, BlackRock Green Lights Bitcoin Futures The world's largest asset manager will allow two of its funds to get into bitcoin futures, as Guggenheim speculates a market pullback in the near term.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[150, 157, "Coin"], [60, 67, "Coin"], [37, 46, "Organization"]]}
{"id": 1180, "text": "Chainlink Supporter Deutsche Telekom Has Quietly Started Staking on Blockchains Never mind bitcoin on the balance sheet, a subsidiary of Europe’s biggest telco is taking a stake in DeFi.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[91, 98, "Coin"], [20, 36, "Organization"]]}
{"id": 1181, "text": "Market Wrap: Bitcoin Remains Around $48.5K Amid Flat Trading Activity “We are at all-time-highs territory [and] the market still has to make up its mind\" about next resistance or supporting levels, says one broker.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"]]}
{"id": 1182, "text": "Market Wrap: Bitcoin Rallies On After Passing $50K Psychological Level to $52K Bitcoin's price is in uncharted territory while its volatility remains high.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [79, 86, "Coin"]]}
{"id": 1183, "text": "MicroStrategy May Get Creative to Make Future Bitcoin Buys: CEO The business intelligence company already has 70,784 bitcoins.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 53, "Coin"], [0, 13, "Organization"]]}
{"id": 1184, "text": "Bitcoin an ‘Emerging Competitor’ to Gold, Says CME’s Chief Economist Blu Putnam said gold's ongoing production, likely to increase this year, contrasts with bitcoin's fixed supply.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [47, 50, "Organization"], [157, 164, "Coin"]]}
{"id": 1185, "text": "First Mover: As Wall Street Fixates on Inflation Hedges, Good Luck Finding Bitcoin A wave of new bitcoin buyers is arriving just as easily obtained supplies of the cryptocurrency fall to their lowest levels in more than three years.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[75, 82, "Coin"], [97, 104, "Coin"]]}
{"id": 1186, "text": "Central Bank Digital Currencies May Drive Cash ‘Shadow Economy’ to Crypto: Reuters \"Shadow economy\" participants, those who use deal mostly in hard cash for anonymity's sake, are unlikely to be drawn to using a CBDC, according to a Reuters column.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1187, "text": "Malaysian Bitcoin Mining Gang Stole Over $2M in Electricity, Say Police Police seized 1,746 bitcoin mining machines across 21 premises in raids this week.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1188, "text": "US Man Installs Crypto Mining Rig in Hybrid BMW Sportscar While this mining rig can be powered by the hybrid car's battery, the trunk needs to stay open to avoid overheating.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1189, "text": "Coinbase Now Has Over $90B in Assets on Platform Coinbase published fresh numbers Friday on how much capital has flowed onto the exchange in recent months.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [49, 57, "Organization"]]}
{"id": 1190, "text": "The Bitcoin Paradox Bitcoin may not be a financial bubble. But, when Bitcoiners reject inconvenient information, it is an epistemic bubble.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 11, "Coin"], [20, 27, "Coin"]]}
{"id": 1191, "text": "Bitcoin Above $52K as Market Expects More Volatility Bitcoin's market is over-leveraged now as the cryptocurrency continues its run higher.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [53, 60, "Coin"]]}
{"id": 1192, "text": "Robinhood Raises $3.4B Amid Growth Surge The round is the stock trading app's largest raise ever.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 1193, "text": "US Federal Reserve Looking to Hire a Manager to Research Stablecoins and CBDCs Fed Chair Jerome Powell has said the central bank needs “better regulatory answers” for global stablecoins.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[57, 68, "Coin"], [174, 185, "Coin"], [0, 18, "Organization"]]}
{"id": 1194, "text": "\"Dubai Free Zone Becomes First UAE Government Entity to Accept Bitcoin The free zone accepts payments in bitcoin, ether and the tether stablecoin.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 52, "Organization"], [63, 70, "Coin"], [105, 112, "Coin"], [114, 119, "Coin"], [128, 134, "Coin"]]}
{"id": 1196, "text": "Blockchain Bites: Will Bitcoin See ‘Reflexive’ Buys After Tesla? Analysts say the market is pricing in the potential for other corporate BTC investments.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 30, "Coin"], [137, 140, "Coin"]]}
{"id": 1197, "text": "US Man Pleads Guilty to Money Laundering Charges Involving $13M in Bitcoin During a 28-month period, Hugo Mejia illegally exchanged millions of dollars in bitcoin while attempting to hide his activity.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[67, 74, "Coin"], [155, 162, "Coin"]]}
{"id": 1198, "text": "BIS Plans Platform for Testing Central Bank Digital Currencies in Cross-Border Payments The new platform was announced as part of the BIS Innovation Hub's priorities and programs for 2021.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"], [134, 137, "Organization"]]}
{"id": 1199, "text": "Austrian Regulator Reports Rise in Crypto Fraud The FMA reports two-thirds of the investment fraud reports filed in 2020 were related to cryptocurrency and digital currency trading products.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1200, "text": "Microsoft and Enjin Bring Cross-Platform Custom NFTs to Minecraft To celebrate the International Day of Women and Girls in Science, players earn badges while learning from prominent female scientists.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [14, 19, "Organization"]]}
{"id": 1201, "text": "Geopolitics at Stake in US Response to China’s Digital Yuan: Report From privacy to political power, China’s digital yuan will have far-reaching implications.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1202, "text": "Voyager Reports Multiple ‘Service Disruptions’ After Encouraging Users to Trade Dogecoin Angry users are taking to Twitter, putting the platform in the DOGE house.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[80, 88, "Coin"], [152, 156, "Coin"], [0, 7, "Organization"]]}
{"id": 1203, "text": "Money Reimagined: Musk Masters the Attention Economy Bitcoin's recent surge shows the power of celebrity and how, like it or not, influencers create value in the modern economy.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[53, 60, "Coin"]]}
{"id": 1204, "text": "Market Wrap: Bitcoin Reverses Wednesday’s Losses, Ether Climbs Few are attributing the cryptocurrency's rise to market fundamentals after the GameStop roller coaster.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [50, 55, "Coin"]]}
{"id": 1205, "text": "TokenSoft to Trade Digital Securities on tZERO’s Retail Market On the Overstock-owned platform, TokenSoft customers will be able issue security tokens that retail and accredited investors can trade.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[96, 105, "Organization"], [0, 9, "Organization"]]}
{"id": 1206, "text": "Grayscale May Have Laid Groundwork for 5 More Potential Crypto Trusts Trusts for chainlink, basic attention token, decentraland, livepeer and tezos were all recently registered in Delaware.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 1208, "text": "Chinese Retailer Goes From Bubble Tea to Crypto Mining in Unlikely Pivot Urban Tea has hired two more executives ahead of its expansion into cryptocurrency mining.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[73, 82, "Organization"]]}
{"id": 1209, "text": "Investors Pump $250M Into Reddit Following Social Media Site’s Role in GameStop Mania The company plans to double its headcount to 1,400 by the end of 2021.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1210, "text": "Diem Stablecoin Prepares for Liftoff With Fireblocks Custody Partnership The rebranded Libra network aims to come out with an initial product around the end of this quarter, with help from Fireblocks and First Digital Assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Coin"]]}
{"id": 1211, "text": "Russia and US Dominate Global Dark Market Traffic: Report Darknet marketplaces received $1.7 billion during 2020, Chainalysis says.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[114, 125, "Organization"]]}
{"id": 1212, "text": "Crypto Wallet Startup Blockchain.com Raises $120M From Investors Including Google Ventures Blockchain.com said the institutional backing will power an increasingly institutional-minded business.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 36, "Organization"], [75, 91, "Organization"]]}
{"id": 1213, "text": "Libra Co-Creator’s VC Firm Co-Leads $12M Round in ‘Decentralized GitHub’ “Web 3 developers should be building on open protocols,” NFX General Partner Morgan Beller said of Radicle, a platform for crypto-native code collaboration.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1214, "text": "Blockchain Bites: The ‘Silver Lining’ for Bitcoin XRP and silver went viral – showing mind-meld market mechanics are still in play – though both hit limits.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[42, 49, "Coin"], [50, 53, "Coin"]]}
{"id": 1215, "text": "What DeFi Has in Common With Cubism DeFi's innovation system is reminiscent of an art movement that passes ideas back and forth until lasting breakthroughs emerge.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1216, "text": "First Mover: Risks Nobody’s Ever Seen, From the Fed to Tether (and GameStop) Risks surrounding tether have been known for years, but they're commanding fresh attention as the amount outstanding swells to $25B.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[55, 61, "Coin"]]}
{"id": 1217, "text": "Valid Points: CoinDesk’s Ethereum 2.0 Validator Is Officially Staked Ethereum developers met Tuesday to compare research on the eventual merge of Eth 1.x and Eth 2.0.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[25, 33, "Coin"], [14, 22, "Organization"], [69, 77, "Coin"]]}
{"id": 1218, "text": "DeFi’s UNI Token Jumps 92% in One Week, Passes $15 Uniswap's UNI token has nearly doubled its price in 7 days. The decentralized exchange is seeing volumes higher than last summer, too.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 10, "Coin"], [51, 58, "Organization"], [61, 64, "Coin"]]}
{"id": 1219, "text": "Former UK Cybersecurity Chief Says Laws Are Needed to Stop Ransomware Payouts “People are paying bitcoin to criminals and claiming back cash” via insurance claims, Ciaran Martin said.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1220, "text": "Why the US Needs Bitcoin Elon Musk and other VIPs have endorsed it. Here's why the Federal Reserve should seriously consider BTC for its balance sheet.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 24, "Coin"], [125, 128, "Coin"]]}
{"id": 1221, "text": "California Pension Fund Loaded Up on RIOT Shares During Bitcoin’s Q4 Rally The largest public pension in the U.S. bought more RIOT shares for the first time since 2017.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 23, "Organization"], [56, 63, "Coin"]]}
{"id": 1222, "text": "Saylor, MicroStrategy Offer Playbook for Corporate Bitcoin Adoption at Annual Summit Saylor and his MicroStrategists front-ran corporate bitcoin what-abouters at the firm's detail-heavy annual conference.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 58, "Coin"], [137, 144, "Coin"], [8, 21, "Organization"]]}
{"id": 1223, "text": "Ripple, SEC Say Settlement Unlikely Before Trial Over Alleged Securities Violations The SEC's case over allegedly unlawful sales of XRP by Ripple to retail investors is entering the discovery phase.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [8, 11, "Organization"], [132, 135, "Coin"], [139, 145, "Coin"]]}
{"id": 1224, "text": "Ethereum’s Road to $2K: 3 Reasons to Be Bullish Ether recently broke above $1,400 for the first time in two years. Here are three events that could push the price even higher.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [48, 53, "Coin"]]}
{"id": 1225, "text": "Crypto-Friendly Signature Bank Added to JPMorgan’s ‘Focus List’ Signature is \"positioned to ride the crypto wave,\" a JPMorgan analyst wrote.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[117, 125, "Organization"], [40, 48, "Organization"]]}
{"id": 1226, "text": "Why a GameStop-Inspired Mania Is Unlikely in China’s Stock Market It would be logistically challenging for Chinese retail investors to organize a short-selling campaign, especially with the authorities watching.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1227, "text": "Bitcoin Mining Farms in Texas Offline From Winter Storm A rare winter storm in Texas has knocked out most of the bitcoin mining facilities in the Lone Star State.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[113, 120, "Coin"], [0, 7, "Coin"]]}
{"id": 1228, "text": "Overstock Turns Medici Ventures Into a Fund to Reap Value of Blockchain Assets “We remain bullish on blockchain technology but are changing the way we interact with these asset,\" said CEO Jonathan Johnson.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1229, "text": "Bitcoin Falls as Miners Sell, Institutions Watch Yellen Some institutions have paused their buying, at least for the moment.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 1230, "text": "Singapore Exchange, Temasek Launch Digital Asset Business for Capital Markets The new venture seeks to partner with fixed income issuance platforms for their post-trade infrastructure.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 18, "Organization"], [20, 27, "Organization"]]}
{"id": 1231, "text": "Money Reimagined: Letter to President Biden President Biden needs to reform the global financial system and avoid a 1930s-style depression. Digital currencies can help.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1232, "text": "Bitso adquiere la plataforma de criptoderivados Quedex con base en Gibraltar La compañía mexicana planea incorporar el nuevo motor de trading de alto rendimiento a su plataforma exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1233, "text": "Bitcoin Miner Ebang Closes $70M Follow-Up Public Offering The proceeds will be used primarily for research, development, production and sale of equipment and expanding its mining business through the establishment and operation of crypto mining farms.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 1234, "text": "Crypto Is the Libertarian Cheat Code in the Final Battle Over State Coercion A normie Mario fights Bowser to save Princess Peach; a libertarian Mario builds her an escape hatch.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1235, "text": "Decentralized Exchange Volumes Hit Record Above $50B in January Uniswap represented over 45% of total DEX volume.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[64, 71, "Coin"]]}
{"id": 1236, "text": "Ruffer Turns Bitcoin Investment Into $750M Profit in Under 2 Months \"We did not expect immediate fireworks,” said a Ruffer executive.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"]]}
{"id": 1237, "text": "Tether’s Bank Deltec Says Stablecoin Is Fully Backed by Reserves \"Every tether is backed by a reserve and their reserve is more than what is in circulation,\" said Gregory Pepin, Deltec Bank's deputy CEO.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [26, 36, "Coin"], [72, 78, "Coin"]]}
{"id": 1238, "text": "Beijing, Shanghai to Join Wider Testing of Digital Yuan in 2021 The wider effort to promote the digital currency precedes a launch in the \"near future,\" per a state media report.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1239, "text": "CFTC Attorney Who Let Regulators Trade Crypto Joins Private Law Firm Daniel Davis oversaw the CFTC’s legal division, including administrative actions.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1240, "text": "Japan’s SBI Adds XRP to Cryptocurrency Lending Service Users of SBI's cryptocurrency exchange can lend XRP for a return of 0.1% per annum.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 20, "Coin"], [64, 67, "Organization"], [103, 106, "Coin"], [8, 11, "Organization"]]}
{"id": 1241, "text": "Fine Wines Become First Tokenized Securities Under New Swiss Blockchain Law In effect from today, Switzerland's new blockchain law allows Sygnum to freely issue tokenized assets, starting with investable wines.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1242, "text": "Bitcoin’s Rise Should Make Regulators Ask if the Fed’s Policies Have a Hand in It: WaPo \"The best reason to focus on bitcoin’s rise is what it tells us about the risks that may be bubbling up amid the Federal Reserve’s commitment to zero interest rates,\" the Post said.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[117, 124, "Coin"], [0, 7, "Coin"]]}
{"id": 1243, "text": "Bitcoin Market Value Tops $1T as Price Passes $53,697 A year ago, bitcoin's market value was $178 billion.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [66, 73, "Coin"]]}
{"id": 1244, "text": "Binance Suspends Deposits in Nigeria Following Central Bank Directive Nigeria's central bank told financial institutions they couldn't provide crypto companies or users with services on Friday.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 1245, "text": "$10M Fund From Cosmos-Based Terra Will Gladly Back DeFi Projects on Ethereum The fund will pay for the one thing devs can't do internally: security audits.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 76, "Coin"], [28, 33, "Organization"]]}
{"id": 1246, "text": "State of Crypto: How Will the Government React to GameStop? Also: Ripple filed its response to the SEC and a FinCEN official discusses the controversial counterparty rule in public for the first time.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[66, 72, "Coin"]]}
{"id": 1247, "text": "First Mover: Tesla Sends Bitcoin Mooning Past $44K as Snoop Wins #dogebowl Electric-vehicle entrepreneur Elon Musk follows through with a $1.5 billion purchase after adding \"#bitcoin\" to his Twitter profile late last month.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 18, "Organization"], [25, 32, "Coin"]]}
{"id": 1248, "text": "Market Wrap: Bitcoin Hits Record $48.2K as CME Ether Futures at $33M Volume on First Day With all this bullish bitcoin activity, the ETH/BTC pair has gone bearish, a sign traders are selling ether for bitcoin.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [47, 52, "Coin"], [133, 136, "Coin"], [137, 140, "Coin"], [191, 196, "Coin"], [201, 208, "Coin"], [43, 46, "Organization"]]}
{"id": 1249, "text": "CME Ethereum Futures, Explained Ethereum futures are now live on the CME exchange. But what does that mean exactly and how do you trade them?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 40, "Coin"], [69, 72, "Organization"], [0, 3, "Organization"], [4, 12, "Coin"]]}
{"id": 1250, "text": "New Kraken Venture Fund to Target Early-Stage Crypto, Tech Startups Kraken Ventures will operate autonomously, with financial backing from the exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 18, "Organization"], [68, 83, "Organization"]]}
{"id": 1251, "text": "These Gaming Studios Are Bringing Bitcoin Payouts to Everyday Esport Gamers Imagine if every shot, goal or win paid real money to  everyday players. Welcome to the world of bitcoin esports.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[173, 180, "Coin"], [34, 41, "Coin"]]}
{"id": 1252, "text": "Philippines Issues Crypto Industry Guidelines to Guard Against Money Laundering New guidelines bring the nation's digital asset industry in line with Financial Action Task Force standards.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1253, "text": "\"Why We Should Take Dogecoin Seriously Dogecoin's rise reflects the power of collective belief and a longing for a more ideal form of crypto.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 28, "Coin"], [39, 47, "Coin"]]}
{"id": 1255, "text": "Why Everyone Wants an Invite to Clubhouse Crypto The 11-month old audio app is the latest vector for crypto adoption – memes and all. Here's why everyone wants in.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1256, "text": "Pornhub Payment Option Verge Suffers Massive Blockchain Reorganization Verge has been hit by a massive 560,000-block reorganization.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 28, "Organization"], [71, 76, "Organization"]]}
{"id": 1257, "text": "DeFi Season? LINK, AAVE, ZRX and COMP Hit Record Price Highs, Outperforming Bitcoin An analyst expects DeFi tokens to mimic bitcoin's 2017 bull run this year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 23, "Coin"], [13, 17, "Coin"], [25, 28, "Coin"], [33, 37, "Coin"], [76, 83, "Coin"]]}
{"id": 1258, "text": "Crypto Long & Short: GameStop, Dogecoin y un nuevo paradigma de mercado Estrategias de inversión de crowdsourcing descentralizadas a través de las redes sociales, e influencers como Elon Musk, han creado nuevos riesgos en Wall Street.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 39, "Organization"]]}
{"id": 1259, "text": "Gemini Partners With Crypto Lender Genesis to Offer 7.4% Yield on Customer Deposits The product is part of Gemini’s attempt to bring in new crypto investors with bank-like products.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [35, 42, "Organization"], [107, 113, "Organization"]]}
{"id": 1260, "text": "Meet the Technician Who Unlocks Your Forgotten Crypto Wallets It’s a bitcoin bull run and you've forgotten the password to your wallet. What’s next?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[69, 76, "Coin"]]}
{"id": 1261, "text": "Hashdex to Launch the Hashdex Nasdaq Crypto Index ETF The ETF will be available for trading by accredited non-U.S. investors.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [22, 29, "Organization"]]}
{"id": 1262, "text": "After Breaching $50K, Bitcoin Gives Up Earlier Gains Markets still remain bullish; retail traders take to derivatives.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 29, "Coin"]]}
{"id": 1263, "text": "Market Wrap: Bitcoin Drops to $29.9K While DeFi Hits Record $29B Locked Today was the first time bitcoin traded below $30,000 since Jan. 21.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [97, 104, "Coin"]]}
{"id": 1264, "text": "XRP Pump Fails to Materialize as Price Crashes 40% From Day’s High The hefty drop comes despite a community buying effort scheduled for this morning.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Coin"]]}
{"id": 1265, "text": "Top Crypto Exchanges Experience Difficulties as Tesla News Prompts Trading Frenzy Binance, Gemini and Kraken are all having technical difficulties under heavy trading load.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[82, 89, "Organization"], [91, 97, "Organization"], [102, 108, "Organization"]]}
{"id": 1266, "text": "Valid Points: What to Expect When Ethereum 2.0 Undergoes Its First ‘Hard Fork’ Here's what the impending Eth 2.0 hard fork means, and why Ethereum devs are still debating the “Ice Age.”", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 42, "Coin"], [138, 146, "Coin"]]}
{"id": 1267, "text": "Why Did Bill Miller and His Son Buy MicroStrategy Debt? It’s the Bitcoin \"Not owning any bitcoin has been a massive mistake, and we expect that will continue to be true,\" the famed value investor's son wrote to clients.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[65, 72, "Coin"], [89, 96, "Coin"]]}
{"id": 1268, "text": "UN Says North Korea Funded Nuclear Weapons With Crypto Hacks in 2020: Report U.N. experts estimate that over $316 million in crypto was stolen by North Korea-linked hackers last year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1269, "text": "Hot DOGE! Meme-Based Cryptocurrency Soars More Than 800% to Record High Well known DOGE lover Elon Musk tweeted a picture of dog posing on the cover of a magazine, a likely nod to DOGE's surge.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 8, "Coin"], [83, 87, "Coin"], [180, 184, "Coin"]]}
{"id": 1270, "text": "$180M Bitcoin Trust Completes Canadian IPO, Fully Invested on First Day The bitcoin fund is available in both U.S. dollars and Canadian dollars and is listed on the Toronto Stock Exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[6, 13, "Coin"], [76, 83, "Coin"]]}
{"id": 1271, "text": "PayPal Says Venmo Under Investigation in US by Consumer Regulator The U.S. Consumer Financial Protection Bureau is probing the social payments app, according to Reuters.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [12, 17, "Organization"]]}
{"id": 1272, "text": "First Mover: Elon Musk #Bitcoin Moment Adds to Dogecoin, GameStop Wackiness The GameStop-galvanized \"bear raid\" by retail stock traders appears to have terrified Wall Street, but crypto-industry marketeers are salivating over the prospect of new customer leads and more demand.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 31, "Coin"], [47, 55, "Coin"]]}
{"id": 1273, "text": "Bitcoin May Be a Better Investment Than Gold, Says DoubleLine CEO Jeffrey Gundlach Gundlach has previously said, \"I don't believe in bitcoin.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [133, 140, "Coin"]]}
{"id": 1274, "text": "BIS: CBDC Research Gaining Steam but Widespread Issuance Years Away Central banks remained adamant private stablecoins do not factor into their CBDC calculus.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1275, "text": "GameStop Investing Craze ‘Proof of Concept’ for Bitcoin Success, Says Scaramucci A campaign by members of a Reddit investor forum have caused GameStop stock to spike to record levels in the last week.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 55, "Coin"]]}
{"id": 1276, "text": "Mobile Firm Employee Charged With Aiding Crypto SIM-Swap Attacks Targeting 19 Stephen Defiore was allegedly paid to transfer cellphone accounts to ones owned by a co-conspirator.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1277, "text": "Market Wrap: Crypto Market Cap Breaks $1.5T as Buyers Show Up for the Dip Buyers showed up quickly to reverse the crypto market dip through Monday.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1278, "text": "Big Guns Back $10M Investment in DeFi’s dYdX The funding round, led by Three Arrows and DeFiance Capital, was also joined by Andreessen Horowitz and Polychain Capital.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[40, 44, "Coin"], [71, 83, "Organization"], [88, 104, "Organization"], [149, 166, "Organization"]]}
{"id": 1279, "text": "Canadian Crypto Lender Ledn Raises $2.7M for Emerging Markets Expansion After growing in Latin America, the firm wants to bring its micro-loans and stablecoin savings features to other emerging markets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 27, "Organization"]]}
{"id": 1280, "text": "Bitcoin Slumps to $31K on Sell-Off in US and Europe Uncertainty is leading many to take short-term profit, according to the \"Coinbase Premium\" indicator.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [125, 133, "Organization"]]}
{"id": 1281, "text": "Ether Soars to Another All-Time High, Carrying DeFi and Rival Coins With It Investor excitement ahead of the CME's planned ether futures contract is one reason for the price push.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"]]}
{"id": 1282, "text": "Nigerian Central Bank Says Its Ban on Crypto Accounts Is Nothing New The Central Bank of Nigeria said its warning to banks on Friday was not a new position, but a reiteration of its 2017 stance on cryptocurrencies.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1283, "text": "Ethereum-Based ConsenSys Quorum Partners With China’s BSN Blockchain The first partnership for Quorum since leaving JPMorgan is a big one.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1284, "text": "Osprey Fund’s Bitcoin Trust Is Now Available to Retail Investors via OTC The fund is structured similarly to the Grayscale Bitcoin Trust, but aims to compete with lower fees.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [14, 21, "Coin"]]}
{"id": 1285, "text": "Ethereum 2.0 Deposit Contract Tops $5.5B in Staked Ether The amount deposited represents 2.67% of Ethereum’s total supply.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [51, 56, "Coin"], [98, 106, "Coin"]]}
{"id": 1286, "text": "Signature Bank Crosses $10B in Deposits From Crypto Customers Signature's $10 billion in deposits from crypto businesses is now double that of rival Silvergate.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1287, "text": "Caveat Depositor. How Safe Is Your Stablecoin? USD stablecoins are created largely outside the dollar system and lack federal deposit guarantees. Investors should be careful.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 45, "Coin"], [51, 62, "Coin"]]}
{"id": 1288, "text": "T-Mobile Sued Over SIM Attack That Resulted in Loss of $450K in Bitcoin The plaintiff lost 15 bitcoin after an interaction with a T-Mobile customer who had been victim of a SIM-swapping attack.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[64, 71, "Coin"], [94, 101, "Coin"], [0, 8, "Organization"], [130, 138, "Organization"]]}
{"id": 1289, "text": "Crypto Miner Marathon Patent Group Buys $150M in Bitcoin The Nasdaq-listed mining company wants to become a \"pure-play bitcoin investment option\" for Wall Street.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 34, "Organization"], [49, 56, "Coin"], [119, 126, "Coin"]]}
{"id": 1290, "text": "MGM, Winklevoss Twins to Make Movie About Reddit’s GameStop Investors Taking on Wall Street MGM bought the movie rights to a book proposal on the short squeeze from best-selling author Ben Mezrich.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1291, "text": "How Bitcoiners Should Watch the US Federal Reserve Meeting on Wednesday Comments from the Fed could tell bitcoiners how committed the central bank is to staying the course on low interest rates through the rest of the year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1292, "text": "Cathie Wood: Bitcoin ETF Approval Unlikely Until Market Cap Rises to About $2T \"The flood of demand has to be satisfied\" for the SEC to feel comfortable with a bitcoin ETF, said Wood.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [160, 167, "Coin"]]}
{"id": 1293, "text": "MicroStrategy Buys the Dip, Adds $10M to Bitcoin Treasury CEO Michael Saylor bought the coins for an average price of $31,808.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"], [41, 48, "Coin"]]}
{"id": 1294, "text": "Japan’s SBI Investing ‘Eight-Figure’ Sum in Swiss Crypto Bank Sygnum SBI's digital assets subsidiary will lead a round that will have raised around $30 million for the Swiss firm over six months.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1295, "text": "Malaysia Pair Face Caning for Alleged $37K Bitcoin Fraud If convicted, the two men face a maximum of 10 years in prison, caning and fines.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[43, 50, "Coin"]]}
{"id": 1296, "text": "South Africa’s Tax Agency Is Clamping Down on Crypto Users: Report The South African Revenue Service is likely \"ensnaring\" non-compliant taxpayers, a tax consultancy said in a news report.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1297, "text": "Jim Cramer Tells $731M Powerball Winner to Put 5% in Bitcoin The \"Mad Money\" host picked bitcoin as one of his hedges against the specter of hyperinflation.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[53, 60, "Coin"], [89, 96, "Coin"]]}
{"id": 1298, "text": "Coinbase Taps Nasdaq for Direct Listing: Report The crypto exchange will reportedly join Nasdaq's tech-heavy lineup.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 1299, "text": "Collateralized Debt Obligations Make Their Way Into DeFi Lending The future of finance apparently involves Wall Street’s ghosts.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1300, "text": "CrossTower Launches Bitcoin Fund to Compete With Grayscale’s GBTC The fund is starting out with $20 million in AUM, largely from family offices, and touts lower fees than the Grayscale Bitcoin Trust.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [20, 27, "Coin"]]}
{"id": 1301, "text": "Australia’s Central Bank Says Bitcoin ‘Not Really Money,’ No Risk to Financial Stability The Reserve Bank's assistant governor for financial systems, Michelle Bullock, said there is \"a lot of fuss over bitcoin.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[202, 209, "Coin"], [0, 24, "Organization"], [30, 37, "Coin"]]}
{"id": 1302, "text": "What Is a Flash Loan? A guide to one of DeFi's most innovative and controversial features.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1303, "text": "\"Substack Newsletters Are Being Used to Spread Crypto Scams Substack is being leveraged by scammers for its ease of use and reach.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1305, "text": "Thailand Wants to Target Japanese Crypto Holders as Part of Plan to Revive Tourism The Tourism Authority of Thailand slashed its estimate for foreign arrivals this year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1306, "text": "Minority Mining Pools Threaten to Collude Against Contentious Ethereum Update A small band of Ethereum miners are trying to pick off larger mining pools’ subscribers in a bid to shoot down EIP 1559.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[62, 70, "Coin"], [94, 102, "Coin"]]}
{"id": 1307, "text": "Rare Hashmasks Digital Artwork Sells for $650K in Ether \"The piece itself is chaotic, yet ordered. It invokes a concept of biblical dualism with the demon and halo,\" said the buyer.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[50, 55, "Coin"]]}
{"id": 1308, "text": "US President Biden: ‘I’m Not Cutting the Size of the Checks’ for Fiscal Relief The comments came after reports the White House was considering reducing the size of its proposed stimulus package.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1309, "text": "China, Singapore Look Ahead to CBDC Future at World Economic Forum A former deputy governor of the People’s Bank of China compared notes with the chairman of the Monetary Authority of Singapore.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1310, "text": "Market Wrap: Bitcoin Trading Tepidly at $33.7K While SushiSwap Eats Raw Market Share The investor spotlight is now shining on DeFi tokens and trading.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [53, 62, "Coin"]]}
{"id": 1311, "text": "Unlike the Early Web, Crypto Does Not Need State Patronage Blockchain doesn't need ARPANET-type government support. But co-ordination and collective action are vital to avoid duplication of effort.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1312, "text": "Australian Crypto Exchange to Delist BSV Over ‘Bullying’ Threat to Bitcoin Developers The exchange's CEO said, \"Recent talk of legal action against developers working to improve the Bitcoin ecosystem proved to be the final straw.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[67, 74, "Coin"], [0, 26, "Organization"], [182, 189, "Coin"]]}
{"id": 1313, "text": "Siam Bank Launches $50M Blockchain Fund The fund will focus on global early- and growth-stage companies that shape the next generation of financial services and digital systems, the venture capital arm of Thailand's oldest bank says.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 1314, "text": "Bitcoin se recupera de su caída y alcanza los $50K De acuerdo a analistas, la criptomoneda necesitará una mayor cantidad de compras al contado para  mantenerse por encima de esa marca", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1315, "text": "4 Ways Blockchain Could Catapult Into the Mainstream Blockchain technology adoption has largely been a top-down story. Here are some ideas that could get more bottom-up traction.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1316, "text": "First Mover: Silver Is the New GameStop as Musk’s #Bitcoin Stalls As bitcoin trades in a range, traders are studying the \"Grayscale premium\" and watching traditional markets for clues to the next market move.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[69, 76, "Coin"], [51, 58, "Coin"]]}
{"id": 1317, "text": "‘A Good Thing’: Elon Musk Says He’s a Supporter of Bitcoin It would be the most \"entertaining and ironic outcome\" if dogecoin \"becomes the currency of [E]arth in the future,\" Musk also said.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 58, "Coin"], [117, 125, "Coin"]]}
{"id": 1318, "text": "Mastercard Launches Prepaid Card for World’s First CBDC in Bahamas The Bahamian Sand Dollar can now be used for payments anywhere Mastercard is accepted.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"]]}
{"id": 1319, "text": "Samsung Discussing $10B Chipmaking Facility in Texas: Bloomberg Samsung plans for its foundry to manufacture 3nm chips.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1320, "text": "Miami Mayor Previews ‘Favorable’ Crypto Policy In an interview with CoinDesk, Francis X. Suarez explains how he plans to attract the crypto industry to Florida.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 76, "Organization"]]}
{"id": 1321, "text": "Bitcoin Crosses $57K, Setting Another All-Time High and Igniting a Crypto Rally Less than two months into 2021, the price of bitcoin has risen 95.4%.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [125, 132, "Coin"]]}
{"id": 1322, "text": "Bitcoin Startup Casa Raises $4M Led by Fidelity-Linked Avon Ventures Coinbase Ventures also joined the round.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[16, 20, "Organization"], [69, 86, "Organization"], [55, 68, "Organization"]]}
{"id": 1323, "text": "Bitcoin Brokerage River Financial Raises $17M: SEC Filings River Financial's equity sale comes as the high-end brokerage embarks on a major hiring push.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[18, 33, "Organization"], [59, 74, "Organization"]]}
{"id": 1324, "text": "Market Wrap: Bitcoin Hits $34.8K While Ether Volatility Skyrockets A bullish bitcoin mentality appears to be forming in the options market while ether continues on its roller coaster.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 20, "Coin"], [39, 44, "Coin"], [77, 84, "Coin"], [145, 150, "Coin"]]}
{"id": 1325, "text": "First North American Bitcoin ETF Approved by Canadian Securities Regulator The Ontario Securities Commission gave its blessing Thursday.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1326, "text": "Croatia’s Tifon Gas Stations Hope to Tap Tourist Trade With Crypto Payment Support Forty-six fuel stops will accept bitcoin, ether, stellar, XRP and EOS through a partnership with local platform PayCek.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[116, 123, "Coin"], [125, 130, "Coin"], [132, 139, "Coin"], [141, 144, "Coin"], [149, 152, "Coin"], [10, 15, "Organization"], [195, 201, "Organization"]]}
{"id": 1327, "text": "Jack Ma’s Ant Group Agrees to Restructure After Pressure From China’s Regulators: Report Regulators have been clamping down on Ant Group, even cancelling its expected $35 billion twin IPO late last year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 19, "Organization"]]}
{"id": 1328, "text": "Bullish Sign for Crypto? USDC and Dai Balances on Exchanges Hit Record Highs Buying in these stablecoins may foretell where the crypto market is going.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[93, 104, "Coin"], [25, 29, "Coin"], [34, 37, "Coin"]]}
{"id": 1329, "text": "Fundamental Investing Is Alive and Well in Crypto Ironically, digital assets might be one of the best asset classes for true fundamental investment analysis, says our columnist.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1330, "text": "Arcane Crypto Lists on Nasdaq First North After Reverse Takeover The Norway-based investment company is now known as Arcane Crypto AB and trades as \"ARCANE.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"]]}
{"id": 1331, "text": "Bitcoin Back Above $40K as Institutions Lead the Way BTC is back within striking distance of its all-time high set early last month.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [53, 56, "Coin"]]}
{"id": 1332, "text": "Former Bitcoin Developer Mike Hearn Steps Down From Enterprise Blockchain Firm R3 Hearn will become CEO of a new firm while remaining a technical adviser to R3.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 14, "Coin"], [79, 81, "Organization"], [157, 159, "Organization"]]}
{"id": 1333, "text": "The Bull Case for DeFi: Matthew Roszak Capital \"treadmills,\" yield and ETH at a lifetime high.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[71, 74, "Coin"]]}
{"id": 1334, "text": "Virtual Property Sells for $1.5M in Ether, Smashing NFT Record The eye-popping 888 ETH virtual land sale is said to mark the largest NFT transaction of all time.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 16, "Organization"], [36, 41, "Coin"]]}
{"id": 1335, "text": "Ether Sets New All-Time High Over $2,000 as Bull Run Continues Ether hit a new record, up 5.44% in the last 24 hours, with market capitalization hitting $230.7 billion.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"], [63, 68, "Coin"]]}
{"id": 1336, "text": "India Minister Suggests Modi Government Not Planning Outright Crypto Ban A recent bulletin from India's lower house had once more raised fears of an total cryptocurrency ban.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 39, "Organization"]]}
{"id": 1337, "text": "OCC Halts Fair Access Banking Rule The rule would have prohibited U.S. banks from denying services based on ideological factors.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"]]}
{"id": 1338, "text": "KPMG, BitGo, Coin Metrics Launch New Offering to Drive Institutional Adoption One of the \"big four\" professional services firms has launched a product suite with two other cryptocurrency firms with an eye on serving institutional demand in crypto.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"], [6, 11, "Organization"], [13, 25, "Organization"]]}
{"id": 1339, "text": "Binance-Backed DeFi Credit Union Platform Secures Partners, Funding Before Launch Xend Finance will allow credit unions and cooperatives to earn interest on deposits by converting them to stablecoins.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[82, 94, "Organization"], [188, 199, "Coin"]]}
{"id": 1340, "text": "Winklevoss Twins, DJ Alesso Back Crypto Collectible Artworks for Charity Auction Ethernity will auction digital artworks represented by non-fungible tokens and created by artists from across the globe.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[81, 90, "Organization"]]}
{"id": 1341, "text": "SEC Calls Out Suspicious Crypto Companies Targeting Global Traders The securities regulator added eight suspect crypto entities to its watchlist Thursday.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"]]}
{"id": 1342, "text": "Grayscale Files to Register Trust for DeFi Platform Yearn Finance Grayscale Investments, the world’s largest digital asset manager, has filed to register a new cryptocurrency trust for Yearn Finance (YFI).", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 1343, "text": "Crypto Payments Provider BitPay Adds Apple Pay Support Apple Pay functionality will allow cardholders to make purchases in store and online using the crypto held in their BitPay wallet.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[25, 31, "Organization"], [171, 177, "Organization"]]}
{"id": 1344, "text": "Mining Machine Manufacturer Ebang to Start Mining Bitcoins for Itself The new venture is expected to increase revenue and \"optimize\" its product offering structure.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 33, "Organization"], [50, 58, "Coin"]]}
{"id": 1345, "text": "Chinese Lottery Firm 500.com Acquires Crypto Mining Pool BTC.com BTC.com is currently owned by Bitdeer Technologies and former Bitmain CEO Jihan Wu.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 28, "Organization"], [57, 64, "Organization"], [65, 72, "Organization"]]}
{"id": 1346, "text": "Clover Finance Raises $3M From Polychain, Others to Bridge Ethereum and Polkadot The Substrate-based chain is also working on a proof-of-concept “non-custodial” bridge for EVM chains to connect with the Bitcoin network.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"], [59, 67, "Coin"], [72, 80, "Coin"], [203, 210, "Coin"]]}
{"id": 1347, "text": "IBM Blockchain Is a Shell of Its Former Self After Revenue Misses, Job Cuts: Sources “There is not really going to be a blockchain team any longer,” said a person familiar with the situation.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1348, "text": "Bitcoin and Inflation: Everything You Need to Know The cryptocurrency was designed to counter the harms of inflation, but is this really such a big issue?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 1349, "text": "Bill Miller’s Flagship Fund May Now Buy GBTC to Gain Bitcoin Exposure of Up to 15% The fund noted it would not expose more than 15% of its $2.25 billion in assets to bitcoin.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[40, 44, "Coin"], [53, 60, "Coin"], [166, 173, "Coin"]]}
{"id": 1350, "text": "Avalanche Crippled by Bug Triggered by Unusually High Volume, Engineer Says The blockchain, which had been touted for its ability to handle a high volume of transactions, was slowed to a crawl by an unusually high number of transactions.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Coin"]]}
{"id": 1351, "text": "First Mover: Bulls Are Back as Ether Hits All-Time High, Bitcoiners Hoard GameStop comedown shows appeal of social media-fueled trading. Dogecoin chatter in Reddit reveals cryptocurrency analogue.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 36, "Coin"], [137, 145, "Coin"]]}
{"id": 1352, "text": "Facial Recognition Tech May Be Being Used Against Russian Protestors Russian police officials may be tracking attendees at pro-Navalny protests using facial recognition tools, detainees claim.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1353, "text": "All Over the World, Small Investors Jump Into the GameStop Frenzy The world is watching U.S. markets with great interest, and more than a little FOMO, as Reddit investors continue to test their might against Wall Street. It all started when retail investors on the Reddit community wallstreetbets began pumping the price of U.S. video game retailer GameStop’s (GME) stock to counter Wall Street hedge funds […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1354, "text": "Mark Cuban Hails ‘Store of Value Generation’ Taking on Wall Street Cuban believes WSB traders are applying the principles of the crypto world to the stock market.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1355, "text": "Senate Confirms Janet Yellen as US Treasury Secretary Yellen succeeds Steven Mnuchin in running the U.S. government’s treasury. Here’s what she will oversee in the crypto world.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1356, "text": "UK Trading Firm BCB Launches Bitcoin Treasury Service for Crypto-Curious CFOs “Since Tesla, it’s gone bananas.”", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[16, 19, "Organization"], [29, 36, "Coin"]]}
{"id": 1357, "text": "Discord Scammers Lure Users to Fake Exchange With Promise of Free Bitcoin The scammers may be trying to collect a database of crypto users for sale on the dark web, said Kaspersky.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[66, 73, "Coin"], [170, 179, "Organization"]]}
{"id": 1358, "text": "‘Market Battleship’: Why It’s Rigged and How DeFi Can Help Individual investors, even when operating in a swarm, are destined to lose. How do I know? I helped design the game.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1359, "text": "Diginex Connects Crypto Exchanges and Electronic Trading Firms With New Platform The crypto services firm is connecting high-frequency traders who use electronic trading platforms to crypto exchanges.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 1360, "text": "Square-Led Consortium Challenges Craig Wright’s Bitcoin White Paper Claim The response asks general questions regarding Craig Wright's claims.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 21, "Organization"], [48, 55, "Coin"]]}
{"id": 1361, "text": "Money Reimagined: Narratives Wall Street Can’t Control It used to be that Wall Street dictated the big stories around finance. It’s unclear whether that’s still the case.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1362, "text": "Blockchain Bites: Mastercard, BNY Mellon Embrace Crypto; Amazon Floats ‘Digital Currency’ Project Recently deceased porn mogul Larry Flynt once said, “Hypocrisy is a detriment to progress.\" His story may have something to offer crypto.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[18, 28, "Organization"], [29, 40, "Organization"]]}
{"id": 1363, "text": "US Lawmakers Ask Justin Sun, DLive How They Moderate Extremist Content The letter also asks whether DLive identified any crypto donations from foreign entities to the individuals present on Jan. 6.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1364, "text": "Crypto Long & Short: What Does Dogecoin Have to Do With Government Bans? The combined forces of passionate communities with potent tools, and the deepening involvement of institutions, make successful bans less likely.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 39, "Coin"]]}
{"id": 1365, "text": "\"Myanmar Military Blocks Facebook as Global Internet Disruptions Intensify Internet disruptions are costly, but that doesn’t stop governments from shutting down access.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 1367, "text": "Ethereum’s Favorite Lossless Lottery Will Airdrop Its POOL Token Today The distribution was designed to reward small depositors on PoolTogether who stayed in a long time.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Coin"], [54, 58, "Coin"], [131, 143, "Coin"]]}
{"id": 1368, "text": "Guggenheim CIO Says Bitcoin Could Eventually Climb to $600,000 Bitcoin has potential to support a huge long-term valuation but there isn't enough institutional involvement now, said Scott Minerd.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 27, "Coin"], [63, 70, "Coin"], [0, 10, "Organization"]]}
{"id": 1369, "text": "NYDIG Expects to Hold $25B in Bitcoin for Institutional Clients by Year End CEO Stevens said NYDIG's institutional order books are looking bullish for the year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [30, 37, "Coin"], [93, 98, "Organization"]]}
{"id": 1370, "text": "Robinhood to Allow Deposits, Withdrawals for Cryptos Including Dogecoin Currently, users of the popular trading app can only buy and sell cryptocurrencies within their Robinhood accounts.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[63, 71, "Coin"], [0, 9, "Organization"], [168, 177, "Organization"]]}
{"id": 1207, "text": "Bitcoin Taproot Upgrade Nailed Down for July, but Some Finer Details Still Aren’t Finalized The finalized code for Taproot will be shipped in March, but will it house the “user activated soft fork” feature that threatened to activate SegWit?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [8, 15, "Organization"], [115, 122, "Organization"]]}
