{"id": 602, "text": "Coinbase Customers Suffer Erroneous Charges. The post Coinbase Customers Suffer Erroneous Charges appeared first on CCN With customers experiencing erroneous credit card charges for cryptocurrency purchases, Coinbase has blamed Visa", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [116, 119, "Organization"], [208, 216, "Organization"], [228, 232, "Organization"], [54, 62, "Organization"]]}
{"id": 302, "text": "would you like to participate in my research on crypto coins by filling in the link;[https://www.survio.com/survey/d/I1K2E9F8J9U4I3Y9A](https://www.survio.com/survey/d/I1K2E9F8J9U4I3Y9A)  It's for a school project and you'd help me a lot with it. Feel free to leave a comment and share with friends and family, that would greatly improve the research.   Sorry if my english isn’t perfect, I am from the Netherlands :). Groetjes Marijn/Jimmy!", "meta": {}, "annotation_approver": "fintechml", "comments": [], "labels": []}
{"id": 304, "text": "Love him or hate him, Joe Rogan has a massive audience that continues to grow. Andreas Antonopoulos is a repeat guess appearing on shows 466, 490, and 844. With the the last airing in September 2016. With the increased interest, his voice broadcast to Joe Rogan's huge audience again, can only benefits bitcoin as a whole.", "meta": {}, "annotation_approver": "fintechml", "comments": [], "labels": [[303, 310, "Coin"]]}
{"id": 303, "text": "Please advice guys. stock market or BTC?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 39, "Coin"]]}
{"id": 305, "text": "“Bitcoin has no value.” “Have you heard of the tulip bubble?” “You can hold a gold coin but where’s your bitcoin?”  These are the tirelessly repeated observations of otherwise intelligent Americans I talk with. I always find myself wondering how they can’t see it. They’ve seen firsthand the dawn of technologies like the personal computer, smart phone, internet, etc. and read about the dawn of countless other marvels like the automobile, airplane, oil, and so many more. Why don’t they see the similarity between bitcoin and these other disruptive and unstoppable technologies?  I don’t know the answer to this question but one distinct difference between the emergence of bitcoin and other technologies is who is adopting it first. Traditionally, the rich are the first to adopt a new invention. For example, air travel was prohibitively expensive initially - nothing more than a luxury for the 1% that everyone wanted but just couldn’t afford. Over time however, air travel scaled and improved and became much more accessible to the average person. This is the clear and obvious path for new technology, and the same pattern seems to hold true for almost everything. Here is where bitcoin is in stark contrast.  In the case of the United States, we’ve had a relatively good run in the last century, so people here are naively accustomed to thinking that any tech that will change the world the world will start here-first for the rich-and eventually filter its way to the rest of the world.  Bitcoin is doing just the opposite. The people who have the highest need for bitcoin are those in unstable countries. It is normal for the government in these countries to abuse the currency and inhibit individuals from building wealth. The intrinsic utility of bitcoin in Turkey is clear. But Americans and citizens from other rich countries are completely sheltered and oblivious. Because of these circumstances, adoption of bitcoin is happening much faster outside of the US than in it. And the vast majority of Americans will wake up one day and realize they missed the boat.  P.S. The boat hasn’t left yet, so get on while you can.  Disclaimer: I’m sure others have pointed this out before but I enjoy this community and wanted to share my thoughts. Cheers.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[1, 8, "Coin"], [105, 112, "Coin"], [676, 683, "Coin"], [1759, 1766, "Coin"], [1924, 1931, "Coin"]]}
{"id": 306, "text": "I did this a little bit today and, after crunching the numbers, I actually lost money.  Supposedly zero fee.  What's going on? Any explanation of what's actually going on behind the scenes whenever crypto is traded for crypto on Coinbase?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[229, 237, "Organization"]]}
{"id": 307, "text": "Bitcoin was thought to be used as a currency. Not digital gold. The main difference between this two is the amount of transactions. Until 2140 we are covered. Mining comes with a prize. But what happens in 2140? Transactions will happen rarely (no one wants to use their bitcoin, they just want to save it), miners won't have a reason to mine (little tips), so miners will stop mining, and security will drop. What am I missing?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [271, 278, "Coin"]]}
{"id": 308, "text": "Hello i forgot my blockchain pasword any help here i changed the phone i had signed in in the last phone i dont remember the 12 words", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 309, "text": "If you invest today at 49k, to get a 100% return btc would have to increase by 50k. The most optimistic trajectory btc would go towards in the next couple of years is 100k-300k. This means the max profit you would be able to generate in the next couple of years is 6x of the invested amount today. Most of us have a couple of thousand invested (not well off yet). This will never be able to make you rich. Let's say you invested 5k in btc. When btc hits 300k you would have 30k. Invested 10k? You have 60k. I'm not saying it's a small sum of money but it is not in any way a life-changing amount.   I think a lot of people have unrealistic expectations and are too invested in the price changes when it doesn't have that much impact on their life at all.  I'm not giving financial advice and not shilling any coins, but wouldn't it be better to invest in alternatives that have more potential to generate gains even if the risk increases? What do you think?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[435, 438, "Coin"], [49, 52, "Coin"]]}
{"id": 310, "text": "Not sure that was the name, it was the time when everyone was looking for gold in rivers and mountains in the 1800s I believe, I might be wrong.  Some people had luck and got rich, and most people never find a pebble.  But, the companies that got REALLY rich, were those selling the equipment to look for gold. And I mean shovels and all kind of similar hardware back then.  What companies are investing not in Bitcoin, but in business related to Bitcoin?  Any tips on this?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[411, 418, "Coin"], [447, 454, "Coin"]]}
{"id": 311, "text": "I wanna mine for a day just to try bitcoin mining but what if the internet was cut or power was cut will the coins disapear or if will the mining stop once i get disconnected fron the  internet? Please i appologize if these questions are already asked.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 42, "Coin"]]}
{"id": 312, "text": "Looks like whales are starting to take action on the price consolidation... what does this actually mean?  To me it looks like they are selling BTC? (From their wallets to exchange). If someone that is smarter than me can explain, that would be great. :P   Source: [https://twitter.com/whale\\_alert/status/1360753599257735170](https://twitter.com/whale_alert/status/1360753599257735170)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[144, 147, "Coin"]]}
{"id": 313, "text": "Oh no! Bitcoin uses more energy than a small country.   Oh No! Banks are trying to regulate Bitcoin  Oh no! Governments are trying to ban Bitcoin.  Oh No! Countries or trying to make Bitcoin illegal.   Oh No! Bitcoin is too volatile and has slow payments.   Oh no! Bitcoin is going to zero. ZERO!  Oh no! My favorite alt coin is better than Bitcoin.  Oh no! Bitcoin isn't backed by anything.   Oh no! Bitcoin is a bubble!   Oh no! Bitcoin is rat poison!   Oh No! Anyways.   Bitcoin is here and it DGAF about you or your feelings. You can't do anything about it on your own. It exists and can't never un-exsist. The question is, you can either make it part of your finances or have fun being poor.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 14, "Coin"], [209, 216, "Coin"], [183, 190, "Coin"], [401, 408, "Coin"], [431, 438, "Coin"], [474, 481, "Coin"]]}
{"id": 314, "text": "does anyone know if someone makes a bitcoin mining space heater that the public can buy?   electric space heaters can be pricey to run. they might as well be earning a little money back for you.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 43, "Coin"]]}
{"id": 315, "text": "Here is the link to the YouTube vid. Its one of the most well crafted presentation I have seen in a while.   [https://www.youtube.com/watch?v=REC5V7d3pqM](https://www.youtube.com/watch?v=REC5V7d3pqM)  Summary: The probability to ban cryptocurrencies gets less likely as the marketcap increases due to the classical problem in game theory called the prisoner's dilemma. The video just got posted today.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 31, "Organization"]]}
{"id": 316, "text": "Hi everyone, not a first time poster and have been a holder since... well since bitcoin was $500/coin (it's been a minute).  I've made a [free videogame on steam](https://store.steampowered.com/app/1175140/Vecter/) that has taken off and in which I'm now going to accept bitcoin donations, however a LOT of people still don't know what bitcoin is, so I want to take the opportunity to educate them through the game.  Basically I want to have a secret level of the game that is only accessible when you press the \"What is bitcoin?\" button which will have a YouTube video playing in the background explaining what bitcoin is and why it's important. Kind of like this: [https://gyazo.com/8583b8417ae0d1b3bee80a91b178b947](https://gyazo.com/8583b8417ae0d1b3bee80a91b178b947)  The level will also have its own custom colour scheme and everything.  The question I have for you guys is, what's the best youtube video that you know of that explains bitcoin. It has to be on youtube because that's the only platform the game supports and it has to be a public video.   Preferably this video should be very basic and easy to understand, as it will have an audience that won't be familiar with the concept at all, so the easier to understand the better.  Any suggestions? Thank you!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[521, 528, "Coin"], [612, 619, "Coin"], [966, 973, "Organization"], [556, 563, "Organization"], [156, 161, "Organization"], [336, 343, "Coin"], [80, 87, "Coin"], [271, 278, "Coin"]]}
{"id": 317, "text": "Anyone here invested in GBTC? Curious if they issue a schedule k-1 for taxes. Thanks in advance.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 28, "Coin"]]}
{"id": 318, "text": "SOLVED  thank u  ~~Hello wonderful people of r/Bitcoin,~~  ~~Hope all is well in your lives. I recently began using bitcoin as a means of payment, which led me to discover the incredible Miner Fees associated with doing so. Currently, it is costing me ~$16 to move any amount of bitcoin from one wallet to the next. After some research I discovered this number had dropped to sub $1 last November, if true - when can we expect it to begin it's descent?~~  ~~I think $16 is incredibly ludicrous for my current usage - granted it is a small price to pay for the ability to use currency internationally.~~  ~~p.s.~~  ~~i ask because I didn't transfer enough funds to my wallet on the first go, and now to top off my wallet [to cover for Miner Fees] I am being charged an additional $16 in Miner Fees. I understand that is working as intended, I'm just curious when we could potentially see lower fee costs~~", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[45, 54, "Organization"]]}
{"id": 319, "text": "Spread the word, education is key, Educate your friends, family, neighbors, acquaintances, people at work, your boss, everybody you know.   Consult them on how bitcoin works and the benefits it has, explain to them the blockchain technology and usefulness of bitcoin in the future with our failing government and fiat inflation.   The more people that understand the way that bitcoin works and the benefits it has, the more adopted, main stream, utilized and normal it will become, which will in return make it go higher.  One of the main reasons regular people don’t like bitcoin is because people don’t like things they don’t understand, especially older or stubborn people that are very stuck in their ways with the current Fiat system that’s failing before their eyes.  People are more interested in BTC now as opposed to years ago, due to the fact that it’s on the news almost every day, but most still don’t fully understand how it works or even how to buy it. The news fails to explain that for some reason, but even though it is catching attention, if people don’t understand how it works they won’t invest into it.   A lot of people didn’t understand how the Internet worked and chose to turn a blind eye to it, I’m sure they’re kicking themselves now for not listening maybe to that one family member or friend who tried to educate them on it.   EDUCATION IS KEY", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[160, 167, "Coin"], [573, 581, "Coin"], [259, 266, "Coin"], [804, 808, "Coin"]]}
{"id": 320, "text": "I’m 50+ I don’t know how to begin to find them. I have no proof. But I’m an honest person. I paid $25.00 for them each. It wasn’t a scam. My teenage son got me into it back when it first started. How can I recover them?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 321, "text": "I first bought 12/16/2017, pretty much the peak of the last cycle. I hodled I was depressed I bought more I bought more I just kept buying. I learned a lot about economics along the way and grew even greater conviction. Closing in on a trillion $ market cap I’ve been full of happiness and conviction. I think the game is won, most don’t know yet. I will hodl on!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 322, "text": "So I used the saved html file from bitaddress to generate new bitcoin addresses on a new, clean system offline with no access to the internet and once I check them on the blockchain website they show up as existing with 0 balance plus usual btc / bch split. How is that possible? Shouldn't the search return an invalid search result of they had been created offline?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[241, 245, "Coin"], [247, 251, "Coin"]]}
{"id": 339, "text": "My friend owns a company that he started last year and sometimes it gets super busy and I help him out since I have a lot of extra free time. He always wants to pay me when I help out, but I am pretty comfortable financially already so I refuse his money. He's still been keep a tab of how much he owes me. Instead of having that money just sit there, I was wondering how hard it would be for him to just use that money to buy btc. Does anyone have any info on how businesses could buy bitcoin and what kind of tax implications it has?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[427, 430, "Coin"]]}
{"id": 340, "text": "I'd appreciate it", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 323, "text": "I remember mining from the Bitcoin client somewhere between 2010 and 2013. Sometime in between I accidently loaded my Bitcoin wallet.dat file in the Doge client and it partially synced. I know I had at least partial coins in original Bitcoin client. If I load the file into the Bitcoin client it shows 2 transactions that are Meta doge deposit information and they never verify.  [Pywallet.py](https://Pywallet.py) shows 203 private keys and address, Which means the data appears to be there.  \\-Salvage wallet fully run with no positive outcome.  I have manually imported all 203 private keys to a new wallet. No change.  If wallet.dat file is loaded into a text editor there is a about 20 lines of pooldata at the end of the file.  Bitcoind - -zapwallettxes=1 shows 203 encrypted keys, 1 unknown wallet record. Maybe getting closer?  Any chance of recovery here? Any further ideas are welcome.  No I will not send you my wallet", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[27, 35, "Coin"], [149, 154, "Organization"], [381, 392, "Organization"], [118, 126, "Coin"], [234, 242, "Coin"], [278, 286, "Coin"]]}
{"id": 324, "text": "I have a Coinbase account but have been recently blocked from using it, what is the next best app to use?   Please remove if this question isn’t aloud.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[9, 18, "Organization"]]}
{"id": 325, "text": "Coins that have been secured in wallets which people have lost the keys to? Or sent to the wallet of a different crypto currency by mistake?  Would that not mean that there will be potentially a lot less than 21m bitcoin in circulation?  As we know banks reprint lost or destroyed currency, I wondered what would happen in this scenario?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[213, 221, "Coin"]]}
{"id": 326, "text": "If you’ve ever heard his podcast, he goes on some hilarious rants quite often about Big Banks and Corporations. How they essentially rip off the middle class. Thoughts?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 327, "text": "Can reddit make Elon paint a bit/doge coin on his rocket? So that we can go to the moon.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 32, "Coin"], [33, 42, "Coin"], [4, 11, "Organization"]]}
{"id": 328, "text": "I tried out Kraken but they only allow you to wire money and I can't afford to do that I'm just investing a little amount of money. So can someone help me get a good website for buying bitcoin?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[12, 19, "Organization"], [185, 192, "Coin"]]}
{"id": 329, "text": "You’ll see the headlines in the next 72 hours.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 330, "text": "BitPay app stopped working today about midday. The app is not working at all if u try to navigate its just frozen. I’m wondering if anyone else is having problems with the app.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 331, "text": "Not sure this is 100% verified given I've only read articles as opposed to anything from the government yet:  [https://www.theblockcrypto.com/post/94740/india-to-ban-crypto-investment-completely-report](https://www.theblockcrypto.com/post/94740/india-to-ban-crypto-investment-completely-report)  [https://www.investing.com/news/cryptocurrency-news/india-finally-bans-cryptocurrencies-gives-investors-six-months-to-liquidate-their-assets-2417977](https://www.investing.com/news/cryptocurrency-news/india-finally-bans-cryptocurrencies-gives-investors-six-months-to-liquidate-their-assets-2417977)  [https://www.bloombergquint.com/business/intent-on-ban-india-to-give-transition-time-to-crypto-investors-bq-exclusive](https://www.bloombergquint.com/business/intent-on-ban-india-to-give-transition-time-to-crypto-investors-bq-exclusive)  Don't know if it'll actually go through, but implications if it does? Nigeria did the same and it supposedly didn't go so well for them.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 332, "text": "Knowledge is the gateway to escape from poverty. Free knowledge is the highway to the financial freedom. Thx  [@michael\\_saylor](https://twitter.com/michael_saylor) to allow this and special thanks to  [@stephanlivera](https://twitter.com/stephanlivera) to create and share the hard work done  \"Bitcoin for everybody\" is an essential guide. You rock !!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[295, 303, "Coin"]]}
{"id": 333, "text": "Hi guys, how are you today? So I am very interested on Bitcoin and I have no previous experience on it. I'd like to start buying my first pieces of Bitcoin today but I'm not very sure where to start and where to hodl them. After some research I found out that you should not be hodling your coins on an exchange but on a wallet. I saw that Electrum was a very recommended wallet and you can use it either on a desktop or an android device. My question is if I use Electrum on my everyday android phone to hodl Bitcoin would they be at risk because of viruses and stuff like that?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[55, 63, "Coin"], [148, 156, "Coin"], [340, 349, "Organization"], [464, 473, "Organization"], [510, 518, "Coin"]]}
{"id": 334, "text": "It’ll let me buy any crypto except BTC. Why? And I still never figured out how to remove my money from the damn app. Now I have my little $10 in Ether 🙄 gimme my shit back damnit!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 38, "Coin"], [145, 151, "Coin"]]}
{"id": 335, "text": "My country has determined that crypto is an asset and capital gains tax must be paid. That's fine, but how would transaction fees (from sending crypto from one wallet to another) be counted? Is this a capital loss, a fee?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 336, "text": "I decided I want use a paper wallet to store my btc. I'm just wondering how can I view the contents without have to import any address to third party websites that could be hacked.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 51, "Coin"]]}
{"id": 337, "text": "After spending the last month or two doing my own research (to which I’m bullish on the future of Bitcoin), I find myself almost searching for alternative views to almost bring me back down to earth.   I guess I believe the price could explode but it’s the level of certainty amongst investors that almost makes me sceptical - I know fudster!  Despite the various challenges Bitcoin faces, my biggest to me is (and one of the reasons I’m interested in a bitcoin firstly) - Centralised banks.  While the idea of a currency away from government control is certainly an amazing concept (and could soon be reality), do we generally believe the banks / governments will ‘allow’ this to happen. I know the technical structure means they haven’t really got a choice but the idea of independent digital state currencies being enforced as an alternative to bitcoin is certainly an angle I can see them pushing.  I guess I’m after some honest (emotionless) assessments (from those of you more knowledgable than me) of why Bitcoin is destined for widespread adoption, and why any attempt to contain that will ultimately be in vain.  Thanks,", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[375, 383, "Coin"], [454, 462, "Coin"], [1012, 1019, "Coin"], [98, 105, "Coin"]]}
{"id": 338, "text": "I am in my mid 30s and have been lucky enough to see three major cycles-housing, tech, and crypto.  Disclaimer-not investing advice, yada yada yada  I will tell you one thing-the people I know with real money are buying bitcoin. The people will kind of real money-well, they are buying bitcoin, and trying to buy more. And the people without money but with good income-well, a lot of them are waiting to buy bitcoin. And, they will blame everyone but themselves when bitcoin goes to $200k, or they will not dollar cost average, yolo in at 55k, see a 2k drop, panic sell, etc.  For the younger generation that had the guts to buy this when it crapped the bed-good for you. I wish lambos, mansions, and wealth upon you and your families.   The real challenge is most people with a higher than average income think they are smart, that they can time markets, etc. It is the most ridiculous thing-but I am starting to realize it's very common.  Bitcoin reminds me of housing in 2014-2015-at this point, most people turned bearish, waiting for the next crash. What they didn't understand at the time, nor did I, was why it was happening-massive debasement and lowering of rates. If you haven't figured it out, the government will go crazy trying to prevent a crash. Just wait till the REAL money printing starts. IMHO, bitcoin is about to leave orbit.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[286, 293, "Coin"], [220, 227, "Coin"], [408, 415, "Coin"], [467, 475, "Coin"], [941, 949, "Coin"], [1314, 1322, "Coin"]]}
{"id": 341, "text": "Thanks to binance I lost my crypto. 2fa authentication didn’t matter because someone gained access to my gmail address and was able to take my crypto. Gmail wasn’t triggered for unknown device access. Binance didn’t alert or ask for 2fa. Binance didn’t send me an email/text to say transfer and withdrawal of crypto. The customer service make you wait 5 hours just to pass you to another agent. Then the manager cuts you off. Tickets that take 48 hours for reply don’t get answered it’s been over 4 weeks", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[201, 209, "Organization"], [151, 157, "Organization"], [10, 18, "Organization"], [105, 111, "Organization"], [238, 246, "Organization"]]}
{"id": 342, "text": "I’ve read that if you own .28 you are in the top 1%. What’s the math behind this?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 343, "text": "[https://usdtalk.com/thread-74.html](https://usdtalk.com/thread-74.html)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 344, "text": "I tried but it reminded me of Block TV. Should I be watching it?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[30, 38, "Organization"]]}
{"id": 345, "text": "I’ve seen some thread discussion in the past few weeks debating the necessity of storing bitcoin at an exchange (or any third party) vs self-custody via seed phrase. A primary argument against self-storage I’ve seen appears to stem from lack of information. (Arguing people are more likely to lose their keys thus, it is more reliable to keep their bitcoin on something like cashapp, paypal, coinbase, etc…) How often do people lose their car keys, their driver’s license, social security ID? If this sentiment about personal bitcoin storage is, in fact true (I can’t verify this anecdotal statistic) then I would think it would be more indicative that people don’t treat their value as it deserves. If I gave you ‘X’ representing 1000 shares of apple in 2010, would you have protected X then with the tenacity you would were it valued at the current price of $100k+? What if ‘X’ was a pen? Who hasn’t lost a pen? If you had $10k cash sitting in front of you right now, what do you think is the likelihood that you would  simply lose it?  It is all dependent on the individual; the point is that it is on the custodian to secure their own objects of personal value. Whether it is ten thousand dollars USD cash sitting on your dining room table or a 12-word phrase worth ten thousand dollars written on a bar napkin.  Bitcoin doesn’t need to be on an exchange in order to gain value or hedge against inflation like fiat does in stocks, etfs, banks lending it out, etc... You can keep it as secure offline as you can to the extent that you trust yourself to be responsible for it and value it for what you anticipate its future worth to be. Banking has made it easy for people to be disconnected from the responsibility of maintaining their own wealth by placing it in another’s trust to the point where it is taken for granted. This is a **luxury** of resigning personal responsibility.  Bitcoin represents an opportunity to hold outside of institutions. Those who take advantage of this will fortify themselves against potential hacks, breaches,  exchange failures, or scenarios in which  governments feel the need to step in and seize assets from a third party who may be all to willing to part with it to cover themselves. Has a bank needed to be bailed out in your lifetime? Exchanges are not covered by this in the same way banks are. Crypto is a rising field, it isn’t currently protected by FDIC in the same way fiat is, and I’m not willing to risk those potential variables. If your keys are stored offline, they cannot be hacked in the conventional way that most think exchange servers can. If you maintain your keys responsibly, no one can access or transfer your wealth but you.  Secure your seed phrase (Secure your own personal value), and Hodl.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[384, 390, "Organization"], [392, 400, "Organization"], [349, 357, "Coin"], [1317, 1325, "Coin"], [1887, 1895, "Coin"], [526, 534, "Coin"], [375, 382, "Organization"], [2397, 2402, "Organization"]]}
{"id": 346, "text": "So I'm trying to figure out how much money was gained just by my money resting in my Bitcoin wallet but I also added and gained money in the wallet in other ways as well so if I wanted to see how much my initial deposit of 0.00304 Bitcoin grew since the deposit on January 15 how would I figure that out? Is there a site that calculates stuff like this?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[231, 239, "Coin"], [85, 92, "Coin"]]}
{"id": 347, "text": "Last Monday we woke up to Elon announcing his 1.5 Billion buy and the price went up by I don't remember how much.   Whats up today? The US is just waking up on a Monday and price nothing is moving much yet, either direction.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 348, "text": "Rumors swirling about Apple and Amazon already buying and haven’t announced yet. Anyone have any info ? On possible amounts or announcement dates ?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 39, "Organization"], [22, 28, "Organization"]]}
{"id": 349, "text": "fellow bitcoiners, i feel like the volatility of the btc is kinda smoothering down in the very short term and i think that is caused by the large amount of traders out there my doubt is whether the price of btc would EXCLUSIVELY rise when whales are buying or will we see the massive adoption take part of the huge spike everyone is waiting for?  first post here love for the community 💟", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[207, 211, "Coin"]]}
{"id": 350, "text": "Been into Bitcoin for about a year, I find it an interesting concept and have been very active on its price volatility. I’ve wanted to set my money in it but my parents won’t allow me. I could have over doubled my money by now. How do I convince them?   I’m asking for friendly advice no hate comments please :)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 18, "Coin"]]}
{"id": 351, "text": "These guys continue to trick merchants into using their service by saying the merchant can accept Bitcoin.  Then when someone tries to pay in Bitcoin it rejects the transaction unless the customer uses the GoCrypto wallet.  Sly fox.....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[142, 150, "Coin"], [206, 215, "Organization"], [98, 105, "Coin"]]}
{"id": 352, "text": "Origin Protocol provides a platform for building peer-to-peer marketplaces and e-commerce applications. Users can buy or sell goods and services on these marketplaces, and developers can create their own applications powered by the Origin blockchain.The Origin token (OGN) is used as an incentive, payment, and governance asset in the Origin ecosystem. Origin’s mission is to enable true peer-to-peer commerce.  Lower Fees Centralized intermediaries often charge 20-30% in transaction fees. Airbnb grossed $2.6B in fees in 2017, while Uber took home a monumental $11.8B in fees in 2018.  By removing the middlemen, Origin removes these fees. Buyers and sellers can share the savings from the fees that are no longer paid to traditional marketplace operators.   Core team  Josh Fraser - Cofounder  Josh started coding at the age of 10. Prior to Origin, he co-founded three other venture-backed companies: EventVue, Torbit (acquired by Walmart Labs) & Forage.  Matthew Liu - Cofounder  Matt was the 3rd PM at YouTube (acquired by Google) and VP PM at Qwiki (acquired by Yahoo) and Bonobos (acquired by Walmart). He has an MS and BS from Stanford.  Yu Pan - Founding Engineer  Yu Pan was one of the 6 founding team members of PayPal and was the 1st employee at YouTube. He is a former Google employee and co-founder of Kiwi Crate.  Franck Chastagnol - VP of Engineering  Franck has had a successful career as an early employee at numerous high-profile companies. He previously led engineering teams at Inktomi, Paypal, YouTube, Google and Dropbox.  Kay Yoo- Finance & Operations Kay is a Chartered Professional Accountant (CPA). She previously worked as a Senior Accountant and then as a Senior Consultant at KPMG Canada.  Overview  Ethereum-based platform for building peer-to-peer marketplaces.  Price: $0.393323  Market Cap: $92,486,835  Circulating Supply: 235,142,200 OGN  Total Supply: 1,000,000,000 OGN  Possible Coinbase listing   Total number of tokens in investor and team lockups: 39,772,166 OGN  Total number of staked tokens: 36,641,633 OGN  Total number of tokens founders have sold: 0 OGN  https://aws.amazon.com/blogs/awsmarketplace/launch-a-blockchain-powered-ecommerce-store-with-dshop-in-aws-marketplace/  Thoughts?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[232, 239, "Organization"], [254, 266, "Coin"], [335, 341, "Coin"], [353, 361, "Coin"], [491, 497, "Organization"], [844, 850, "Organization"], [950, 956, "Organization"], [1028, 1034, "Organization"], [0, 15, "Organization"], [268, 271, "Coin"], [615, 621, "Organization"], [535, 540, "Organization"], [904, 912, "Organization"], [914, 921, "Organization"], [1007, 1015, "Organization"], [1068, 1073, "Organization"], [1100, 1107, "Organization"], [1079, 1087, "Organization"], [1135, 1143, "Organization"], [1282, 1289, "Organization"], [1223, 1230, "Organization"], [1316, 1321, "Organization"], [1508, 1514, "Organization"], [1516, 1523, "Organization"], [1525, 1532, "Organization"], [1730, 1738, "Coin"]]}
{"id": 364, "text": "I’m pretty new to the crypto world, but recently I’ve been learning a lot about this stuff and I’ve become fascinated. I have a pretty decent understanding of stock trading and my background is in finance so I have a decent understanding of the market and the economy. With that being said, I understand that stock picking trading strategies are different than crypto trading strategies because they are two different beasts. I understand the importance of an exit strategy when it comes to something this volatile.   The thing I’ve noticed the most is the amount of alt coins that skyrocket seemingly on a daily basis. I’m adding new coins to my watchlist daily and although they are not ‘all’ moonshots, a lot of them ARE FUCKING MOONSHOTS. Like I hinted to earlier, I’m well aware of the risk potential with these things so I’ve really been trying to learn as much as I can before I jump in. It seems like momentum trading might actually work pretty well with these alt coins just because of the sheer number of different coins I’ve seen jump in value. I’d like to learn about some crypto momentum strategies that take into consideration 1.) Fundamental/value 2.) News media/hype 3.)Charts  Does anyone have any good resources on this subject? I’d love to hear your personal strategies as well!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 353, "text": "So I'm new to seriously investing in crypto (I had a minor interest and mined maybe 0.00000xxx coins in 2013, and am one of the many people who regrets not taking it more seriously at the time) but I have a business background and I consider myself a highly competent trend forecaster.  I've seen a lot of people comparing the current bull run with the trends before the 2013 and 2017 crashes-but I don't see it. I obviously understand that crypto especially is volatile and will see both upwards and downwards spikes, however many people are talking about a halving and I just don't see it in the cards.  The difference I see between the previous crashes and now is that:  A. Cryptocurrency has largely increased its reach into public consciousness, and there is a significantly larger pool of buyers who will jump on any dip.  B. We are reaching the tipping point of credibility for defi in general, mostly because   C. Institutions and even governments are beginning to see the immense opportunity in investing seriously in defi. This is what I believe to be the major mitigating factor towards a large upwards trend that, yes, will correct at times-but will not drop in the ways seen before where public opinion had a huge hand in what way the market went. Companies are going to buy, they're going to buy big, and they're going to hold. They're not day traders that can't afford to lose a couple of grand because they have rent coming up at the end of the week and can be scared off by a dip. If governments begin treating bitcoin the way they do gold, we could see a huge portion of bitcoin taken off the market indefinitely.   Overall, I'd love to be wrong, and see an opportunity to buy again at prices that I now see as long gone, but it just doesn't seem realistic to me that it will. I actually strongly believe many companies have started buying since tesla made their statement, and are waiting to slowly buy the massive investments before announcing and driving the price up once more. This will also cause a chain reaction, if large institutions begin to buy and hold, as other companies scramble to get in before the snowball effect takes the prices to the moon.  I'd love to hear if there are any compelling arguments to counter my thoughts.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[1589, 1597, "Coin"], [1528, 1536, "Coin"]]}
{"id": 354, "text": "Apparently Warren Buffet's theory on stock market stability is based off of GDP being tied with stock market valuation. And currently with this huge bullrun we are at around 190% of our GDP indicating a crash soon. Seems historically accurate and crypto usually trends with stock so it has me concerned.   Also I heard a stat that 30% of all money in circulation was printed last year. Combine the never ending printing of money and the \"Buffet Indicator\" has me worried about an impending crash. Not to be a \"Doomer\" just wondering if my concerns are unfounded or if anyone has has looked into this?  [https://markets.businessinsider.com/news/stocks/warren-buffett-indicator-nears-record-high-threatens-stock-market-crash-2020-12-1029857054#:\\~:text=The%20%22Buffett%20indicator%22%20compares%20the,when%20GDP%20was%208%25%20lower](https://markets.businessinsider.com/news/stocks/warren-buffett-indicator-nears-record-high-threatens-stock-market-crash-2020-12-1029857054#:~:text=The%20%22Buffett%20indicator%22%20compares%20the,when%20GDP%20was%208%25%20lower).", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 355, "text": "Like clockwork, my portfolio seems to tank beginning Friday evening and continually drops until Monday morning.  It's become such a regular thing, that I often wonder if I shouldn't just sell off my alt coins every Friday afternoon and buy them back on Monday morning.  Of course, as soon as I'd do that, the markets would change and I'd lose out on huge gains... But you get my point.   Have any of you noticed this? Any theories as to why?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 356, "text": "Sorry if this the wrong place to ask, newbie here.  If you have any other wisdom to share, much appreciated thanks.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 357, "text": "Check out r/bittrex, I just popped in to see if I could get help opening my account that was inexplicably shut down, and it looks like LOTS of people are having this problem with no reply from tech support, also on twitter, and bittrex is not responding to support tickets, some going on for weeks.  I also have gotten no reply from anyone.  I have a bad feeling shit is about to go down at bittrex, anyone who has their coins there may want to consider moving, this looks REALLY suspect.  Are they covering up a breach of some kind?  EDIT:  And looking at the mod list... none of them have made any comments or replies or posts for a week despite massive amounts of complaints piling up.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 19, "Organization"], [215, 222, "Organization"], [228, 236, "Organization"], [391, 398, "Organization"]]}
{"id": 358, "text": "Grayscale CEO, Michael Sonenshein, shared in an interview last Wednesday that institutions like Tesla, Square, PayPal, and Twitter integrating Bitcoin to their operations and portfolio will echo through 2021. Michael Saylor, Jack Dorsey, and Elon Musk have started a Bitcoin trend that institutions are massively adopting. Sonnenshein elaborated that most of these companies are venturing into Bitcoin because of unavoidable regulations.  [https://cryptocrunchapp.com/news/grayscale-ceo-institutional-demand-for-bitcoin-will-echo-through-2021/](https://cryptocrunchapp.com/news/grayscale-ceo-institutional-demand-for-bitcoin-will-echo-through-2021/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[103, 109, "Organization"], [123, 131, "Organization"], [267, 275, "Coin"], [394, 402, "Coin"], [0, 9, "Organization"], [96, 101, "Organization"], [111, 117, "Organization"], [143, 151, "Coin"]]}
{"id": 359, "text": "Just wondering what peoples strategies are since this will not go up forever. Likely a couple months before the bull season ends. Hodl? Sell then buy back immediately? Sell then walk away for the year of the bear?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 360, "text": "Is coin switch legitimate? . currently other trading include maker, taker fee but coin switch claims it has no trading fee which Is not at all true and every user knows it but the real question is how safe is this company?  and also huge fees doesn't even guarantee the backup plan for that application. I predict that their plan is to make enough money from investment and just go bankruptcy because the whole buying and selling process really looks fake , instant but other apps struggle to place the order", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 14, "Organization"]]}
{"id": 361, "text": "There are so many cryptocurrencies out there and all have them have seen a huge rise recently, is there a crypto you can recommend that is still undervalued that I can yolo some money into.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 362, "text": "To put things in perspective, I always convert the total supply of an altcoin to 21 million (like BTC). And do the same with its price  ***Example for Doge:***   **- P** = Actual price of 1 Doge (being 0.07 USD)   \\- **S** = Total supply of Doge (being 123.345.470.276)  The price of 1 Doge, at the same supply of Bitcoin would be: **S\\*P/21.000.000 = 428 USD**  It's a pretty basic trick, but can make 'seemingly cheap coins' look much more expensive and vice versa.  Source: [I got it from this article.](https://powrusr.com/apply-this-tip-trick-before-investing-in-any-altcoin/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[98, 101, "Coin"], [241, 246, "Coin"]]}
{"id": 363, "text": "Historically, how much does the Chinese New year affect the markets? Obviously money will be pulled off the table, I was just curious if anyone had any good stats or models or anything really", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 399, "text": "Robert Hackett, the Senior Writer at Fortune Magazine, joins Worldwide Exchange to discuss Bitcoin's continued rise, and where else investors can look in the crypto space.  [https://usdtalk.com/thread-61.html](https://usdtalk.com/thread-61.html)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 45, "Organization"], [91, 101, "Coin"]]}
{"id": 400, "text": "Forget the moon. We're shooting for the stars on this one.  You can compare ASKO with AAVE. (6.45 BILLION Marketcap, Also a lending platform)  Current Marketcap for ASKO is (USD): 31,362,273 (Low!) and the Circulating Supply is only 107,455,199 tokens (also low).  1064 People are currently staked on asko.finance. Total Staked is 63,404,395 tokens. That's 45.78% of Total Supply! This is crazy.  Why is ASKO worth your time?  * AAVE only has 23 assets listed and available. ASKO will list 11 tokens at launch with more lined up for availability shortly after launch is confirmed stable. * Tierlending with different risk categories is one big difference from AAVE.  In Askolend you can choose between a high slash-risk pool with a change that can result in assets slashed or a lower risk pool with no chance of slashing. That means that the rewards are higher in the slash-risk pool. You have options here! Live dangerously and gain sick gains or move one careful step at a time?  Look, the coin is sitting at a 31.3 million market capitalization. AAVE is at a 6.5 BILLION Marketcap. (Jesus christ) Let's say Asko is only 10% successful, okay? 10% of AAVE is an x20 from now.  Heres some comfy bulletpoints:  * The contracted developer that wokred on Askolend is from dOrg. (Developer team that worked on The Graph, Gnosis, Balancer and eToro). Here is the kicker: The Graph has over a 2.5 Billion Marketcap. Also, don't you see eToro ads all over? Think about it. * Their code is fully audited and passed security audits after some minor fixes. A new audit is coming up soon. * CEO is from USA and hes pretty damn based. His last name is Curry but he's white as hell lol. If you have any questions and he's not busy he always tries to answer.  \\-The whole community is cool and welcoming (Well, MOST of us are...lol)  Okay...so TLDR / shill me quickly what sets ASKO apart from competitor AAVE? Why not just invest in that?  Well, In AAVE if you’re staking your AAVE tokens in the safety module you may lose up to 1/3rd of your staked amount if there’s a sudden insolvency and the protocol needs to balance it out.  Yet with Asko, when you stake you can choose between the before mentioned high risk pool with that chance to be slashed or the other lower risk pool with no chance.  Don't forget that Asko plans to have many more assets added after launch to their lending platform.  Not only that but they have other huge project ideas in the works that you have to join the Telegram channel to learn about.  This is only the beginning and you can be part of it.      Useful links:  dextools.io ETH/ASKO Pair: https://www.dextools.io/app/uniswap/pair-explorer/0x63804d757b5b7c43509fded8f7ce10cc0bac2ae0  Offical Telegram channel: https://t.me/Askomain  Quillhash Audit: https://drive.google.com/file/d/1JwCCkcWnhpiXkaJMhms8WLY_hmzEkrL9/view  dOrg Medium post AMA: https://medium.com/@thegeneral1/askobar-network-x-dorg-team-x-american-hito-of-uniswap-army-8be7113c049b  dOrg tier lending protocol (Askolend) hire announcment tweet: https://twitter.com/dOrg_tech/status/1303258902977564672", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[429, 434, "Coin"], [475, 480, "Coin"], [1306, 1315, "Organization"], [1366, 1375, "Organization"], [76, 81, "Coin"], [86, 90, "Coin"], [165, 170, "Coin"], [404, 409, "Coin"], [660, 664, "Coin"], [1152, 1157, "Coin"], [1049, 1054, "Coin"], [1317, 1323, "Organization"], [1325, 1334, "Organization"], [1338, 1343, "Organization"]]}
{"id": 401, "text": "50%BTC 25%ETH 5%DOT 5%ADA 3.75%XLM 3.75%LINK 3.75%AAVE 3.75%SNX Does this seem like a good split of my fund that I have invested in crypto? I’m new to this and I plan to just hold my crypto and add some funds occasionally. Are there any of these you would increase or decrease?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 7, "Coin"], [10, 14, "Coin"], [16, 20, "Coin"], [22, 26, "Coin"], [31, 35, "Coin"], [40, 45, "Coin"], [50, 55, "Coin"], [60, 64, "Coin"]]}
{"id": 402, "text": "Did anyone see that the zytara dollar is live? Saw it on their twitter a while ago. Any thoughts?? Super excited for this.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 31, "Coin"]]}
{"id": 365, "text": "India is banning crypto currency   ***highlights*** Government has proposed a bill to ban crypto-currency in India.  India might get its own virtual currency in future   On February 28, 2019, the Finance Ministry committee on virtual-currencies recommended a ban and suggested that India should create a digital rupee. It also drafted a bill banning all crypto activity in the country, punishable with fine of up to Rs 25 crore or with an imprisonment term of one to ten years, or both  \"A high-level Inter-Ministerial Committee (IMC) constituted under the Chairmanship of Secretary (Economic Affairs) to study the issues related to virtual currencies and propose specific actions to be taken in the matter recommended in its report that all private cryptocurrencies, except any virtual currencies issued by state, will be prohibited in India,” Nirmala Sitharaman said   mean really? what they will get by baning crypto currency 😂. the point is crypto currency should operate in decentralised.what is the purpose if it's gets banned and regulated by government. what makes them differently from others?  Bharat coin ? no body would invest in it anyway  now a days government in India is spending money in parliament to take away good opportunities from investers. what a joke. for your information Nirmala sitharaman is finance minister who has this great mind.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 366, "text": "Using the right set of crypto trading tools coupled with a proper trading mindset is crucial to realize success in cryptocurrency trading. Here is a guide to [cryptocurrency trading tools you should consider using in 2021 and beyond](https://cryptoadventure.org/the-ultimate-guide-to-cryptocurrency-trading-tools/).", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 367, "text": "[\\#RioWallet](https://twitter.com/hashtag/RioWallet?src=hashtag_click) is a decentralized application ([\\#dApps](https://twitter.com/hashtag/dApps?src=hashtag_click)), that allows users to interact with [\\#RioChain](https://twitter.com/hashtag/RioChain?src=hashtag_click) to send and receive [\\#cryptocurrencies](https://twitter.com/hashtag/cryptocurrencies?src=hashtag_click), as well as to view their public key and manage other [\\#assets](https://twitter.com/hashtag/assets?src=hashtag_click).   For now, RioWallet is available on Desktop.   https://preview.redd.it/el99m3pnp9h61.jpg?width=680&format=pjpg&auto=webp&s=5b33696b6336f588e3e5d8984a27ebc6198e09e7", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[508, 517, "Organization"], [2, 12, "Organization"], [205, 214, "Organization"]]}
{"id": 368, "text": "Hi all  I want to realize some gains but I am extremely nervous.  &#x200B;  I have read advice here that said you should \"season\" your fiat for 90 days before spending it on a mortgage. I just want a new car/or a down-payment on one. Any advice for seasoning?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 369, "text": "I'm waiting for a dip to purchase some more ETH/BTC... Currently the price has dropped just a bit... Anyone have a strategy in place for when they plan to 'buy the dip'? Would love to hear your plan! I was thinking of waiting till Ethereum was about $1300USD, just not sure if it will dip that low.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[44, 47, "Coin"], [48, 51, "Coin"], [231, 239, "Coin"]]}
{"id": 370, "text": "Hi all,  &#x200B;  I'm looking for a bot to trade signals given on discord rather than on telegram. I know Cornix does it for telegram, is there anything similar for Discord signals?     Thank you!   &#x200B;  Regards", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[107, 113, "Organization"], [166, 173, "Organization"]]}
{"id": 371, "text": "I compared a lot of the major cryptos from all of the major exchanges and then compared the first recorded date on those to the ones on coingecko. The data from the exchanges never really goes further back then 2015-16.   For example DASH on most exchanges is only charted back to 2019, despite having records that go back much further than that.  Is there a reason for this? I’m relatively new to trading crypto so forgive me if this is obvious.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[234, 239, "Coin"], [136, 145, "Organization"]]}
{"id": 372, "text": "My latest article and update for those following [Galaxy Digital and GLXY Stock](http://averagejoecrypto.com/glxy-stock-update-new-information-about-mining-holdings-and-retail/). Updates on holdings, mining, and retail operations.   If you are interested in doing more research on GLXY, or other crypto related stocks. I have a bunch of posts on my site. I run the site solo and have covered crypto for a few years.   As always, thanks for the support and good luck out there.  Best, Joe", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[281, 285, "Organization"]]}
{"id": 373, "text": "This question is for those who have invested in cryptocurrencies. As everything is growing right now, some coins are like GRT and LOOM are growing tremendously. I have also a question to everyone about whether or not GRT/USDC is good to enter now as it is already $2.5.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[122, 126, "Coin"], [130, 135, "Coin"], [217, 220, "Coin"]]}
{"id": 374, "text": "February 12 will take place the G7 meeting. Representatives of the countries will meet to discuss central bank digital currencies and digital taxation.  The world's financial leaders believe that the digital currency field is in need of regulations. The next step after the taxation policy for CBDC is the crypto regulation.  The chairman of Autorité des Marchés Financiers, Robert Ophèle called attention of the European finance sector to the problem of the lack of supervision on the crypto market.  What do you think we should expect?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[294, 299, "Organization"], [342, 373, "Organization"], [32, 35, "Organization"]]}
{"id": 375, "text": "Matic Network (now polygon) is making huge moves. This will go to $1-5 this year and $10 next year. This is easy money...the project speaks for itself.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"]]}
{"id": 376, "text": "Has anyone considered the impact a global war using EMP would have on the crypto markets?  Unlike commodities, property and fiat currencies, the crypto world is 100% digital. Which means, if the electricity dies on a global scale so does crypto. (Now lets make a film about this!)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 377, "text": "So over the past few days / week every single ALT coin seems to have gone on massive pumps, 10%, 20%, 30% and some even higher. Even coins built on the ethereum block chain have been going nuts.   All while $ETH has been bouncing between a few percentages back and forth.   I understand that gas fees are ridiculous right now. Miners of ETH are trying to fill their bags before ethereum goes from PoW to PoS in the coming year. But it doesn't mean that Ethereum should be held down in price. I've read based on fees ETH should sitting around $2500 USD in value yet is holding steady at 18K.  My theory on the next few days though is that ETH has alot of profits moved into it from ALT coins seeing corrections and eventually takes off. To which highest point I'm not sure, but anything holding from $2300 - $2500 USD is good with me.  I'm just curious to see what others are thinking? Do you think it is going to start climbing or just stay stagnant while the rest of the market continue to grow in cap? Do you think ETH is stuck until EIP-1559 in the summer?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[337, 341, "Coin"], [378, 386, "Coin"], [516, 520, "Coin"], [638, 642, "Coin"], [1017, 1020, "Coin"], [207, 211, "Coin"], [453, 462, "Coin"]]}
{"id": 403, "text": "Other than just holding your defi coins, what are the most reliable ways you've found to earn money in this space? Do you stake any particular coin? Etc  With so many options, and so much to learn. It is overwhelming at times to pick a strategy.  EDIT: thank you all for taking the time to try and help. After buying $100 worth of ETH in Metamask, the gas fees to do any sort of transaction are so insane that I can't navigate a way around this to ever make any money. Really a shame, but what can you do.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[331, 335, "Coin"]]}
{"id": 558, "text": "I recently got into crypto about a week ago and accidentally invested in Ethereum classic  instead of Ethereum. I got lucky and ended up doubling my money and got out. But ETC is so low compared to regular ethereum. Does it have a future?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[102, 110, "Coin"], [172, 176, "Coin"], [73, 89, "Coin"], [206, 214, "Coin"]]}
{"id": 378, "text": "Cryptocurrency    1. **Not your keys, not your coins.** Don't let others hold your coins for you. 2. **Hide your private keys.** Nobody should ever see your private keys beside you. Beware of cameras around you. 3. **Make at least one more copy of your private keys.** Avoid \"single point of failure\" situations. Dogs eat homework papers for decades now. 4. **Write parts of your private keys on at least 2 separate pieces of paper that you will never store together.**  If someone finds a piece of your keys, they will still be pretty useless without the other part. 5. **Always use a clean computer.** You don't want to risk having a keylogger installed. 6. **Never use public Wifi.**  7. **Store your coins in more than 1 wallet.** 8. **Download wallets only from official sites.** Scammers don't sleep. 9. **Never tell the amount of coins that you are holding.** Or at least lie that you owned some but sold too early. 10. **Contribute to the community.** Maintain a node, mine, help newbies, make memes. 11. **Promote cryptocurrencies.** The network needs to grow. 12. **Most people are here just to make more fiat.** Crypto is about getting out of fiat. 13. **Don't buy dips.** Pro traders buy bull trend confirmations. 14. **Don't sell tops.** Pro traders sell bear trend confirmations and pre-planned targets. 15. **Don't get in debt to invest.** 16. **Content creators are your enemy.** Speculative daily discussions about potential price rises or dumps are counterproductive.  17. **Check transaction addresses twice.** Make it 3. 18. **Do your research.** The best way to be involved in crypto is to learn about it. 19. **When in doubt, remind yourself about fundamental values.** 24/7 limitless, permissionless, borderless, often fast, and low fee transactions from one unbreakable vault to another guaranteed by distributed consensus. How valuable is that? İt must be fast and feeless (Nano) 20. **Owning cryptocurrencies means being responsible for your own money.** Some people like to say that owning crypto means being your own bank. Not only that. You become a bank owner, an accountant, a treasurer, IT support, and a security guard.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 379, "text": "You can buy them on kucoin!   They already have blockchain based games on STEAM!   They already have built in oracles and are interoperable with ethereum!  Oracles are going to be huge in the future and are the main reason chainlink blew up! Imagine this blockchain has oracles and is interoperable with NEO AND ETHEREUM!!!   They also have smart contracts , NFTs, encrypted messages, ID verification, encrypted email, encrypted file storage, defi solutions, chainswap, infinite side chains, and the very first multi chain (eth, NEO, soul, waxp) nft marketplace..  Also they are EXTREMELY scalable way more than eth and neo combined at 5000tx per second!    look at phantasma.info for more info    Phantasma Blockchain Phantasma blockchain was built from the ground up with one goal in mind: to be a one-stop solution for both blockchain developers and dApp users.  Explore our ecosystem to understand how we will achieve our target.  Explore Phantasma    DUAL TOKEN   STAKING   CHAIN SWAP   SIDECHAINS   GAMING NFT   TOKENIZATION   ORACLES   DEFI   STORAGE   EMAIL   CHAT   ID  Phantasma Ecosystem  Dual Token Phantasma mainnet was launched in October 2019. SOUL is the main token and KCAL is the gas for Phantasma blockchain, generated by staking SOUL. KCAL utility: pay transactions fees, deploy smart contracts, mint NFTs, block producer selection, cosmic swap, chat, email, voting and cryptocurrency.   Staking You receive 0.002 KCAL /day for each staked SOUL. 1 SOUL is the minimum amount you can stake, for a minimum period of 24 hours. If you stake 50,000 SOUL you receive 100 KCAL /day (3,000 KCAL /month) and additional SOUL from a pool of 125,000 SOUL /month. The interest is up to 18% per year. Stake now!   Chain Swap You can swap SOUL and KCAL from Phantasma to NEO or Ethereum blockchain, any time and as many times as you want. The same interoperability will also apply to any non-fungible tokens NFT created on Phantasma, NEO or Ethereum. Read more here.   Sidechains Phantasma blockchain supports infinite sidechains. The speed of each sidechain is 5,000 tx /second. Phantasma can scale infinitely and can also be a scaling solution for other blockchains due to its interoperability.   Gaming NFT Phantasma is bringing the next-level NFT and blockchain gaming solutions to the gaming industry. Mint on-demand (mint in real-time), Multi-Layer NFT, STEAM bridge to blockchain games through Pavillion, NFT Marketplace, Free Minting by staking SOUL, Blockchain SDK (Unity, C#, C++), Ethereum NFT swap and Esports.   Tokenization The smart contracts and the NFT technology developed on Phantasma blockchain, enables you to tokenize everything: real-estate, exotic cars, art, diamonds, movies, games, athletes, sports teams, documents etc. Read the Deloitte report about tokenization.   Oracles Phantasma was developed to have in-built Oracles right from the mainnet launch, back in October 2019. Phantasma already uses its native Oracles to provide live external (off-chain) data to Phantasma’s smart contracts.   DeFi Solutions The native Oracles and the Smart Contracts built on Phantasma blockchain make things easy for developers to deploy DeFi solutions on a scalable blockchain with extremely fast TPS and very low fees.   Storage The decentralized file storage solution, developed by Phantasma team, enables developers to create true decentralized applications – True dApps. The files are encrypted and distributed across all the Block Producers, and only managed by the private key owner.   Email Every mail is encrypted and stored on the blockchain for maximum security. It can fetch regular emails from centralized servers through the Phantasma Oracles. The ultimate email dApp in your hands.   Chat A safe and encrypted chat with the chat log stored on Phantasma blockchain. Nobody will be able to read your messages. It will support sending cryptocurrencies to each other, similar to WeChat support for fiat currencies transactions.   ID By staking SOUL you can unlock the Phantasma ID feature, which lets you set a username for your Phantasma wallet address. Your Phantasma username can be used to easily receive funds, as an email address or chat nickname. Tokens Utility SOUL is the main utility token and KCAL is the gas for Phantasma blockchain, generated by staking SOUL. || SOUL circulating supply: ~93 million || KCAL circulating supply: ~23 million ||", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 26, "Organization"], [524, 527, "Coin"], [1206, 1216, "Organization"], [698, 708, "Organization"], [620, 624, "Coin"], [1985, 1995, "Organization"], [1763, 1773, "Organization"], [1783, 1792, "Coin"], [145, 153, "Coin"], [312, 320, "Coin"], [529, 532, "Coin"], [534, 538, "Coin"], [540, 544, "Coin"], [612, 616, "Coin"], [943, 952, "Coin"], [1658, 1663, "Coin"], [1928, 1937, "Organization"], [1939, 1943, "Coin"], [1946, 1954, "Coin"], [1776, 1780, "Coin"], [2497, 2506, "Coin"]]}
{"id": 380, "text": "While experts were arguing about Apple and would it buy Bitcoin or not, Twitter announced its desire to participate. The Chief Financial Officer of Twitter Ned Segal said on Wednesday that Twitter is looking for options to pay employees in cryptocurrency. It was also said that Twitter wants to put a part of its funds into Bitcoin.   Do you think this is the real beginning of mass adoption? After all, if people get paid in crypto they don’t have other options but to use it.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 38, "Organization"], [72, 80, "Organization"], [148, 156, "Organization"], [56, 64, "Coin"], [278, 286, "Organization"], [324, 331, "Coin"], [189, 197, "Organization"]]}
{"id": 381, "text": "The UniLend Finance partnership with union finance will bring about about collateral optimization in the UniLend Finance platform.  Allowing borrowers to use some of their collateral to protect a portion of their capital in order to hedge against liquidation.  [Infographic Explanation ](https://i.imgur.com/07QJzoL.jpg)   [Full details here ](https://unilend.medium.com/union-is-joining-the-unilend-ecosystem-to-bring-collateral-optimization-to-unilend-users-b2e1df3fcd01)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Organization"], [105, 113, "Organization"]]}
{"id": 382, "text": "What are your favorite apps & sites for staying in the now with cryptocurrency? Do you have a workflow when it comes to checking your crypto news or do you bounce all around? I follow numerous youtubers / Twitter peeps + have ALL notifications set to ALL so I get live time updates.   I want more & I want it faster.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[205, 213, "Organization"]]}
{"id": 383, "text": "So, I'm a jan 2017 hodler, didn't touch any of it** and even added to the stack over the last 4 years.  while I'll continue to hodl like 80% of my stack, after 2017 it seems wise to me to take profits in a bull market such as right now. Do y'all sell a lump sum (say, 5% or 10% of your crypto stack) or \"dollar cost average\" sell the 5-10% over some months?  **I did use 0.1 BTC to do sports betting when btc was around $7k in 2018 I think or maybe '19. I thought I was doing well with my sportsbet account - the btc I put in cashed me $700 at the time, I rode it down to like $200, and then won back up to now I'm at $1250 (+$550). And it's not like I broke even, I almost doubled the size of my account. But that .1btc would be worth $4800 today had I not turned it into fiat, and then doubled that fiat.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[375, 379, "Coin"]]}
{"id": 384, "text": "I have been tracking crypto for a while and have defined a strategy that works pretty well by exploiting the 24 hr chart.  Here is the 24 hr chart for Doge: https://imgur.com/yt8zb0Y  You can see if we measure where the start of the chart is to the end we get the 24 hours % gain/loss metric. https://imgur.com/nBVyJel  Since we know the 24 hr chart displays the % change compared to 24 hrs ago we can reliability predict when the coin will show positive % gain on 24 hrs or negative % gain on 24 hrs.   In this example we can see that the 24 hr % change will go negative (and approach negative at 1:44 pm): https://imgur.com/2F7niNK https://imgur.com/ndKUPK0   Because a lot of crypto traders falsely use the 24 hr % change as a metric for buying and selling we can exploit this behavior by making buys and sells accordingly to when the 24% change will go negative or positive.  When the price moves fast you can make a lot of good trades based on \"future knowledge\".", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[151, 155, "Coin"]]}
{"id": 385, "text": "One of my favorite nuggets I came away from my time in college was learning about the rule of 72. Basically, you can figure how long it will take to double your investment by dividing your interest rate into 72. So for example, If I invest $10,000 and make 10% interest each year, I will double my money in 7.2 years (72/10 = 7.2).  Now fast forward to the cryptoverse where you can make 5-10% gains in the course of a few minutes. Now, you can apply this same concept and double your stack in a fraction of the time. Compound interest is a beautiful thing.  With that being said, some people can not handle trading and should just HODL. You know yourself best.  \\*disclaimer taxes, FOMO, and bad timing\\*", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 386, "text": "I’m new to trading and wondering what the proper term is when you are “shorting” crypto but NOT borrowing it, just selling your own.  Do you still refer to it as “going short” when you plan to buy it back again at a lower price?  Such as when the market is in a longterm up-trend and you are selling at the local wave’s highs, before the price pullback, and buying it back once the pullback ends and starts trending upward.  I understand this is just “Selling High, Buying Low” but  wondering if it’s still referred to as “shorting”.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 404, "text": "Would outline Navcoin that is coming with unique standards. NavCoin is an easy to use digital currency - run by its community. It’s programmable money that lowers the cost of doing business in the Web3 economy. Designed for fast, cheap, and secure peer-to-peer payments. A network that's driven to lowering the cost of doing business. NavCoin funds itself using the most advanced community fund ever built. The first fully-decentralised, fully-autonomous fund that only the community controls.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 21, "Coin"], [335, 343, "Coin"], [60, 68, "Coin"]]}
{"id": 405, "text": "uniswaproi is now liquidityfolio but it’s still 0.5 ETH per year to use.   I’m usually checking briefly to see the status of liquidity pools and can’t find another site that provides a similar product.   Even if I had to paste the address manually, I would not mind that to keep 0.5 ETH", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[52, 56, "Coin"], [283, 286, "Coin"]]}
{"id": 406, "text": "I stake AAVE in the protocol and earn 6.12% APY.  I lend DAI for a 12% APY.  I Borrow Uniswap for 1.07% APY and hold it for growth.  Thanks for your inputs!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[8, 13, "Coin"], [57, 61, "Coin"], [86, 94, "Coin"]]}
{"id": 407, "text": "There are not many solutions that follow my requirements, would outline Seascape - The Ultimate Game Platform Designed Around the DeFi & NFT Economy. Cross-chain interoperability solution with heavy focus on games. Keep all assets connected to major chains such as Ethereum and Algorand. User-facing game store built with DeFi in mind. Any user can serve as a PoS validator. Monthly gamepasses for users, no fees for game devs", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[265, 274, "Coin"]]}
{"id": 387, "text": "This is not not financial advice.  The value of crypto is only its current market value, no underlying anything (absolutely no delta game here). It's one world ahead of fiat currency, because no institution will/can guarantee its value, but it works because anyone can fuel the price of anything, if done by the millions of individuals.   Approaching two:  1. Bitcoin, the most solid demanded of them all. What Tesla did should come as no surprise. Bitcoin has been steadily growing with prospects of reaching from $150k (not hard in 2-3 years time), to $400k (maybe a stretch in the medium term, but if it holds its position as the prime crypto, it will get there eventually).  2. Dogecoin, the ever-devaluating crypto that needs insane injections of solid cash per year just to try to keep the price steady. A pump-and-dump, ponzi scheme, that by design can't ever reach thousands in  unit market price... but can reach many billions in market cap.  Why are these one and the same?  Because we suddenly have no control structure. No ties attached. It's pure supply/demand. The free market in its most beautiful purity. It's not attached to a government or currency, to indexes of how the economy is handling itself, to the prospective gains of the Wall Street billionaires.  Just supply and demand. Adam Smith and David Ricardo could've explained this shit centuries ago. It just came to happen in our days.  Add to it that crypto is NOW the prime way to control inflation. Central Banks everywhere and on the moon have been printing cash like there's no tomorrow. Much of this extra liquidity finds its way to crypto. This is both the reason the suits allow it even if they dislike it.  And in the case of Dogecoin, it's a money burning machine. It's doing Central Banks the favor of a lifetime.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[360, 367, "Coin"], [449, 457, "Coin"], [682, 690, "Coin"], [1709, 1717, "Coin"], [411, 417, "Organization"]]}
{"id": 388, "text": "After scanning over the markets for the past few days looking for potential undervalued gems that have not really taken off yet, I have come across NFTX. They are trying to create a more accessible and liquid market for NFTs. By solving this problem they could potentially bring NFTs to the mainstream and skyrocket their popularity to levels we have not seen yet. Recently NFTs have been gaining popularity with platforms like Rarible and the recent auction of the Lindsay \"Lightning\" Lohan NFT as well as Mark Cubans NFT (both linked below)  \\--I also noticed billionaire Gary Vaynerchuk is now following them on Twitter. (he is known to be quite the collector so I could see how he may be interested in the potential of NFTs)     [https://twitter.com/NFTX\\_](https://twitter.com/NFTX_) [https://twitter.com/garyvee](https://twitter.com/garyvee) (looks like its his most recent follow also)  **This coin has a very low supply and has massive potential to appreciate in value from here. I will be accumulating as much as I can.**  [https://coinmarketcap.com/currencies/nftx/](https://coinmarketcap.com/currencies/nftx/)   [https://www.youtube.com/watch?v=31gHycNtwlo&t=1s](https://www.youtube.com/watch?v=31gHycNtwlo&t=1s)   (was just mentioned on YouTube)  * Thesis on $NFTX by Grey Matter Capital: [https://twitter.com/JosephTodaro\\_/status/1360242149149863938](https://twitter.com/JosephTodaro_/status/1360242149149863938) **(mentions NFTX specifically at end of Tweet thread)**  *Lindsay Lohan NFT:*  * [https://app.rarible.com/token/0x60f80121c31a0d46b5279700f9df786054aa5ee5:124196:0x3781d92e5449b5b689fee308ded44882085b6312](https://app.rarible.com/token/0x60f80121c31a0d46b5279700f9df786054aa5ee5:124196:0x3781d92e5449b5b689fee308ded44882085b6312)   [https://twitter.com/lindsaylohan/status/1359548984474406916?s=20](https://twitter.com/lindsaylohan/status/1359548984474406916?s=20)  *Mark Cubans NFT:*  * [https://app.rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:113075:0x5492e0112e49e5fed0a7b1278c76df655e509a99](https://app.rarible.com/token/0xd07dc4262bcdbf85190c01c996b4c06a461d2430:113075:0x5492e0112e49e5fed0a7b1278c76df655e509a99)   [https://twitter.com/mcuban/status/1354498247700709388?s=20](https://twitter.com/mcuban/status/1354498247700709388?s=20)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 389, "text": "They have scammed me out of a nice chunk of money, i can detail what’s happened but I am posting it in all the cryptos so hopefully these fuckers lose some business.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 390, "text": "Hey guys,  I hope you are doing fine. I want to share with you the dashboard I have created during these last weeks and present you all the functionalities that you could use to enhance your trading strategies. A first version of the tool was involving tracking trending stocks in different social medias. But after many requests that asked for the same functionalities for Cryptos. I have created the following:  # - Reddit Trending Cryptos  In the pages *Trending Stocks* Reddit, Twitter, you have a list of the Cryptos that have been discussed the most in each of the social network. For Reddit, you'll be also able to select a specific subreddit and time granularity to check the cryptos that have been discussed the most in these specific subreddit. You will be able to see the Current Trending Score and Previous one, to see if a recent hype is building up around a given crypto. Same for Twitter & Google  # - Twitter Trending Cryptos  In this page we extract tweets that discuss each listed cryptocurrency and assign a score to the ones that are most discussed/ have most interactions in Twitter. List is updated each 30mn.  # - Other functionalities  We also have the same trackers for stocks, A Fund Index that buy the most trending stocks in Reddit and show the expected performance for such a strategy, a screener to see plots of the evolutions of the different scores And lot more exciting stuff coming up.  You can check out all that at [https://unbiastock.com/crypto.php](https://unbiastock.com/crypto.php)  Your comments and improvement ideas are more than welcome", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[482, 489, "Organization"], [895, 903, "Organization"], [905, 913, "Organization"], [1253, 1260, "Organization"], [474, 480, "Organization"], [917, 925, "Organization"], [1096, 1103, "Organization"], [418, 425, "Organization"]]}
{"id": 391, "text": "What are some good options for US residents to trade up to 25x leverage (crypto currency) without causing any potential legal problems?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 392, "text": "Following the release of the coin and up to 2500% gains on the off... The stability has been amazing despite the fluctuation of the big coins.  Last night saw positivity for the future of this awesome project and coin which is backed by Binance... as it hit a new kind of volatile spike before coming back to its floor.   SFP refuses to go below its initial floor and there is serious money to be made off the little pumps until it settles higher and higher each day  Join r/SafePal community and our very active and growing friendly chat group on telegram now which links a signal group.   Of course DYOR, I eat crayons and know nothing about trading... seriously.   Telegram - https://t.me/joinchat/IRtpgCOGBjCCz08M", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[322, 326, "Coin"], [237, 244, "Organization"]]}
{"id": 393, "text": "Fetch.Al and Decentraland are skyrocketing rn! Anyone buying these? How long will it last need some opinions!!!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 394, "text": "What are the best trading platforms to trade altcoins? Low fees? Trusted? Does it crash often? How easy is the interface?  Something like p2pb2b or something similar that has a LOT of exchange options. I’m tired of not being able to exchange to the coins I want because it’s not listed.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 395, "text": "Long time hodler here! Wanted to get some advice and info on where to start learning about day trading crypto. Currently using Coinbase pro for the low fees. Any advice is much appreciated!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[127, 136, "Organization"]]}
{"id": 396, "text": "Created this Dai Stablecoin community today since I had noticed there wasn’t one specifically for Dai.   r/DaiStablecoin", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[98, 101, "Coin"]]}
{"id": 397, "text": "Hey guys,   I have built up this small tool to extract the most trending cryptocurrencies in Reddit & Twitter. Do not hesitate to check it out and provide me with your suggestions. [https://unbiastock.com/crypto.php](https://unbiastock.com/crypto.php) :)  Cheers,", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[102, 109, "Organization"], [93, 100, "Organization"]]}
{"id": 398, "text": "Hello all, I'm new to crypto and I finally took the first steps 2 weeks ago. We chose Etoro but I've been seeing alot of people trash it and I wanna change asap.   1. Can I exchange what I have invested? To someone else? 2. Is Binance or Crypto.com a good choice or can I get some solid suggestions because there seems to be soooo many. Thank you in advance!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[86, 92, "Organization"], [227, 235, "Organization"], [238, 248, "Organization"]]}
{"id": 408, "text": "I've seen some projects in DeFi space where the Total Locked Valeu is much less than market cap, in some cases market cap is 10x more than TLV.  In the same way I am seeing some tokens where market cap is much less than TLV, $XVS has abou 6x more TLV than market cap.  How is TLV related to market cap (and price)?  Are the tokens that has much less TLV than market cap overpriced? In the same way, are the tokens that has much less market cap than TLV underpriced?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 409, "text": "&#x200B;  https://preview.redd.it/zx8kp2b0j8g61.jpg?width=800&format=pjpg&auto=webp&s=8e523f31adf1fe6a374a2c869128672a8b6a4ee5  **To celebrate the launch of YUSRA, CoinEx will airdrop 20,000 USD Worth of YUSRA, the details are as follows:**     **Event 1: Deposit to share 2,000 YUSRA**   Duration: 7:00 February 1, 2021 - 0:00 February 20, 2021 (UTC)   During this period, with a net deposit of every 100 YUSRA, user can get a reward of 2 YUSRA (max. 10 YUSRA per user). CoinEx will give away 2,000 YUSRA in total on a first-come-first-served basis.     **Event 2: Trade to share 3,000 YUSRA**   Duration: 9:00 February 1, 2021 - 0:00 February 20, 2021 (UTC)   During this period, with a trading volume of 200 YUSRA and above, user can participate in the ranking to share 3,000 YUSRA proportionally.    [Details](https://www.coinex.com/?channel=redditeng)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[164, 171, "Organization"], [204, 209, "Coin"], [406, 411, "Coin"], [440, 446, "Coin"], [279, 284, "Coin"], [587, 592, "Coin"], [711, 717, "Coin"]]}
{"id": 410, "text": "Just wanted to start a discussion. It seems like everytime I think the defi winners have been chosen someone new comes into the game. So currently what more do you think can be done", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 411, "text": "In the past January, we successfully launched 2-way rBridge, rFIS and rETH products, which is a great step for StaFi.  We are glad to see 1,425,648 ERC-20 FIS are swapped through rBridge product, and 512,084 FIS are staked in rFIS product, but this is far from enough.  In February,  we will continue to promote the adoption of rFIS and rETH by being integrated into third-party crypto wallets and launching StakingDrop campaigns.  At the same time, we will speed up the development of rDOT/rKSM, rXTZ and rATOM, and strive to deploy rDOT and rKSM on the testnet in February.  Let's keep moving and rocking in Staking derivatives 💪  💻 Read Full Update:  [https://link.medium.com/S0uhjZFqwdb](https://link.medium.com/S0uhjZFqwdb)  🔁Retweet: [https://twitter.com/StaFi_Protocol/status/1356225249709154308](https://twitter.com/StaFi_Protocol/status/1356225249709154308)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 412, "text": "I'm compiling a compendium of cryptocurrency and blockchain-related investment research. I think that with all these DeFi projects being launched, with new types of business models and novel types of capital structures, we might be entering into a new golden age of fundamental analysis.  If you have read (or written) an investment research (preferably with some empirical or fundamental reasoning behind it) I would be highly appreciative if you could point me to it or share it.   Thank you.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 413, "text": "Would outline AllianceBlock as one of the most worthwhile ecosystems now. AllianceBlock is building the world’s first globally compliant decentralized capital market. AllianceBlock Protocol is a decentralized, blockchain-agnostic layer 2 that bridges traditional and decentralized finance and automates the process of converting any digital or crypto asset into a bankable product. Compliant derivative products can quickly and easily be created out of almost any utility token, security token, cryptocurrency, synthetic, crypto portfolio, or DeFi solution. Google them, cause there are many great know-hows", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 28, "Organization"], [74, 88, "Organization"], [167, 181, "Organization"]]}
{"id": 414, "text": "Having one fav - would outline AllianceBlock as one of the most worthwhile ecosystems now. AllianceBlock is building the world’s first globally compliant decentralized capital market. AllianceBlock Protocol is a decentralized, blockchain-agnostic layer 2 that bridges traditional and decentralized finance and automates the process of converting any digital or crypto asset into a bankable product. Compliant derivative products can quickly and easily be created out of almost any utility token, security token, cryptocurrency, synthetic, crypto portfolio, or DeFi solution. Google them, cause there are many great know-hows", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[184, 198, "Organization"], [31, 45, "Organization"], [91, 105, "Organization"]]}
{"id": 415, "text": "Super cool partnership between Oasis Protocol (privacy-focused blockchain) and UTU (trust infrastructure) to deploy UTU on Oasis network. This can facilitate privacy-focused under-collateralized loans and more!  [https://medium.com/utu-trust/utu-and-oasis-foundation-form-partnership-to-deploy-utu-trust-infrastructure-on-the-oasis-network-39fc924c4c24](https://medium.com/utu-trust/utu-and-oasis-foundation-form-partnership-to-deploy-utu-trust-infrastructure-on-the-oasis-network-39fc924c4c24)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[123, 129, "Organization"], [30, 45, "Organization"]]}
{"id": 416, "text": "Good afternoon ofc. Lately found out PayAccept, looks like guys are coming with something new and are widely discussed, I find many unique points, for example - they are simple cryptocurrency management application for people around the world in order to tackle the issues. PayAccept will provide an interface that is intuitively easy to understand and through which users will be able to transfer and receive a multitude of cryptocurrencies meanwhile delegating responsibilities within teams if needed while remaining in full custody of funds and protected from cyber-attacks. PayAccept is being built with the mass adoption of cryptocurrencies. And they released their wallet today, will be available next week. What would you say? Curious to discuss", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 46, "Organization"], [274, 284, "Organization"]]}
{"id": 417, "text": "DYP is a Defi ecosystem designed to help investors earn passive rewards for Staking, farming, and participating in the ETH mining pools. DYP has its native token, dubbed DYP token, aimed at attracting investors to the platform. [Full review.](https://cryptopress.news/dyp-review-is-it-a-good-investment-platform/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Coin"], [119, 123, "Coin"], [137, 141, "Coin"], [170, 174, "Coin"]]}
{"id": 418, "text": "Looking to diversify my portfolio with some newer DeFi projects, what are your favorite 5 and why? Also I’ve seen recommendations for Reef, Axion, Rubic etc but they’re not available on major exchanges that I currently use, any recommendations?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[134, 138, "Coin"], [147, 153, "Coin"], [140, 145, "Coin"]]}
{"id": 419, "text": "What you guys think? In a year my tezos profit is 38% when in a day AAVE profited 36%.   What you guys think?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 40, "Coin"], [68, 73, "Coin"]]}
{"id": 420, "text": "Upload our Favourite music to your friends    Just visit www.kingex.xyz/app  Create new Account  Upload your Music to your friends and they can play it anytime and anywhere along they have internet access,they can download too if uploaded to your drive   www.speedkingtoken.icu", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 431, "text": "#Community #DeFi   📣 Encouraging DeFi Innovation at the Global DeFi Congress in Dubai, UAE  We are proud to support the Global DeFi Congress with a Gold Sponsorship. This is the first event in the MENA (Middle East and North Africa) region dedicated to understanding Decentralized Finance.   Our CEO, Denko Mancheski will be LIVE at the Congress, to discuss and debate with investors, regulators and experts on how DeFi can challenge and improve the existing financial system.  📅 Date: 10th Feb, 2021 ⏰ Time: 11:20 – 11:30 AM (GMT+4)  📺 The event will be streamed live on youtube: www.youtube.com/c/Tradedog  Join us to learn more about the DeFi movement from the brightest minds in the industry. If you're interested in the future of the blockchain space, this is an event not to be missed!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 421, "text": "My TokenSets newbie day 2, still fascinated. Not found yet:  **? an index/portfolio/fund with 2 properties/strategies**:  * *gains in DeFi / crypto* **(1)** via a robot / managed portfolio of winning tokens, but also * fiat *stablecoins* **(2)** to secure profits, whenever cryptos are crashing (often all at the same time ).  I had a long look at [Zerion](https://app.zerion.io/invest) and [TokenSets](https://www.tokensets.com/explore), and found good candidates already, for  **(1) DeFi and crypto gains**     DeFi Pulse Index [https://www.tokensets.com/portfolio/dpi](https://www.tokensets.com/portfolio/dpi)     PieDAO DeFi++ [https://pools.piedao.org/#/pie/0x8d1ce361eb68e9e05573443c407d4a3bed23b033](https://pools.piedao.org/#/pie/0x8d1ce361eb68e9e05573443c407d4a3bed23b033)     CC10 [https://indexed.finance/category/0x1](https://indexed.finance/category/0x1)    **(2) example for (crypto <-> fiat) balancing:**   GATOR [https://www.tokensets.com/set/gator](https://www.tokensets.com/set/gator)     (see \\^ \"Feed\") <--- e.g. currently 100% in \\~FIAT ! (cUSDC), and 0% wETH.  ***but ...*** what I want is **both**:  *I search for --> a combined TokenSet* <-- **\"DeFi plus DAI\"** kind of.  Perhaps you have a hint where else but at tokensets/zerion I can *search*? Overview of funds/portfolios website?  Or if you are an experienced (and willing) trader yourself, perhaps even create such a portfolio now? Then thank me later for this idea - I only want 3% of your profits, lol.  \\[Against stablecoins risks, perhaps some composite of (USDC, DAI, cUSDC, aDAI, etc ...), comparable to e.g. [BTC++](https://pools.piedao.org/#/pie/0x0327112423f3a68efdf1fcf402f6c5cb9f7c33fd) ?\\]  Thanks a lot!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 422, "text": "Having one fav, would say, there are not many solutions that follow my requirements, would outline Seascape - The Ultimate Game Platform Designed Around the DeFi & NFT Economy. Cross-chain interoperability solution with heavy focus on games. Keep all assets connected to major chains such as Ethereum and Algorand. User-facing game store built with DeFi in mind. Any user can serve as a PoS validator. Monthly gamepasses for users, no fees for game devs", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[305, 313, "Coin"], [292, 301, "Coin"]]}
{"id": 423, "text": "Right now, to be able to handle payments via cash, check, credit card, ACH, etc.... It's costing a lot for each transaction. Of course all of those are in the same currency. But they'll get handled in a different way; some funds to one account, some to another.   This seems like a DAO or some kind of project like that can take care of it easily.  I want to lower transaction costs for taking rent payment from tenants. I want to receive crypto (possibly) for payments, also USD, have that ready to easily xfer to needed accounts within my org, etc....", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 424, "text": "Liam will be connecting with StaFi's partner UniLend community to discuss the partnership with #UniLend protocol on February 8th at 6 PM IST.  Topics up for discussion will be: • Introduction of StaFi and rTokens • The future use cases between StaFi and UniLend.  ▶ Promotion Prize👇  🎁 10 lucky winners from twitter will each be rewarded with $10 in $FIS tokens 🤩  👥 The 5 Qs chosen by Liam to answer will each be rewarded with $20 in $FIS tokens 🤩  ▶Chatroom Link: [https://t.me/UniLendFinance](https://t.me/UniLendFinance)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[45, 53, "Organization"], [244, 250, "Organization"], [254, 261, "Organization"], [29, 37, "Organization"]]}
{"id": 425, "text": "The round was led by the venture capital firm Paradigm. It was also attended by the co-founder of Synthetix Kane Warwick and the head of the DeFi project Aave Stani Kulechov.  “*The funds will be used to further develop and secure the Gamma protocol, as well as to expand the Opyn team. We will focus on key research and hiring new developers*”, said Zubin Kotica, CEO and co-founder of Opyn.  ***An alpha version of the options platform was launched in the summer of 2019. The current version of the protocol, Opyn v2, has been in operation since December.***  “*Options are a key element of the financial markets. We are thrilled to help the team explore cutting edge areas such as capital efficiency, automated market maker mechanisms and scaling”,* said Paradigm co-founder Matt Huang.  In the summer of 2020, **Opyn raised $ 2.16 million in a seed round led by Dragonfly Capital**. Compound founder Robert Leschner and former Coinbase CTO Balaji Srinivasan also attended.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[758, 767, "Organization"], [98, 108, "Organization"], [154, 159, "Coin"], [235, 241, "Organization"], [866, 883, "Organization"], [887, 896, "Organization"], [931, 940, "Organization"], [276, 281, "Organization"], [387, 391, "Organization"]]}
{"id": 426, "text": "Hello guys, would outline 1 fav - NEXT exchange. Excited by the uniqueness of the ecosystem guys are bringing, especially:     Individual blockchain wallets for each trader (private key exporting as a planned feature)   Main and trading account balances making use of hot and cold wallets.   On-exchange transactions recorded on the Blockchain     What are your favs? You saw their website https://next.exchange?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 427, "text": "Hi all, new here. I'm a believer in the concept of defi and I'm trying to understand it better. One of my biggest questions is whether we want contracts to be decentralized and immutable. i.e. in some ways, is it helpful to have a 3rd party intermediary to run to if things go wrong.  For example, I could see two potential issues. 1. Where one party writes the contract and is more knowledgeable technically than the other party, and is able to include technicalities or loopholes that are not in the spirit of the contract. 2. Where an external circumstance or datasource (an oracle I think it is called) changes, glitches or is hacked to trigger the contract when in reality it should not have been triggered.  In these instances, isn't it good to have a third party who can pause or mediate the contract? How does defi handle this? I've googled and can't find a good answer  Honest questions. I'm here to learn.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 428, "text": "Hey there. Have you heard of what PayAccept is bringing onto the field? I find many unique points, for example - they are simple cryptocurrency management application for people around the world in order to tackle the issues. PayAccept will provide an interface that is intuitively easy to understand and through which users will be able to transfer and receive a multitude of cryptocurrencies meanwhile delegating responsibilities within teams if needed while remaining in full custody of funds and protected from cyber-attacks. PayAccept is being built with the mass adoption of cryptocurrencies. And they released their wallet today, will be available next week. What would you say?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 44, "Organization"], [226, 236, "Organization"], [530, 540, "Organization"]]}
{"id": 429, "text": "I'm a 4 year holder of BTC and ETH but only hold the coins on an exchange.  I'm super interested in learning about DeFi but am overwhelmed and unsure about where to jump in.  I'd love to learn about the future of the industry and how finance is going to change in the next decade, so would appreciate any pointers for an outsider to start learning.  Thanks!  EDIT: Thanks for all the responses! These are great and super helpful. Looking forward to learning more!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 27, "Coin"], [31, 35, "Coin"]]}
{"id": 430, "text": "interested to hear what everyone thinks. I’m going likely lock in a few positions", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 432, "text": "DeFi Yield Protocol ($DYP) is a revolutionary project that rewards liquidity providers directly in Ethereum. Their future roadmap looks promising as they try to create a fair #DeFi ecosystem. [Full story](https://cryptopress.news/a-look-at-the-dyp-staking-dapp-and-other-upcoming-features/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 25, "Coin"], [99, 107, "Coin"]]}
{"id": 559, "text": "Hi, I’m a relative noob to cryptocurrency, so my question is how would monitoring ones credit score work if crypto becomes mainstream? My understanding is one of the main benefits of crypto is its anonymity, but something like credit scores require ID. What’s the workaround here?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 433, "text": "How do I move my Aave v2 collateral and debt position to another wallet/cold wallet? Do I simply transfer the debt tokens and the aLINK collateral tokens to my new wallet and that’s it? Do I first have to transfer one or the other?  And I’m not at any risk of being liquidated due to the transferring of these tokens, am I?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 22, "Coin"], [130, 136, "Coin"]]}
{"id": 434, "text": "Would outline Cartesi from solutions I follow. Wide opportunities - Smart Contracts Taken to the Next Level. Build smart contracts with mainstream software stacks. Take a productive leap from Solidity to the vast universe of software components supported by Linux. Enable million-fold computational scalability, data availability of large files and low transaction costs. All while preserving the strong security guarantees of Ethereum. From games where players conceal their data to Enterprise applications that run on sensitive data, preserve privacy on your DApps. Google them, cause there are many know-hows", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[427, 435, "Coin"]]}
{"id": 435, "text": "Would outline AllianceBlock as one of the most worthwhile ecosystems now. AllianceBlock is building the world’s first globally compliant decentralized capital market. AllianceBlock Protocol is a decentralized, blockchain-agnostic layer 2 that bridges traditional and decentralized finance and automates the process of converting any digital or crypto asset into a bankable product. Compliant derivative products can quickly and easily be created out of almost any utility token, security token, cryptocurrency, synthetic, crypto portfolio, or DeFi solution. Google them, cause there are many great know-hows", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 28, "Organization"]]}
{"id": 436, "text": "Trying to lend into the TrueFi pool via Metamask. Confirmed the first transaction via MM with a $13 fee to 'approve TUSD spend limit'. Transaction failed at next stage due to insufficient balance. I'm only depositing \\~$1400 as a test but the tx fees are like $250. This doesn't seem to correlate with the amount being lent either and the same for $100.  Is this a tx fee in the traditional sense or a cost of joining the pool? Or is it due to such high network demand?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 30, "Coin"]]}
{"id": 437, "text": "WallStreetBet's UNISWAP Pump  [https://t.me/uniswap\\_wallstreetbets](https://t.me/uniswap_wallstreetbets)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 438, "text": "Cryptocurrency sub about Pulse Network eg. r/Cryptocurrency", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 439, "text": "https://medbid.medium.com/disclosing-pancakeswap-the-first-scam-and-cover-up-on-binance-smart-chain-f729d76dd0ed  I've only learned about DeFi fairly recently including PancakeSwap.  The article is about the issue with trading SYRUP and how a lot lost money.  Is PancakeSwap safe as a whole?  If you're staking in PancakeSwap from your Safepal wallet  are your cryptos safe?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[227, 233, "Coin"], [263, 275, "Organization"], [314, 326, "Organization"], [169, 180, "Organization"]]}
{"id": 440, "text": "Is anyone using their testnets? They seem unusable.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 441, "text": "Tixl Token (TXL) is the flagship asset of Tixl's Autobahn Network and connect Bitcoin and other Blockchains with DeFi use-cases, fast transactions and $0 fees:  * Yield Farming * Social Farming * Liquidity Programming * Payments * Lending * Oracles * Decentralized Insurance * and many more...  **NEWS**  Hodl TXL now is the best strategy, because of new news for february and we are on bullrun train again and some good marketing strategies are on roadmap. The new brand for tixl.finance will be maybe announced logo and icon competition could following. We should do it like Wallstreetbets! With big grains the project get a lot of attention and free marketing. You can see it on Game Stop all speak and write about it. Defi on bitcoin need some support from bitcoin community, that would helping a lot!  &#x200B;  **ABOUT TIXL**  Tixl Organization consists of an experienced team currently building the interoperable Tixl Ecosystem for Decentralized Finance (DeFi). Tixl´s interoperable layer 1 network enables any asset (incl. BTC) to be transferred instantly & with 0 to almost 0 costs.  The business model for Tixl’s Autobahn Network is based on its Tixl Token TXL. It is used for covering transaction & trading fees, as a utility in our partner’s data platform Tixl Finance and in any other own or 3rd party product. Fiat revenues collected from partner projects (Tixl Finance or the Social Mining Club) will be utilized for buy-backs or token burns.  &#x200B;  Explaining TIXL ECOSYSTEM on youtube:  [**https://youtu.be/w3hDTFfj3Lw**](https://youtu.be/w3hDTFfj3Lw)  &#x200B;  [Blockchain Comparison](https://preview.redd.it/4j6iaecu8ne61.png?width=1094&format=png&auto=webp&s=78b643e6d5ac5357be8e00d2cb575eaf3481c313)  **GAINS POTENTIAL 2021**  ➤ Bitcoin      $100000   ➤ 300%  ➤ Ethereum  $3000   ➤ 230%  ➤ Polkadot  $100  ➤ 588%  ➤ Chainlink $100   ➤ 476%  ➤ Cordano $1    ➤ 294%  ➤ Tixl Token (TXL) $3 - $5   ➤ 2142% - 3076%  &#x200B;  **TRANSPARENCY:**  Autobahn Network Mainnet v0.1 based on SCP (Stellar Consensus Protocol) Update: Januar 31 2021   In reality Autobahn Network has fees, but they are so low the value of Tixl Token (TXL) cover it up. That is the reason why team behind Autobahn Network say $0 transaction fees!  &#x200B;  **Locked Total Supply**  Most of circulating supply is time-locked. Having a long-term vision and goal, all future tokens will only be released slowly. The founder wallets are fully locked until mid of 2021. Thereafter, only 1% being released monthly until 2029. Other future tokens will also be time-locked to avoid high inflation. A maximum of 20,000,000 TXL shall be added to circulation each year starting 2021.  Bitcoin connection on Autobahn Network with $0 fees is just a beginning. Many usecases are stopped to grow on different blockchains with high fees. Autobahn Network is a solution for small value transactions in current blockchainspace.  For more information, visit:  ➤   [https://tixl.org/](https://tixl.org/)  Be viral and post about Tixl in your social channels. You can use my post as content or write better one, if you can! Do not forget 2021 is DeFi year the most DeFi tokens has value between $3 - $15 and with Tixl Token (TXL) you have the chance to be a part of massive gains in this year and beyond. Lets get Defi to Bitcoin and to other coins with high fees. Only together we are strong as a community. Just do it! (Slogan from nike.) Do not miss the bullrun train.  🚨 Read all informations about this project, before  you vote! 🚨", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[12, 15, "Coin"], [825, 829, "Coin"], [833, 850, "Organization"], [1755, 1768, "Coin"], [3296, 3304, "Coin"], [3199, 3202, "Coin"], [2691, 2708, "Organization"], [0, 11, "Coin"], [49, 65, "Organization"], [78, 86, "Coin"], [310, 314, "Coin"], [1788, 1796, "Coin"], [1893, 1898, "Coin"], [2609, 2613, "Coin"], [2669, 2677, "Coin"], [2199, 2215, "Organization"], [1966, 1982, "Organization"]]}
{"id": 442, "text": "Hey, have you read on EthereumX? Unlesh the power of staking and yielding based on smart-contract strategies to maximize APY, reward holders and kick out the weak-hands! And waait there is more, holders are getting the transaction fees from swaps. Ethereum X (ETHX) is an exchange, staking, and yielding token, designed to help users discover the benefits of DeFi. Every time ETHX is transferred, a small fee is taken, which is returned to the holders. This will protect the price and punish weak hands; ETHX has a maximum total supply of only 250,000 ETHX. Curious to discuss with you", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 31, "Organization"], [248, 259, "Organization"]]}
{"id": 443, "text": "DefiBids provides users with savings and excitement. You can secure a variety of different incomes just by participating in the network. [Full review](https://www.cryptofolds.com/defibids-allows-you-to-stake-your-auction-bids-and-earn-eth-rewards)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 444, "text": "Hey guys! What I would say, there are not many solutions that follow my requirements, would outline Seascape - The Ultimate Game Platform Designed Around the DeFi & NFT Economy. Cross-chain interoperability solution with heavy focus on games. Keep all assets connected to major chains such as Ethereum and Algorand. User-facing game store built with DeFi in mind. Any user can serve as a PoS validator. Monthly gamepasses for users, no fees for game devs", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 445, "text": "Hello guys,     I've found this site [https://www.bunny.money/home](https://www.bunny.money/home) and wanted to know if we have project like that in DeFi.  So from what i've understood, it's an app where you can put money and get 1% APY interest. From that profit you can go to a \"market place\" and donate to a charity you want.   It's not specified how you earn interest and they don't talk about cryptocurrency on their website.   So i think this is possible on defi with the use of Liquidity pools and if the project goes well with stacking of a token (?). Have you seen any project like that ?  If not would someone do it ? Also the issue of a token could be nice to enable stacking and add another way of interest. With the token, the project could finance partnership with the charity and have \"event\" like mint NFT for charity (?)  &#x200B;  Thanks for the read mate.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 446, "text": "Hello everyone.  I would like to present the Defi Of Thrones project whose token is the DoTx.  This is a low cap project with a token burn system that puts two DeFi projects in competition in \"wars\". These wars have a duration that can vary from a few days (1-3 days) for projects with a low Mcap against a week for projects with a large Mcap. This period is divided into two phases of equal duration:  \\-phase 1: you can bet on the project that you think will win the war.  \\-phase 2: you can no longer bet and you pray that your project wins.  &#x200B;  During phase 1 you can \"betray\" the project on which you had bet and your bet will then be moved to the other project (this with a cost of 1% of your bet). This is why there is phase 2 so that you cannot change projects at the very last minute even if your choice will lose. Several wars can be launched simultaneously so as not to have \"time out\" in betting.  At the end of the war the project with the biggest percentage increase wins. The winners get their bet + 85% of those of the losers. The 15% which is not recovered by the winners will be split in two:  \\-10% in a early pool (we will talk about it below)  \\-5% (0% for the moment) will be burned (which implies that the more bets there are during wars, the more the DoTx becomes rare and therefore the price increases).  The pool works as follows:  It allows users who bet more than 500 DoTx before 1/4 of the duration of a war to be eligible for the Early Pool.  This pool is filled with 10% of the tokens of each losing house for 25 days. At the end of the 25 days, eligible users can stake DoTx during a chosen period to claim their Early Bag. It therefore rewards the most reckless people who bet early in a war and even if you lost all the wars, you can get DoTx back!  Basically the project was running on Ethereum and a burn contract was ready and functional, but the costs to bet were too high so the team made the choice to migrate to Matic in order to drastically reduce the costs. The contract has not yet been transposed to Matic, but it is planned.  For those who want to take advantage of this great project and hold DoTx but do not want to bet then you can also stake LP tokens (withdrawable at any time) to earn MANA points every second, and of course take advantage of the price increase thanks to the burn .  The Mana Pool:  Each ticket bought during a war gives you one MANA point. You can also stake LP tokens (withdrawable at any time) to earn MANA points every second. These points will be redeemable for NFTs.  In short DoTx is:  \\-a prediction and gambling project  \\-a scarcity of DoTx therefore an increase in prices  \\-staking  \\-NFTs  The version on Ethereum was functional but as said above the costs were too high, however some wars have taken place on it. A beta on Matic is scheduled for the first week of March.  To find out more about the project, its roadmap or take a look at the Dapp and thus see the previous wars that took place on Ethereum:  \\-website: [https://defiofthrones.io/](https://defiofthrones.io/)  \\-Dapp: [https://app.defiofthrones.io/war](https://app.defiofthrones.io/war)  \\-Telegram: [https://t.me/DeFiOfThronesOfficial](https://t.me/DeFiOfThronesOfficial)  \\-CoinGecko : [https://www.coingecko.com/en/coins/defi-of-thrones](https://www.coingecko.com/en/coins/defi-of-thrones)  \\-Uniswap contract : 0xfab5a05c933f1a2463e334e011992e897d56ef0a  \\-Uniswap info : [https://info.uniswap.org/pair/0x5488ed7f9a99684d0e9eccd3847860c734017575](https://info.uniswap.org/pair/0x5488ed7f9a99684d0e9eccd3847860c734017575)  EDIT  :  New article to explain staking : [https://defiofthrones.medium.com/defi-of-thrones-introduction-to-the-early-pool-85514b4291c0](https://defiofthrones.medium.com/defi-of-thrones-introduction-to-the-early-pool-85514b4291c0)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 447, "text": "Can somebody explain to me in a very simple and intuitive way the risk of providing liquidity on any DEX (e.g., Uniswap)?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[112, 119, "Organization"]]}
{"id": 448, "text": "I follow a defi group on telegram, where lots of devs and designers meet, there are a lot of very interesting ideas exchanged there.  Anyway, today the talk turned to a new token that is launching on ethereum, and the rebases are tied to the dynamic price from the Economist's BigMac index. There's apparently discussions with some hamburger chains that this could even be used as a form of payment for burgers.  The guy who made this token is an economist and market researcher who got interested in the idea of burgers being their own currency. This is not a \"food coin\" from the wave of such in September, but an entirely new economic experiment.  [mcbase.finance](https://mcbase.finance) is the website  [https://t.me/mcbasebsc](https://t.me/mcbasebsc)  is the telegram  [https://pancakeswap.info/token/0xcd6de21c28b352e1f7fa2966ac24edca68115159](https://pancakeswap.info/token/0xcd6de21c28b352e1f7fa2966ac24edca68115159) is the contract address  There's links there for trading and more info on the Medium is coming they say.  Tesla just got tons of free advertising out of aligning themselves with bitcoin and DeFi, so there are others now who are interested in doing the same, it's great marketing.  If this works out, this could be a social phenomena. Very interesting to see where it might go.  DYOR", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[200, 208, "Coin"], [1104, 1112, "Coin"]]}
{"id": 449, "text": "Hey, would outline Seascape. The Ultimate Game Platform Designed Around the DeFi & NFT Economy Game Across the Chains. Any game released on the Seascape Platform will have the option to create their own blockchain with its own set of rules, ultimate cross-chain NFT standard based on Substrate. Designed to optimize usage, trading and gamified DeFi features. There are more know-hows, Google them to explore", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 475, "text": "Is it just me or...?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 450, "text": "Would outline SOVI finance, taking the block chain strategy game as the carrier, the innovative IP+NFT asset + liquidity mining optimization platform.   You can play three roles in SOVI.finance: bankers, conquerors, and leaders. Bankers participate in mobile mining to build the economic base of SOVI, conquerors form their own troops to conquer the battlefield, leaders develop base technology to lead their alliance to prosperity, each role has its own way to earn SOVI.   SOVI opens the world entrance to block chain with strategic games, reshapes \"\"Dego 2.0\"\" version through GameFi, strives to create innovative IP+NFT assets, selects high-quality liquidity mining projects, and brings users a more relaxed and richer asset interaction experience. Through the unique chief recommendation mechanism to improve mobile mining incentives, in the SOVI battlefield to form their own NFT army and other players to compete", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[296, 300, "Coin"], [847, 852, "Coin"], [14, 19, "Coin"], [467, 471, "Coin"], [475, 480, "Coin"]]}
{"id": 451, "text": "Hello there, have you heard of NEM Blockchain? Excited by what guys are coming with. Their purpose is to evolve the NEM ecosystem and optimize the blockchain platforms to bring greater success to all its parts. By working closely across the ecosystem, they will help make collective ambitions real. Google them, looks exciting", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[116, 120, "Coin"], [31, 35, "Coin"]]}
{"id": 452, "text": "Geez, how long does it take to get verified. Since they finally kicked me from Binance I’ve had to go through the whole process of setting up an account here in the US.   Anyone have an idea on how long verification takes? I don’t remember from 2017", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 87, "Organization"]]}
{"id": 453, "text": "How do I set a buy stop order with a take profit and stop loss at the same time? I want to place my order and go sleep so if it is triggered the TP and SL will be in place - is this possible?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 454, "text": "Learn about it here  https://earnecoin.com/gyEX6SWH", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 455, "text": "I have an order open for last 24 hours and my US dollar shows the funds in the order. It doesn’t look like anything is wrong but I’ve never had an order take this long to fill before.  Is this normal? Or is there a delay with filling orders?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 456, "text": "Cause i can't buy anything with my cash balance which seems weird when i click buy crypto (cash balance)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 457, "text": "Because the coin has gone up so much, to require at least 3 DOT is a lot, will this be changed in the future?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 458, "text": "I just signed up for a new account on there and wanted to get into crypto exchange but I’m a little worried that I gave them my us social security number. They say they don’t store it but I’m worried that some leak will happen and my identity will be compromised.  What are your guys thoughts? Am I being paranoid?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 459, "text": "Profit now  A coin for profit  BTG (bitcoin gold) ✅  Market rank : 111  Buy and get profit", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 35, "Coin"]]}
{"id": 460, "text": "I love in the US and was wondering if anyone knows how long it takes to get a response about an inquiry?  I use the us version but their subreddit isn’t active... I accidentally transferred XLM without a memo note 😅 Kind of embarrassing and i’m just waiting to hear back. Thanks in advance!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[190, 194, "Coin"]]}
{"id": 461, "text": "Hi can somebody to help me. I sell my btt to USD but when i tried to withdraw it back to my bank account. Its say trading not supported yet and go to binance pro. But i cannot see my USD on that wallet only in binance lite. Your help is much very welcome as contacting binance is nowhere find there UK telephone number.  Thanks  Teddy", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 42, "Coin"], [150, 157, "Organization"], [269, 277, "Organization"], [210, 218, "Organization"]]}
{"id": 462, "text": "Be careful with this website: [https://f-changer.com/](https://f-changer.com/) and [https://binance-exchangers.com/f-changer-exchanger/](https://binance-exchangers.com/f-changer-exchanger/)  Scam exchanger. They will spam youtube that there is a glitch on their systems that doubles the exchange rate to your favor. They copied the binance webpage but does not check on original binance website.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[332, 340, "Organization"], [379, 387, "Organization"]]}
{"id": 463, "text": "Hi everyone,  I'm looking for a way to purchase REEF on binance, but since I'm in the US it doesn't seem like it's available on the binance.us platform just yet. Does anyone know how I can buy in on it?  Edit: I found out that a lot of people seem to be using binance.com through vpn in the US. Hope this helps anyone out there in my situation!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[132, 142, "Organization"], [48, 53, "Coin"], [56, 63, "Organization"]]}
{"id": 464, "text": "Please listing the Dutch coin, the altcoin is here very populair.  [View Poll](https://www.reddit.com/poll/lk1gu9)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 465, "text": "I know i can trade but just want to ask if i can just hold certain crypto long term. What will be the fees.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 466, "text": "I stopped checking crypto for a couple years cause it wasn't a healthy obsession. Recently been checking and realized I needed to shift to a [binance.us](https://binance.us) if I wanted any of my binance crypto. All set up, transferred first coin asset no problem, 2nd asset binance decided its fishy and suspended my account, says I need to verify myself, but doesn't allow verification for US residents. Anyone been in this pickle before?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[196, 204, "Organization"], [275, 283, "Organization"]]}
{"id": 467, "text": "I got an offer of free interest margin (isolated) trade for 7 days. After those 7 days, the hourly interest rate will start.   Now, If I buy and sell a coin before the 7 days, will i still get the interest?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 468, "text": "After problem with their system cause my Advanced Verification to be rejected, after being accepted, I went to the back of the queue.  Now I'm sitting at 14 days or no advanced verification.  Can't wait to see how long Cash Account Verification takes!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 469, "text": "I have a 7 day APY of 0.67%. How does that translate to annual interest rate ? Do I just multiply it with the number of weeks ? That results in 34,84% which seems way too high.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 470, "text": "I was happy with the way it was till the new update , not only are the saved currencies I had aren’t displaying (they were fine) but also when I try to use the new customization it’s not listing all currencies when looking  them up.  Any help is appreciated as it saves me time opening the app just to check prices for action", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 471, "text": "Doesn't this makes directly trading ETH for BETH a lot more profitable, compared to staking ETH on binance and then receiving BETH?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[44, 49, "Coin"], [92, 95, "Coin"], [99, 107, "Organization"], [126, 130, "Coin"], [36, 40, "Coin"]]}
{"id": 472, "text": "Hey all, haven’t logged in to my binance a bit and just did to a surprising number (small, but damn it’s been 6-7 months since I’ve logged in). Problem is, I can’t remember what the hell I paid for each coin. No idea what I’ve made or lost. Can any one help me figure this out? Thanks!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 41, "Organization"]]}
{"id": 473, "text": "In the Activities section in Binance Earn, is there a possibility to get notify when a new Activity is opened? I always end up arriving when they are ended.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 37, "Organization"]]}
{"id": 474, "text": "My father want to invest on crypto. He had about 1.000$ to invest for a long term (minimum 5 years). In what kind of crypto suggest to buy? No trading, no weekly or monthly speculation... Just hold for long term gain. Any suggestion will be appreciate. Thank you and good day.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 476, "text": "Im quite new to mining ive been using Nicehash and i have around 80€ there already and im willing to transfer those into my binance wallet  BUT i first wanted to try mining directly into my binance wallet THiS TIME using trex ethash only. Ive been using ethash pool and wrote my binance eth wallet as the wallet adress. Its been 24 hours but my account balance is still 0,00€.   Do you guys know how to mine into binance wallet? Could you please help me out?  I have only one 3070 with hashrate at 63,8 MH/s and its working perfectly fine with NH at 1,5% R ratio", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[124, 132, "Organization"], [190, 198, "Organization"], [287, 291, "Coin"], [279, 287, "Organization"], [413, 421, "Organization"], [221, 226, "Coin"]]}
{"id": 477, "text": "Hey everyone! I’m quite new to Binance, I’ve had my account for about a month (got verified inmediately, luckily, I’ve seen many had problems with it)   I use the mobile version. And I know this is very rookie/amateur question (never traded with crypto before)  But I don’t understand how can I get a payment on crypto through Binance (if that’s even possible at all)  Do I just provide to my client with my email or something like that?   Any orientation would be much appreciated 🙏🏼", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 38, "Organization"], [327, 335, "Organization"]]}
{"id": 478, "text": "I need help using the limit buying process, I keep getting an error message insufficient funds, not to be aggest but beginning to think I’m to old for this stuff", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 479, "text": "Anyone else with issues?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 480, "text": "Unable to trade to USDT or for REEF. Attempted to transfer to Margin wallet but the balance shows [zero] so no-go.  $5k in BTC locked up in the Fiat/Spot wallet. What to do?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 35, "Coin"], [123, 127, "Coin"]]}
{"id": 481, "text": "Has anyone else encountered this error? I spoke to my bank and they assured me my debit was unlocked and there should be no issue. I've submitted a ticket to binance a few days ago. Has anyone had this issue and was binance able to resolve it for you?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[158, 166, "Organization"], [216, 224, "Organization"]]}
{"id": 482, "text": "So Im new to crypto and I used crypto.com and binance lite. They allow me to convert crypto to fiat instantly. But now I'm trying to use Normal binance but how does that work? Do I have to convert my crypto into fiat (€) , or do I have to convert it in bitcoin first? If you know, can you explain? Thx", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 58, "Organization"], [253, 261, "Coin"], [31, 41, "Organization"], [144, 152, "Organization"]]}
{"id": 483, "text": "Hi people,  I've been using Binance for about a week or so but I'm struggling to find a certain interface in the app.  Let's say I bought a certain coin at 1.60$ and I keep it for a week, most likely the value of said coin will change, the question is: is there an interface that shows the increase in % of that coin since it has been brought?  So far I can find the transaction so I know what was the initial price and I also can track the 24h change in % but I'm missing this feature ( not sure if it's even there )  Tl;dr :  Is there an interface that shows the % change of a coin value from the initial purchase?  Thank you!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 36, "Organization"]]}
{"id": 484, "text": "USDC \"official contract\": 0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48   USDC \"Binance peg contract\": 0x8AC76a51cc950d9822D68b83fE1Ad97B32Cd580d  I'm trying to buy some tokens on pancake swap, but it does not accept my USDC \"Binance peg contract\" token. Any knows anything?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[77, 85, "Organization"], [71, 76, "Organization"]]}
{"id": 485, "text": "**I recently got a message - Binance identified yourself as a US person you can not use the site\\*. but I have already moved out from the USA and had already got my details and documents updated in** [**Binance.com**](https://Binance.com) **account to be consistent...**  **Seems very silly on Binance's part. The chat supports are horrible and asked me to just move my funds...**", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 37, "Organization"], [294, 304, "Organization"]]}
{"id": 486, "text": "I helped my friend and cousin to create Binance accounts.   My friend deposited Euro last Friday the 5th . Today is a week later and still nothing showed up on Binance account. Not even processing status, nothing. No ID.  My cousin in other hand transfered Euro on Monday the 8th and hour later after completed veriffication another deposit and it arrived 3 days later on Thursday the 11th. On Wednesday we deposited another sum while we were waiting for the two initial ones.  It didn't show yet. It didn't show any transaction ID on Binance account while we were waiting. After the first two deposits arrived ID showed up.  There should be clear information telling people that there are severe delays with deposits. This waiting and lack of information costs new customers a lot of stress. I was depositing to Binance from my Revolut account without any issues and within minutes funds were arriving and transaction ID with status were always visible while I was waiting. I don't know why it's different with the other accounts,", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[160, 168, "Organization"], [535, 543, "Organization"], [829, 837, "Organization"], [813, 821, "Organization"], [40, 48, "Organization"]]}
{"id": 487, "text": "On Select Payment Method page I choose Bank, and get the message: \"Sorry, there is no channel support the issuer country for card pay\"  It worked last weekend", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 488, "text": "Would I be able to put a friend or family member's interact e-transfer info for a payment method so that the money goes to them directly, or do they have to be your own accounts? Thanks.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 489, "text": "I had 50 usd worth of BTC that I spent days mining, I thought Binance had no fees and no minimum amount of withdrawal so I moved all my funds there only to find out it has ridiculously high fees, so I found this Trust Wallet that I thought would allow me to save my BTC for a low fee, little did I know, I converted all my BTC to BTCB (BTC BEP2) and now they're stuck in Trust Wallet.  I can't withdraw them back to Binance nor can I swap them to BNB which is required for any transaction with Trust Wallet.  Trust Wallet requires a fee of 0.000325 BNB which is practically 5 cents to withdraw to Binance, the other option is buying 50 USD worth of BNB just for the fee.  Can someone help me?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[62, 70, "Organization"], [323, 327, "Coin"], [416, 424, "Organization"], [494, 506, "Organization"], [649, 653, "Coin"], [212, 224, "Organization"], [22, 26, "Coin"], [330, 335, "Coin"], [371, 383, "Organization"], [447, 451, "Coin"], [509, 521, "Organization"], [597, 604, "Organization"], [266, 270, "Coin"]]}
{"id": 490, "text": "I transferred money via SEPA and not it shows up, but the status is on processing. How long does it take until i can work with the money?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 491, "text": "&#x200B;  [Always got the same response: We have recorded your interest to the Binance Card. We will let you know when Binance Card will be available in your region.](https://preview.redd.it/lrnipotyr9h61.png?width=2074&format=png&auto=webp&s=7f3b64cac7f14a81cd17d62de227321858abed0a)", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 91, "Organization"], [119, 131, "Organization"]]}
{"id": 492, "text": "In Brave/Chrome BUG, your charts are broken and don't actually work half the time. Error says \"chart went wrong\".., They don't fit in the screen, so they can't show % or price on right of chart either.  Safari BUG:Technical indicator button is missing when using safari, making the website unusable for trading. Can't add RSI, MAC D etc  The community needs this fixed ASAP, they were working recently. Can't trade without proper information and a working site.   WHERE IS THE MAC APP FOR [Binace.us](https://Binace.us)????? Needed badly.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 493, "text": "So I have a few XRP Criptocoin in my Binance account, I would like to exchange that to BRL so I could then transfer to my bank account, however I'm a bit lost. I just opened the Binance account and haven't found how to do that.  I went into my Spot Wallet, but it looks like I can only send the coin to another account that also handles XRP.  Basically, I'm trying to figure out how I transform my XRP into actual money, my currency. If anyone could point me how, or better yet give a link to a tutorial or write a step by step I would greatly appreciate.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 45, "Organization"], [337, 340, "Coin"], [398, 402, "Coin"], [16, 20, "Coin"], [87, 91, "Coin"]]}
{"id": 494, "text": "Why can P2P not accept money deposited via MasterCard from Skrill?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[59, 65, "Organization"], [43, 54, "Organization"]]}
{"id": 495, "text": "Hi Guys,  i just woke up and my account got hacked thesy got in my email and changed my login to binance.  I had all security validations active, google ath , sms and email i dont know how they did it.  but i cant login im shaking please can someone help me?  &#x200B;  Update:  I got back into my account and im still in que to binance  I dont want to say how but they didnt managed it propably so i got back into my account.  I just dont understand how its possible to hack my mail and reset everything over my email if i have every security possibility involved except ruby key in my binance account...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[587, 595, "Organization"]]}
{"id": 496, "text": "Hi. As the title says, I want to know if leaving an opened buy limit order for several days (even months) has to pay any fees or something like that, and also if the money you would pay once the order gets fulfilled is \"blocked\" for the operation to be able to take place. For example: let's say I have 100 USDT in my SPOT wallet and I want to trade BTC/USDT  with a buy limit at 47,000.00, aiming to spend the whole 100 USDT in this operantion; but suddenly I see an oportunity in another crypto and now I want to spend the 100 USDT in that. Do I need to cancel the BTC/USDT buy limit to be able to use my 100 USDT in the SPOT wallet??? thanks!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[350, 353, "Coin"], [567, 570, "Coin"], [623, 634, "Organization"], [318, 329, "Organization"]]}
{"id": 497, "text": "Why is this so buggy? Its the biggest exchange right?  I have had to verify my account multiple times - It takes about an hour because it never works and i have to reupload stuff ect. Then after all this it allows me to spend more than 20 pounds.  Then when i try to pay for crypto with visa it doesnt even allow me to buy any coin other than bitcoin. What the hell is going on here? Dont they trade billions?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[343, 350, "Coin"]]}
{"id": 498, "text": "I like many people am locked out of an exchange. Out of curiosity I checked r/coinbase r/binance r/bittrex etc and sorted posts by new. What I found was post after post from people desperately trying to find answers or customer support. So there no one exchange that is without problems as massive numbers of people flood the exchanges in record numbers. Except r/kraken, no posts from angry people unable to get support. Is Kraken an untapped resource right now?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[425, 432, "Organization"]]}
{"id": 499, "text": "I tried to withdraw my REPv2 and Deposit it to my REP wallet. This was a mistake and now my withdraw is \"unconfirmed\" but my funds are not available. I reached out to support and no help 😔 Please cancel my withdraw.  My withdraw has been pending forever. My Repv2 is still in my Binance US wallet but it's stuck in pending and 0 confirms. Can you please just cancel it  There is NO Txid There is NO confirmations  It's just sitting in my Binance Account. Please cancel the withdrawal so I can go back to trading", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[279, 287, "Organization"], [50, 53, "Coin"], [258, 264, "Coin"], [23, 29, "Coin"], [438, 446, "Organization"]]}
{"id": 500, "text": "Has anybody wired money into Binance US & how’d it go?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 37, "Organization"]]}
{"id": 501, "text": "I want to send crypto to binance to trade for a different crypto. Are there situations where they just randomly decided to ask for identify verification? And don't let you withdraw crypto? Are there particular coins they dislike more than others?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[25, 33, "Organization"]]}
{"id": 502, "text": "\"Hi, if you are having issues with Coinbase and are having no luck contacting them on Reddit or by Email. Please contact them on Telegram and they'll get back to you much quicker (@CoinbaseSupportTG) is the username, Thanks.\"   &#x200B;  Coinbase will only offer support on their own platform. Everything else, it's a scam.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 44, "Organization"], [86, 93, "Organization"], [238, 247, "Organization"]]}
{"id": 503, "text": "Hey there!   &#x200B;  So after the lawsuit stuff started happening, I decided to give myself a mental break and stop checking XRP so obsessively. All of my XRP is on Coinbase Pro, I am bought a considerable amount (last time I bought was in December 9th.   &#x200B;  I am aware that Coinbase has suspended XRP trading due to the lawsuit. The latest information that I have is that I can still deposit or withdraw the XRP there. My issue is: Where is my XRP? I do not see it on my account whatsoever. My portfolio on CoinBase pro says: $0.00. The last \"Order\" I have is my last purchase of XRP on December 9th.  &#x200B;  Is this a normal thing that I am not aware of because I have not been keeping up? Should I be concerned?  &#x200B;  Thanks in advance!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[517, 529, "Organization"], [590, 594, "Coin"], [127, 131, "Coin"], [157, 161, "Coin"], [167, 179, "Organization"], [284, 292, "Organization"], [307, 311, "Coin"], [418, 422, "Coin"], [454, 457, "Coin"]]}
{"id": 504, "text": "So I just sent some BTC to my coinbase wallet from coinbase.com the estimated miner fee was $5 when I sent the transaction but the miner fee that got charged was $181. Is there any way to get that fixed?   Case# 04706792", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 24, "Coin"], [51, 63, "Organization"], [30, 39, "Organization"]]}
{"id": 505, "text": "So it was my fault... I bought a new iPhone and swapped everything over, but I didn’t realise I had to manually export my ‘Authenticator’ account until after I had erased my old phone.  I couldn’t then buy or sell on my CoinBase account. I needed to verify myself and try and recover my account...  Having read all the horror stories on this group, I thought it would be a battle and probably take months to get it sorted out. Particularly as all support appears to be online only.  I am overjoyed to report that everything is now back to normal. I have been verified and can now access my account again. This was done within the 42 to 72 hour timeframe CoinBase stated.  I’ve had no issues whatsoever, since I’ve been using CoinBase and that is still the case! Am I really that lucky or unusual?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[220, 229, "Organization"], [654, 663, "Organization"], [725, 734, "Organization"]]}
{"id": 506, "text": "Case# 04691568  Hi , As the title suggests I sent money to coinbase and for some reason never added the reference,  all other transactions that same day day went through like clockwork, please help or advise.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 507, "text": "Had 11k in uma and transfered 7k to aave. After transaction i had 3,700 left in uma and 6,700 in aave. What the hell, has anyone heard of fees anything like this? At first it looked like the fee was 140....later checked my aave and saw 300 was gone so i checked my uma and saw 300 was gone from there also.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[80, 84, "Coin"], [97, 101, "Coin"], [11, 15, "Coin"], [223, 227, "Coin"], [265, 269, "Coin"]]}
{"id": 508, "text": "Hi Coinbase.   I just need to access my account to remove my currency.   Please assist me with this.  It is a really simple fix.  Please see case # 04440508 .  I plan to file a complaint tomorrow if no action is taken today.    No one has ever contacted me!!!     15 days for gods sake.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 11, "Organization"]]}
{"id": 509, "text": "Case #04557335 - Case #04489301 - Same issue can't buy, sell,convert, deposit or withdraw   Over a month I still can't buy sell or convert any of my crypto.. within a month they said my case has been resolved and closed twice.. but it has not.. I still can't buy sell or convert any of my crypto.. all I really want to do is buy more crypto and convert.. can some 1 please fix this problem please  Thank you.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 510, "text": "Can someone give me a link to get the free  Money is", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 511, "text": "&#x200B;  # My Case #03973796  [u/coinbasesupport](https://www.reddit.com/user/coinbasesupport/)  &#x200B;  [u/justin\\_coinbase](https://www.reddit.com/user/justin_coinbase/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 512, "text": "Seriously. I have had a case open and no response and no number to call. Just let me transfer my crypto.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 513, "text": "I can't access my account   I tried and failed and have been trying for over a 2 months now   Case#03466709  and  #04054532  this is radicals !!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 514, "text": "Coinbase looks so unprofessional, ive lost so much respect for them. They need to get their shit together and hire more people if they cant handle these numbers.   It has been almost 2 weeks for my account (I've heard others saying its been 6 and they're still not verified)  The worst part is I transferred crypto into the account and then requested verification afterwards so this means my money is stuck and is at the mercy of the market. Like Is there any way to prioritize my account, I would be so angry if I lose money cuz of this nonsense. I've email support but they haven't replied yet. I can't sell or transfer my crypto until my account is verified which is kinda scary. So please help me find a quick solution. Ik I'm not the only one too :/ Its a real problem. If someone reads this please upvote so hopefully support sees this.   Case# 04594807", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 515, "text": "They holding my $80 and them support on Reddit said if I want that funds I need to deposit $500 to coinbase before I can use my funds??? Wtf is this scam shit?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[99, 108, "Organization"], [40, 46, "Organization"]]}
{"id": 516, "text": "**Case# 04680016**  Hello.  Ive accidentally sent my BTC from binance to my MANA wallet in coinbase, is there any way i can retrieve my BTC.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[53, 57, "Coin"], [76, 81, "Coin"], [91, 99, "Organization"], [136, 139, "Coin"]]}
{"id": 517, "text": "I'm sitting here all day clicking pictures of boats and bicycles due to their human verification system, essentially locked out of my account because I use a VPN. That's the last straw. Moving my fortune somewhere else. Bye suckers!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 518, "text": "Last night I transferred 7.5 ETH (approx 13.4K USD) from my Coinbase Pro account to my Coinbase account and it's still pending. I tried sending a smaller amount just now 0.0000001 ETH and it went through instantly.  If anyone is able to help, please look into my case. All I'm getting are canned email responses.   ***UPDATE***  My pending transfer was finally canceled as of 2-13 (3 days) and I was able to finally move the currency to my coinbase account. Sigh of relief.   However, customer service was practically non existent. I got one email asking for details of my problem which I had already described in my initial support email.. I responded with a screenshot but it never got looked into and never received a response back.   Luckily, It looks like the transfer was resolved automatically by the system. My brother had the exact same issue as me and our pending transfers both resolved at the same time.  Coinbase get your act together and hire better support.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 72, "Organization"], [87, 96, "Organization"], [180, 184, "Coin"], [29, 33, "Coin"], [917, 925, "Organization"], [440, 448, "Organization"]]}
{"id": 519, "text": "I created and verified an account two weeks ago (received e-mails confirming verification worked) but when trying to purchase Crypto am met with a screen that I must verify my identity which I've already done.  I've reached out to support multiple times through the website and on Twitter and have received nothing outside of an automated response via e-mail. I'm trying reddit now, but my hopes are pretty low.  What is perhaps the most frustrating is receiving almost daily e-mail exclaiming, \"You're ready to buy Crypto\" when I am completely unable to do so.  If you want any sort of customer service when running into issues, I strongly suggest you STAY AWAY from Coinbase. My only blessing is that I am getting no help with depositing money as opposed to withdrawing.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[668, 676, "Organization"], [281, 289, "Organization"]]}
{"id": 520, "text": "Right now I have about 7k tied up in volatile crypto and beed coinbase support to work with me through email as fast as possible. It’s been a few says since I replied to them and still no response.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[62, 71, "Organization"]]}
{"id": 521, "text": "Okay I give up, where is it? I tried following the instructions: I clicked on ethereum in my portfolio, looked high and low for the alleged \"vault tab\", and apparently there is no such thing on the mobile version or in the app.  If there is can you give me a clue? Screenshots would be even better.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[78, 87, "Coin"]]}
{"id": 522, "text": "Hi, newbie here. So, I would like to send some BTC to another person and I'm not comfortable sharing my identity with said person. Is it possible for me to send the money to them so they won't know who sent it? I'm okay that CoinBase knows me, just don't want the recipient to see my personal / sensitive information.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[47, 51, "Coin"], [225, 234, "Organization"]]}
{"id": 523, "text": "I bought PolkaBase because it went live today, because Polkastarter 12xed in six weeks, because PolkaBridge is on its way. Polkabase is an erc-20 token.     However, I see that the polkabase token increases and decreases in number of tokens. It's a process known as rebasing. They claim some wallets will not handle a rebase token.     I see the 175 coins in my wallet. There is no dollar amount. The font is capital when is should be capitalized, followed by lower case. There is no icon.      I believe I'm good, but would like to make sure. The coins adjust at 4pm, so if incompatible, I can send somewhere.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[9, 19, "Coin"], [123, 133, "Coin"], [55, 68, "Organization"], [96, 108, "Organization"]]}
{"id": 524, "text": "I've got USD in Coinbase/Coinbase Pro, but I can't figure out how to buy USDC. I thought Coinbase always had a 1 to 1 redemption policy. Coinbase will let me buy it straight from my bank, but that means I need to wait another 10 days before I can withdraw it. I already deposited my money and waited a week. I can't trade directly for it on Coinbase Pro either, I'd have to trade for something else and then trade for it, but that's double fees. I'm in NY, do I have more restrictions than normal people or something?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[16, 24, "Organization"], [25, 37, "Organization"], [137, 146, "Organization"], [341, 353, "Organization"], [89, 98, "Organization"]]}
{"id": 525, "text": "Why does it take 2 days for funds to go from vault to wallet but from wallet to vault is almost instant. Just curious. 2 days seem very long.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 526, "text": "'m reaching out for support with vault. any help would be greatly appreciated. case # 04459603 i created this a couple days ago and am still waiting for next steps.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 527, "text": "Case# 04595787  Case #04569134 Case #04606454   I POSTED THIS 3 TIMES PREVIOUSLY AND GOT THE SAME AUTOMATED RESPONSE I ALWAYS GET, PLEASE ACTUALLY HELP ME YOU NEVER REPLY TO ANY OF MY EMAILS AND I AM GETTING HACKED OFF!!   Please see 2 previous case numbers above.   I cannot verify my identity and therefore cannot buy any crypto or properly trade. I have tried on the app about 7 times and the same through the mobile chrome browser and it just doesn't work.   My ID photo is clear it is the same address as on my account I dont know why this is happening.   Can I email you all the pictures and have it verified through support? I have been trying for days now and I really want it sorted so I can trade.   Also when trying to complete the COMP EARN TOKENS, when I click an answer on the quiz it just keeps loading 3 dots and the page never changes. Also the earn scheme only appears online and not in the Mobile app, can you please help me with both of these issues.   P.s. sometimes it tells me my ID verification was successful but when I try to buy crypto immediately after it then tells me the verification failed.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 528, "text": "I moved my funds to the coinbase vaults because I thought they were more secure but I was wrong.I am trying to withdraw funds from my vault and trying to send it to my coinbase wallet but the secondary email I set up is not being recognized. I have no trouble receiving the email but when I click the approval link it shows me the message \"You have already completed this transaction\". Meanwhile the status of my withdrawal is still in pending because according the coinbase I haven't approved my second email. I dont have acces to my coins. You guys have the same problem?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 529, "text": "I'm currently on the desktop version of Coinbase and the site works just fine except my portfolio wont load. It still says I have x amount of my crypto but does not display the amount in dollars like this >>> 1.42069=$0.00. Is this like a known problem on the desktop version I'm not aware of or is it a serious glitch?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[40, 48, "Organization"]]}
{"id": 530, "text": "Hi Cryptomen and Cryptowomen, I'm not an expert, but I know enough, I did receive some tokens to Coinbase wallet before, I did send some out of the Coinbase wallet back to connected Coinbase app, or to Binance app...etc. It worked. But today, 14th Feb 2021, I couldn't send my XPR neither back to Coinbase app nor Binance wallet... it just gives me \"Oops! No Valid Address was found for this user\"... I asked a friend who is more experienced, he made sure I copy pasted well the wallet address, the tag, to have enough XRP for transaction and Fee...etc. But it didn't work. It should be at least simple to send it back to Coinbase app right, cause I don't even need to enter the address? But I just keep getting the Oops message...even if I enter the Coinbase app address... I contacted Coinbase, hoping I'll get a reply. If someone had similar experience and found a solution, it would be much appreciated!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[97, 105, "Organization"], [148, 157, "Organization"], [182, 191, "Organization"], [202, 210, "Organization"], [314, 322, "Organization"], [519, 523, "Coin"], [622, 630, "Organization"], [751, 760, "Organization"], [787, 795, "Organization"]]}
{"id": 531, "text": "I've been trying to get in touch now with coinbase about my account restriction for about a month now.   I've sent multiple requests to reopen my account so I can either 1 fund my account or 2 exchange my currencies.   Who do they think we are? Is the average person not capable of hes or her actions?   I need this fixed ASAP and I've sent over 20 cases and the first one was last month!   Case# 04666904 - ACCOUNT RESTRICTED.  That is just one of many cases I've filed against you guys.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 532, "text": "After two weeks waiting for a reply, you reply saying to give you4-5 weeks to solve the issue with a missing withrawal. transaction case#04199033 Ive been emailing you all week now asking for an update. The stress is killing me, its becoming too much to handle. I am contacting every legal advisor and filing a report today. Its been waay past 5 weeks now and no updates at all or even a reply from you. Case #04199033.   u/coinbasesupport u/Coinbase", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[442, 450, "Organization"]]}
{"id": 533, "text": "SO I'm trying to transfer my GRT from coinbase to Pro and it keeps coming up \"The following error occurred: Insufficient funds\". I was able to transfer other coins so is there something I'm missing?  Update: So that error kept pulling up on the website, but when I did the transfer off the app it was done immediately. Guess the website is screwy today or something.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 33, "Coin"], [38, 47, "Organization"]]}
{"id": 534, "text": "I bought a bunch of ALGO a few days ago at $.92 and it's been on fire since. I planned on just keeping it since it has a 6% APY that compounds daily, but at the same time my investment has since doubled so I'm tempted to sell, thoughts?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 24, "Coin"]]}
{"id": 535, "text": "Guess this is what I have to do now. I’ve read the reviews about how bad support was/is and would always follow up with “Well I haven’t had any issues”.  Well that snake just turned around and bite me on the face.  Simply tried to transfer coins from Coinbase Pro to Coinbase. Stuck in pending and nothing happening. Submitted support case and crickets  Case# 04644860  Any suggestions on the next steps to take if I don’t hear from support?  Be warned!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[251, 263, "Organization"], [267, 275, "Organization"]]}
{"id": 536, "text": "Be careful using Coinbase. I have deposited money 8 days ago and it is still not in my wallet. Zero customer support. No feedback.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 25, "Organization"]]}
{"id": 537, "text": "I withdrew 0.02 bitcoin on coinbase pro. The withdrawal is stuck in pending for over a day now. No transaction information is given and there is no way to cancel the payment. I know it's stuck on the coinbase side because the wallet address is correct and working. Also my portfolio shows the money in my account but just not moveable. Coinbase support has not responded. How fucked am I?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[336, 345, "Organization"], [16, 24, "Coin"], [27, 39, "Organization"], [200, 208, "Organization"]]}
{"id": 538, "text": "Please please please", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 539, "text": "Help please, I have my XRP on coinbase wallet from 12 of December 2020 and now thay are not showing on my balance. Why they disappeared?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 27, "Coin"], [30, 39, "Organization"]]}
{"id": 540, "text": "Hi, my XLM transaction to Coinbase is missing due to wrong memo ID, but the address is correct. I reached out the customer services multiple times, and they closed my cases automatically after 15 business days.... I don't know who should I contact right now... Please help!!!!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[26, 35, "Organization"], [7, 11, "Coin"]]}
{"id": 541, "text": "Hi sir 1 week left but my account is under review o was verfied my account with my driving licence but i see this message your account is under review i can't buy  and sell i cant add payment help me solv my problem please this is my #case Number  Case #04677756", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 542, "text": "After having a Coinbase account since 2015 I finally want to move to an exchange that has more buying and converting options. Also the lacking customer support and response everyone is posting on here worries me.  I would love to have one exchange that has most small alt-coins and also Polkadot, Doge, XRP, Cardano... any suggestions to where I should go?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[297, 301, "Coin"], [15, 24, "Organization"], [287, 295, "Coin"], [303, 306, "Coin"], [308, 315, "Coin"]]}
{"id": 543, "text": "Last night at 2AM EST, I was attempting to withdraw some BTC to a hardware wallet. It failed a few times with 2FA errors (definitely entering the right code). I then tried initiating a Coinbase Pro -> Coinbase transaction, and got a nondescript software error (like it went through, and broke). Now my BTC is locked in a pending state with 'nothing to show' in the details.   Afterwards, I come to find the below on the Status page for Coinbase. Are my coins stuck in the ether, or will they eventually make their way to Coinbase?   Case # 04638609 u/Coinbasesupport  Also, there is no way to route through the help options for 'Website broke and crypto disappeared'.      **Feb** **11,** **2021**  [**Investigating issue with deposits and withdrawals**](https://status.pro.coinbase.com/incidents/pzg4smsc939n)   **Resolved** \\- This incident has been resolved.   Feb 11, 00:07 PST   **Update** \\- We are continuing to investigate this issue.   Feb 10, 23:36 PST   **Update** \\- We are continuing to investigate this issue.   Feb 10, 23:20 PST   **Investigating** \\- We are currently investigating this issue.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[57, 61, "Coin"], [201, 210, "Organization"], [302, 306, "Coin"], [436, 444, "Organization"], [521, 529, "Organization"], [185, 197, "Organization"]]}
{"id": 544, "text": "Any alternatives? I have 1.3 atoms but I can’t sell them, Coinbase seems like it can’t support me.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[58, 66, "Organization"], [29, 35, "Coin"]]}
{"id": 545, "text": "Anyone have a similar issue? I tried switching other to Coinbase Pro and my other tokens worked just fine but I am only able to transfer half of my GRT tokens", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[56, 68, "Organization"], [148, 152, "Coin"]]}
{"id": 546, "text": "guys, please help me I am fed up with coinbase it has been more than a week since I have submitted for verification whenever I email them like the support it says we do not support the country where your from. i just want to withdraw my funds what should I do.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 46, "Organization"]]}
{"id": 547, "text": "I've been waiting since August for them to unlock my account. Ive done their visits to get free crypto, still hasbt shown up, tried to transfer/buy/sell, still verifying,  whci is at least the 5thtime.  I got a generic, \"were working on this....whatever\" and a \"did you issue get resolved \". I tried to regions,  wouldn't allow me. I've wanted to purchase more crypto but im scared to because of this shitty lack of service", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 548, "text": "I am not a user of Coinbase, but I've seen some of their ads on Snapchat. They've opened my eyes with how scammy these kinds of apps can actually be.  In one of the ads I saw, Coinbase was preaching \"Bitcoin is at an all-time high! Buy now!\" This is fundamentally the OPPOSITE of what anybody who has a brain should do when any stock or crypto is at an all-time high. This tells me that the company itself owns a lot of Bitcoin and are using their platform to try to get newbie investors to buy BTC from them so that they can reap the profits of your loss.  I have no intention of ever installing the app, especially not after seeing that absurd ad. I strongly advise anybody new to cryptos/stocks to consider what Coinbase gets out of making ads like that. The #1 rule of trading is \"buy low, sell high\". If Coinbase is trying to teach newbies to buy high and sell low, that tells me that they are trying to prey on those who have no fucking clue what they're doing.  Rather than serving as an app to try to introduce potential newbie investors to the trading game, Coinbase seems to be trying to get morons to throw money at them at a loss so that the company can make a dirty profit.  These are very shady business tactics, and it's hard for me to comprehend the concept that they think they're marketing themselves as a introductory investing service for newbies when they make ads like that.  tl;dr — coinbase is a predatory company that preys on people who are unfamiliar with the first rule of trading. Steer clear of this app and don't allow it to suck you into its dirty business practices.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 27, "Organization"], [64, 72, "Organization"], [176, 185, "Organization"], [200, 208, "Coin"], [420, 428, "Coin"], [495, 499, "Coin"], [715, 724, "Organization"], [809, 818, "Organization"], [1067, 1076, "Organization"], [1406, 1415, "Organization"]]}
{"id": 549, "text": "So the other day I converted one of my coins to ETH. It shows that ETH in my portfolio but I noticed that it doesn’t show up as an option to convert to something else. All my other coins show up. Does Coinbase not convert ETH or is there a wait period after converting something before it can be used/converted again? This is the first time I’ve converted anything.  Also this sub is pretty disturbing, my heart goes out to everyone that is losing/locked out of their money. Fortunately I only have the free coins in Coinbase but after seeing all this shit it makes me want to take that $50 and get out. So now I have more questions; what’s the cheapest and easiest way to transfer all my coins to another platform and what platforms are best? Basically I just want something that’s good for a beginner with low fees. I like having a portfolio chart too which I noticed Coinbase pro doesn’t seem to have. Is that typical for exchanges? I’ve kept my stuff on the regular Coinbase app because of that and had planned to move it only if I wanted to buy or sell. How do people usually keep track of that info? Wallets? If so, I assume the Coinbase wallet is also sketchy so what’s another good wallet?  Sorry for all the questions, I only intended on asking the one at first. It sucks that CB is apparently so sketchy, I had been feeling pretty good about it until now. Thanks in advance!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 51, "Coin"], [67, 71, "Coin"], [201, 210, "Organization"], [222, 225, "Coin"], [517, 526, "Organization"], [870, 882, "Organization"], [970, 979, "Organization"], [1135, 1144, "Organization"]]}
{"id": 550, "text": "I submitted 2 ETH send transactions over 4 hours ago and its still stuck on pending, and it has not been submitted to the ETH network.  Case# 04705744", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 17, "Coin"], [122, 126, "Coin"]]}
{"id": 551, "text": "My coinbase account under review Plz help me", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 11, "Organization"]]}
{"id": 552, "text": "i have a mobo that has 1 PCIe x16 graphics slot and 2 other PCI slots (it looks like this: [http://www.saharamicro.com/-intel-dg41rq-socket-775-ddr2-pciexpress-gblan-sata-matx-motherboard-p-785.html](http://www.saharamicro.com/-intel-dg41rq-socket-775-ddr2-pciexpress-gblan-sata-matx-motherboard-p-785.html))   &#x200B;  can i use all 3 slots to mine or just the 1 slot?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 553, "text": "Hey everyone, mostly a Reddit lurker.  Quarantine and Reddit has me putting some of my meager salary (USA teacher) into some stocks and cryptos.  I started on rhymes with LoinFace but am finding that I don't love the app.  I would like to find a website that I could set limit buys and limit sells.  For example if Bitcoin reaches 38000 buy X dollars or if Bitcoin reaches 51000 sell x Bitcoin.  I am starting looking at some crypto generation and crypto apps today but would love if anyone had suggestions or could point me in the right direction.  Short version: I want a crytpo app that buys and sells like stocks, do you know of one?  &#x200B;  Thanks in advance.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 30, "Organization"], [54, 61, "Organization"], [315, 323, "Coin"], [357, 364, "Coin"], [386, 393, "Coin"]]}
{"id": 554, "text": "I'm not sure if this type of post is allowed, but I am fairly new to the crypto world and I am wondering what the differences are in some of the stablecoins available. So, in between Tether/usdc/dai, is there one that would be better to use as a hold for in between investments?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[190, 194, "Coin"], [195, 198, "Coin"], [183, 189, "Coin"]]}
{"id": 555, "text": "Hey guys,  With the new influx of people on the sub, I'd like to remind you all that no one knows what is going to happen. Pure speculation based upon history, logic and predictions.  We have a responsibility to the new people on this sub and making emotionally manipulated posts titled 'buy now or stay broke forever' isn't it.  Let this be a positive, informative and solid space.  Hope your bags change your lives to the better.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 556, "text": "At a first pass this project seems pretty interesting, and dirt cheap prices are really tempting me given the climate we're in at the moment.   [https://callisto.network/](https://callisto.network/)  Key points I've taken from my investigations:  -  Etherium Commonwealth project which will be self-governed, self-funded and self-sustaining.   - PoW token with 6.5bn total supply and over 2bn currently in circulation. Mining rewards currently at ~71 CLO per block (I mined around 90 CLO yesterday in under 12 hours on my 1660Ti at ~23Mh/s), with rewards dropping by 32% in the next ~100 days (and every 5,000,000 blocks thereafter).   - Smart contracts run on the network are security audited for free (auditors paid through a decentralised treasury which takes a cut of mining profits).  - Network has cold staking contracts through a number of big wallets (eg trustwallet) which allows stakers to earn passive income (11% ROI per annum apparently but I'll believe it when I see it) and vote on which network development projects are funded (treasury also funds these) without running a node or maintaining an online wallet.   It does have ties to ETC which people might see as a negative, but it seems they are purely aiming to increase adoption of ETC through improved security following all the 51% attacks, and the value of the network isn't really tied to the value of ETC as far as I can tell.   There is some interest from a large public transport provider which could see large-scale adoption of the network for fare payments (1bn + passengers per year). CLO can currently be traded on Bitfinex and a few other large DEXs against USD pretty easily as well.   All in all seems like one to watch, but if there are things I'm missing I would love to know about them.  Cheers!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[250, 259, "Coin"], [1565, 1569, "Coin"], [1596, 1605, "Organization"], [1376, 1380, "Coin"], [1252, 1256, "Coin"], [1150, 1154, "Coin"]]}
{"id": 557, "text": "I like to come here on the weekdays to learn about memes, new memes and updates on exiting memes. I’m pretty busy during the weekend so I don’t have a lot of time for Reddit.  The weekdays have become a complete shit show of original content. Current content from today or recently.  I get it, people are trying to farm moons, and the mods have their hands full, but we gotta do something.  For one I think all reposted non-memes need to be banned. Secondly I think girls should be banned. I’m sure there is more that could be done but that would be a good start.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[167, 173, "Organization"]]}
{"id": 560, "text": "Hey guys! I wanna know exactly what the title says. I’m new to crypto so I personally don’t have one yet, but Im super curious to what you guys think and to learn from you all and the reason why you like the particular crypto a lot! Happy Valentine’s Day. ♥️🚀", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 561, "text": "# Governances Polls, What are They, Why Do we need them, How can they help us make this Sub a better place?  # Introduction:   **What are Community Points?**  Community Points are a way for Redditors to own a piece of their favorite communities. As a unit of ownership, Points capture some of the value of their community. They can be spent on premium features and are used as a measure of reputation in the community.  **Get rewarded for your work**  People earn Points by contributing to the community, for example by submitting quality posts and comments. Based on these contributions, the community ultimately decides how many Points each person receives.  [https://www.reddit.com/community-points](https://www.reddit.com/community-points)  #  Governance polls  &#x200B;  https://preview.redd.it/7jrbi2l4hih61.jpg?width=940&format=pjpg&auto=webp&s=dd3ddc273acc681c3022247ae7c36c23255e6c1f  **What is A Governance Poll?**  With great power comes great responsibility  In subreddits that have Community Points, polls have two sets of results:  1. The normal count, where one member gets one vote. 2. The weighted count, where members get one vote for every Point they have.  In Cryptocurrency Our points are called \"Moons\" as most of you already know.  Every month any member in our community can propose an alternative Distribution of Moons .  **Governance Poll** is a Proposal poll that represent the Idea of the new alternative, One should make a post describing their Proposal and make a Poll so the rest of the Community members can vote on.  &#x200B;  **So Which Kind of Governance Polls can we make?**  For example here is a Governance Poll that passed and is now applied to every single one of us  * [People who claim Moons in the previous distribution round and hold them (i.e. don't transfer them) get up to a 20% bonus on their karma](https://www.np.reddit.com/r/CryptoCurrency/comments/kj2ij0/poll_bonus_karma_for_people_that_keep_moons_in/)  And here are some Polls that Didn't pass:  * [Increase karma for governance participation](https://www.reddit.com/r/CryptoCurrency/comments/l1kw7d/proposal_to_increase_karma_for_governance/?utm_medium=android_app&utm_source=share) * [Small portion of moons to charity](https://www.reddit.com/r/CryptoCurrency/comments/l1o317/1_or_05_of_moons_distributed_every_month_go_to/?utm_medium=android_app&utm_source=share) * [Proposal to decrease MOON distribution for link posts](https://www.reddit.com/r/CryptoCurrency/comments/l1rod9/proposal_to_decrease_moon_distribution_for_link/) * [Change MOONs distribution to be sublinear rather than linear](https://www.reddit.com/r/CryptoCurrency/comments/l1qds3/proposal_change_moons_distribution_to_be/) * [Karma Bonus for Special Members: Reward Users Who Invest in Community, Take II](https://www.reddit.com/r/CryptoCurrency/comments/l1unj1/karma_bonus_for_special_members_reward_users_who/) * [Significantly decrease karma earned for memes](https://www.reddit.com/r/CryptoCurrency/comments/l1yjzw/proposal_to_significantly_decrease_moon_earned/?utm_medium=android_app&utm_source=share) * [Cut distribution in half for bots](https://np.reddit.com/r/CryptoCurrency/comments/l20sem/moon_proposal_cut_moon_distribution_in_half_for/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) * [Exclude Bots in Moon distribution](https://www.reddit.com/r/CryptoCurrency/comments/l1zp60/exclude_bots_in_moon_distribution/?utm_source=share&utm_medium=web2x&context=3) * [Limit all post karma to 1000 to help distribute Moons more evenly across the sub](https://www.reddit.com/r/CryptoCurrency/comments/l25b1n/limit_all_post_karma_to_1000_to_help_distribute/?utm_medium=android_app&utm_source=share) * [Favor longer comments with higher karma reward](https://www.reddit.com/r/CryptoCurrency/comments/l2n1ea/moon_proposal_bias_comment_moon_distribution/)  **What are the terms for a poll to pass?**  * For a poll to pass, its winning option needs to have enough Moons to meet a decision threshold. This decision threshold will be set to a minimum of 10% of the Moons supply to start with. * The decision threshold will automatically update once a week. At that time, the new decision threshold will be calculated as the average of the existing threshold and the number of Moons cast in favor of the most highly-voted option in governance polls over the last 4 weeks. There will still be a 10% minimum of the existing Moons supply (it can't go lower than that).  **Why None of the Polls last month did pass?**  People worked on some proposal as you can see above but None of them passed!  None of the polls passed the Minimum Threshold of 10% existing Moons supply!  in the Next proposal cycle the Threshold should be around **5.5 Million moons, compared to 4,8 Millions last month.**  &#x200B;  **Why Should you care about it?**  Moons are nice right? It's fun to get rewarded after posting something, but it's doesn't end there.  By making new Proposals we can Shape the future of this sub in democracy way, every single one of us have a voice and we should use it!  * Are you Sick of seeing the same meme Reposts every weekend for moon farming? Use Your Voice and Vote! * Do you think we should donate some Moons every month to charity? Use Your Voice and Vote! * Do you think we should Favor longer comments with karma rewards? Use Your Voice and Vote! * Do you have more suggestions? Make A poll! Use your power!  I Believe that as a community we NEED to use our voice that been giving to us.  Next time you see a Governance poll vote!   Favor not in favor it doesn't matter to me the only thing that matter is that you will use your voice.  **We truly need to raise the awareness on these Governance polls.**  &#x200B;  I hope this post helped some of you, If yes let me know in the comments below, Have any suggestions list them down!  Thank you for your time!  # Use Your Voice, Make Proposals and Vote!  &#x200B;  https://preview.redd.it/0oafm1xnnih61.jpg?width=1140&format=pjpg&auto=webp&s=a85021c3cf6b70e17fcf48a0d2d5a7927d4c4c89  **TLDR:** Please Vote on the next Governance polls cycle, we can shape the future together!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 562, "text": "I have been using Personal Capital to track investments and overall finances for awhile. As I’ve gotten more into crypto, the lack of support for it on these apps has been annoying.  I think Mint can connect to coinbase and Personal Capital doesn’t have any support for crypto that I’m aware of. I’m not using coinbase or I’d try that on mint.   Is there a way for either of these 2 to include crypto in your portfolio? Or maybe another app?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[211, 220, "Organization"]]}
{"id": 563, "text": "Hello crypto people of cryptoverse,      I have lost 25 000 moons because i had no idea you got to claim them during 6 month period :) I consider this very fair, because i did not know about this rule. This means i had paid too little attention to this subreddit and in all fairness Moons should support active members of community. So i am all for this system!      For those who might feel sorry for me, dont be. I work as a independent crypto journalist, Crypto analyst and consultant for institutions and individuals for last 4 years. This loss is not at all tragic to me. I ll gladly take this opportunity to answer any questions you might have for a experienced crypto analyst :)      With bull market starting remember few things. Dont get to greedy, have a good portfolio, speculate only wiht a few percent of that portfolio and work hard if you want to succeed :)      Cheers to you all :)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 564, "text": "For those who have an active account with an exchange, do you keep a hot balance with them (however large or small) or do you move it to your own cold wallet, and if so, how long do you keep it hot before going cold?  I would assume the most common purpose for staying hot is to earn interest or rewards on certain coins, and I understand \"not our keys, not our coins\" but I'm curious how others divvy up their hot and cold balances in reality and hearing the rationale for their approach.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 565, "text": "I remember about 20 years ago I spent way to much on Valentine's day.   I went broke, and needed gas for work the next day.   That night I searched around the house for as much spare change as possible. Came up with $11.     If only I had crypto , I would've cashed out $100.    That's when it hit me.  I realized that so many people probably over spent a little too much on Valentine's Day, and they too ran out of money.     So they all cashed out some crypto.   That's understandable right?   I figure Out of 100,000,000 crypto investors cashing out $100-$1000 or more each.   That's $10,000,000,000 to $100,000,000,000 all at once. Enough to cause a little panic and sell off.  You have to think, people probably proposed today. The flowers, the ring, the dinner, the chocolates.  We're talking big bucks.  I myself was thinking about if I had the money I'd get a 10 ft solid chocolate heart made for my woman.  That's got to be at least $1000. Right?  With the chocolate craftsman fees.  I also have tons of bills. I don't blame them.   Thats ok, these same people plan to buy back in during their next pay period.   So give it a week or so.    Cheers.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 566, "text": "Hi, same than last week.  I'm a Venezuelan \"living\" here.  This week still we are a little bit higher than 6,000,000 USD!  Mostly miners, people sending remittances and store owners getting rid of their bolivares. Heck, maybe the goverment itself.  If you want to know something ask me anything. Here the economy is a mess, so many poor people and a lot of people surviving!  Sources:  [https://www.usefultulips.org/combined\\_VES\\_Page.html](https://www.usefultulips.org/combined_VES_Page.html)  [https://www.caracaschronicles.com/](https://www.caracaschronicles.com/)  [https://coin.dance/volume/localbitcoins/VES/BTC](https://coin.dance/volume/localbitcoins/VES/BTC)  [https://localbitcoins.com/buy-bitcoins-online/ves/](https://localbitcoins.com/buy-bitcoins-online/ves/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 567, "text": "It's not as big as some people's portfolios but with a few hundred I got more than double my money. I don't really interact here buy I've been reading silently.   I'll be using the money to help my mom pay the bills. The pandemic has been harsh on our business but crypto helped us stay afloat this month.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 568, "text": "Let’s say hypothetically that I had 5k to invest; what would the hive mind consensus be, all in on Bitcoin, Ethereum or a combination of both? And if the latter, what percentages would you be looking at?  This would be a one off lump sum investment and looking to hold the investment.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[99, 106, "Coin"], [108, 117, "Coin"]]}
{"id": 569, "text": "Need a reason to buy shitcoins without doing research? Now is the time! With the 2021 Valentine's sale in place, you'll be getting the best deal yet! (at the expense of the losers that bought earlier today) See a coin you like? ignore that whitepaper and jump straight into the crypto-verse!  /s but in all seriousness take advantage of this moment - the stars only align once in a blue moon", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 570, "text": "Or why you should lower your exposure to Bitcoin everytime Tether pumps a billion dollars into the market.  I'll keep this brief. I think most of the money flowing into bitcoin is faked by Tether. I'm scared of them and I sell a port of my bitcoin everytime they pump. Here's why:  This is the money flowing into bitcoin across all exchanges , which causes the price to rise. More than 80% of Bitcoin is bought with Tether  &#x200B;  https://preview.redd.it/xa6fi9cafmh61.png?width=700&format=png&auto=webp&s=67518f58ece56ef59ca04717bcd0d4017dcbbf1b   The same is happening with other coins too. Tether is basically crypto.     https://preview.redd.it/z7lixu8cfmh61.png?width=2240&format=png&auto=webp&s=797e76478422fb5eb70603f5d57d821cb44f43db     This is worrying. If you are exposed to crypto, you are exposed to Tether. Regulated exchanges like Coinbase, Bitstamp, dont accept Tether. All this traffic is coming from offshore, unregulated exchanges like BitZ, Binance, HITBTC etc. But while Coinbase does 4B a day in volume, Binance does 50b a day.  **As you might know**, the Tether company is under investigation for fraud. From February 2019 until July 2020, Tether had stalled giving documents to OAG, until the New York Supreme Court dismissed Tether Ltd.’s final challenge on appeal, effectively forcing Tether Ltd. to comply with the OAG’s document request. Guess what happened after July 2020?  &#x200B;  [ Tether minting. Arrows point when the investigation started and when Tether was forced to show their documents ](https://preview.redd.it/b0mofanefmh61.png?width=700&format=png&auto=webp&s=88d6a77805087bed408acb4b00c8cbd17cd926dc)  Tether started increasing their printing volume from a billion dollars a year to a billion dollars in a week. Tether has printed 2.3b in the first week of 2021 only, **more than they've printed the whole previous year**. Also it's pretty obvious bitcoin price is correlated to tether issuance:  &#x200B;  https://preview.redd.it/tu3h30thfmh61.png?width=848&format=png&auto=webp&s=93fc055716acc338764f5677226b1b27807b1fc3  But there's still the possibility that tether issuance is actually based on the market demand. Retail wants to buy Bitcoin. Tether is printing USDT only because they are receiving USD, right? Do they have 31billion dollars in their Bahamas bank account?  The only \"proof\" they show is [this wordpress pdf document](https://tether.to/wp-content/uploads/2018/06/FSS1JUN18-Account-Snapshot-Statement-final-15JUN18.pdf)which has not signature, no certificate, nothing. Also it's dated 2018. Tether has grown with 29b! since then.  Another thing. Tether Ltd.’s bank is [Deltec bank](https://www.deltecbank.com/) in the Bahamas, and the Bahamas [discloses](https://www.centralbankbahamas.com/publications/qsd/quarterly-statistical-digest-november-2020-1?N=C) how much foreign currency its domestic banks hold each month.  The [answer](https://twitter.com/ExkrementKoin/status/1338662619180371973) was \"From January 2020 to September 2020, the amount of *all foreign currencies* held by *all the domestic banks in the Bahamas* increases by only **$600 million** — going from $4.7B to $5.3B.\" While Tether supposedly should have 31b in their bank account. ALL the banks in the Bahamas dont have that much money.  Another suspicious point. Have you noticed how Tether always prints millions in perfect round numbers? Is it possible that demand for Tether is always whole perfect numbers?  &#x200B;  https://preview.redd.it/7vfhvwblfmh61.jpg?width=700&format=pjpg&auto=webp&s=658468b46e28930cf337550bc5fe8afe16733db5   Especially when you compare it to the minting of USDC, a regulated stablecoin from Coinbase.   &#x200B;  https://preview.redd.it/rzkw1prnfmh61.jpg?width=700&format=pjpg&auto=webp&s=7a1ddd744c86b9cd80df51762845dd3fbe96a22f     Blocks are smaller, and the sum varies. That randomness is what you'd expect from a real demand.  **Final words:**  Do you remember that scene in the Big Short with the stripper who’s taken out mortgages on five properties. The stripper doesn’t think there’s anything wrong with doing that, because her mortgage broker told her she could always refinance her mortgages when the prices of her houses went up. And housing prices would always go up.  This is what's happening with unregulated exchanges offering leverage up to 100x. You can't do that on Coinbase.  TLDR, I cant wait for Tether to implode, cleaning the crypto market from this cancer.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[41, 49, "Coin"], [169, 177, "Coin"], [189, 195, "Organization"], [240, 248, "Coin"], [313, 321, "Coin"], [393, 401, "Coin"], [596, 603, "Organization"], [849, 857, "Organization"], [859, 867, "Organization"], [416, 424, "Coin"], [59, 66, "Coin"], [881, 887, "Coin"], [958, 962, "Organization"], [964, 971, "Organization"], [973, 980, "Organization"], [995, 1004, "Organization"], [1029, 1037, "Organization"], [1760, 1767, "Coin"], [1081, 1095, "Organization"], [1166, 1173, "Organization"], [1314, 1324, "Organization"], [1419, 1426, "Coin"], [1650, 1657, "Organization"], [1896, 1904, "Coin"], [2187, 2194, "Coin"], [2196, 2203, "Organization"], [2614, 2627, "Organization"], [2559, 2566, "Coin"], [3411, 3418, "Coin"], [4358, 4366, "Organization"], [3163, 3169, "Coin"], [3324, 3331, "Coin"], [4391, 4398, "Coin"]]}
{"id": 571, "text": "Can I change the wallet address that my mine will deposit to? I’m using lolminer to mine ethereum and it will  auto deposit when it reaches .05eth. It’s about halfway there now. I have a wallet set up with MetaMask but I bought a ledger nano hardware wallet and want it to deposit there instead.   Will it mess with anything if I go into the config file and change the wallet address?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[89, 98, "Coin"]]}
{"id": 572, "text": "So essentially, when I had a look at moving some bitcoin out of my wallet, I saw that there was a really cheap transfer fee on something called \"Binance Chain\". How does that work? Does it correlate to BNB?  And how come Bitcoin can transfer on the Ethereum network? I saw that it was an option when withdrawing.  Bit confused, so any help is appreciated. Thanks all!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[49, 57, "Coin"], [145, 158, "Organization"], [202, 205, "Coin"], [221, 228, "Coin"], [249, 258, "Coin"]]}
{"id": 573, "text": "Hello, I'm new to crypto and I'd like to drop a couple of dollaridoos on it, but all the platforms I've seen either require a photo ID for KYC purposes or are very sketchy-looking.  Can anyone recommend a non-sketchy option that doesn't require photo ID? I'm not worried about anonymity - I assume I don't have any - I just don't want some company I never heard of to have a copy of my driver's licence.  Cheers", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 574, "text": "Since the bots kicked off the stop sell limits, do you I think big investors are worried about a crash?  This def can’t be average users bots, since it moved the entire market by billion.  My thought is that big investors have these limit orders in place because if there’s even a little bit of downward movement, they don’t want a repeat of 2017.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 586, "text": "If you look at the Bitcoin graph there was a sudden sell off like 1 hour ago probably from one whale trying to drive the price down just to buy it at a lower price or take profit. Whales control Bitcoin. Take a look at Whale Alert, there were 1 or 2 whales selling 500 BTC 1 hour ago. Also considering no other whales are selling the price dip is just retail investors panicking. Don't panic the big boys aren't done yet so the cycle isn't done.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 27, "Coin"], [195, 202, "Coin"], [269, 273, "Coin"]]}
{"id": 575, "text": "Firstly, very few people know much about crypto investing. It's typically a crap shoot and anyone who tries to show you technical analysis or research on chart movement is talking out of their ass.  Most of these people got lucky, rode the bull to the top, then told everyone they did it based on x, y, & z instead of dumb luck.  Secondly, rich people are risking an extremely small amount of their wealth (or in the case of Elon Musk, his companies wealth, not his own). Sure, it sounds amazing when someone invests hundreds of millions of dollars into crypto. **But they are gambling with a tiny relative amount**.  When the average /r/CryptoCurrency user invests into crypto, they are likely putting a lot at risk in terms of net worth percentage.  When the rich lose, they might not be able to buy their 50th car. When the poor loses, they go without food. The risk is not the same regardless of the raw amount of money lost.  **In summary**: while no one actually knows what they are talking about in terms of crypto investing, you should put more value on the opinion of the person who risks 50% of their $10k net worth vs. the billionaire who puts 0.0001% of their net worth in. The poorer person has more to lose.  Those of you in the US at the moment will know about this really well. You have the 1% (politicians) deciding the fate of millions of people who desperately need a stimulus check. They don't grasp how a few hundred dollars makes such a big difference to someone who struggles to put food on the table. **Their crypto advice is irrelevant.**", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 576, "text": "I am a newbie and recently invested 1k into Bitcoin, ethereum and various other altcoins through Coinbase. However, others are saying their fees are too high and I’m noticing they don’t have a lot of alt coins available to invest in through their app. If I was going to switch over to say binance, or crypto.com or even Coinbase pro, would it make more sense to transfer all my holdings from Coinbase to these new exchanges? Or just keep my current holdings at coin base and begin new additional holdings at new additional exchanges?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[44, 51, "Coin"], [53, 62, "Coin"], [97, 105, "Organization"], [289, 296, "Organization"], [320, 332, "Organization"], [392, 400, "Organization"]]}
{"id": 577, "text": "Hi, newbie to the cryptocurrency world here. I was just wondering if any veterans would be willing to share with new people like me how they learned, what they use, and any tips we should know getting into the world of cryptocurrency investing. Thank you!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 578, "text": "[Indexed Finance](https://indexed.finance/) and [Index Coop](https://www.indexcoop.com/) currently have crypto indexes that have the largest marketcap in the \"index coin\" category, $30M - $123M market cap range according to [CoinGecko](https://www.coingecko.com/en/categories/index-coin). I'm researching them as ways to gain more diversified exposure to the top DeFi tokens, and the Index Coop DeFi pulse index seems to be market cap weighted.  Anyone have experience purchasing these index coins e.g. via Uniswap? How has your experience been and are there any flags related to governance, team, etc. other risk factors?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 579, "text": "Take the money you saved being single and invest in your favorite crypto! I figure a good date nowadays could probably cost about $200, so I'm throwing it in to Eth with this slight dip.   Also, it doesn't have to just be a valentines thing.  Skip someone's birthday because of corona? Buy crypto!  Not getting on a flight for that old friends wedding cause of the virus? You guessed it, Crypto!  That cruise you had scheduled for nearly spring get cancelled cause 'rona? Crypto!!!", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[161, 164, "Coin"]]}
{"id": 580, "text": "I'm looking into buying altcoins for the first time, and it seems that they are kind of hard to find. The places that do let me buy altcoins (coinbase for example) only let me purchase it with Bitcoin. It's kind of hard to keep track of exactly how much I'm spending when everything I purchase costs .00000002 Bitcoin etc.  Is there any place that lets me buy altcoins with just... Money?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[193, 200, "Coin"], [310, 318, "Coin"], [142, 151, "Organization"]]}
{"id": 581, "text": "**Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and rules before participating.**   *** -      ###Disclaimer:  Though karma rules still apply, moderation is less stringent on this thread than on the rest of the sub. Therefore, consider all information posted here with several liberal heaps of salt, and always cross check any information you may read on this thread with known sources. Any trade information posted in this open thread may be highly misleading, and could be an attempt to manipulate new readers by known \"pump and dump (PnD) groups\" for their own profit. BEWARE of such practices and exercise utmost caution before acting on any trade tip mentioned here.    **Please be careful about what information you share and the actions you take.** Do not share the amounts of your portfolios (why not just share percentage?). Do not share your private keys or wallet seed. Use strong, non-SMS 2FA if possible. Beware of scammers and be smart. Do not invest more than you can afford to lose, and do not fall for pyramid schemes, promises of unrealistic returns (get-rich-quick schemes), and other common scams.      *** -      ###Rules:    - All [sub rules](https://www.reddit.com/r/CryptoCurrency/about/rules/) apply in this thread. The prior exemption for karma and age requirements is no longer in effect.    - Discussion topics must be related to cryptocurrency.   - Behave with civility and politeness. Do not use offensive, racist or homophobic language.   - Comments will be sorted by newest first.    *** -  ###Useful Links:    - [**Beginner Resources**](https://www.reddit.com/r/CryptoCurrency/wiki/beginner_resources)    - [**Intro to r/Cryptocurrency MOONs 🌔**](https://www.reddit.com/r/CryptoCurrency/comments/gj96lb/introducing_rcryptocurrency_moons/)    - [**rCryptoCurrency Discord**](https://old.reddit.com/r/CryptoCurrency/comments/kth255/join_the_crypto_currency_discord/)    - [**Prior Daily Discussions**](https://old.reddit.com/r/CryptoCurrency/search?q=title%3A\"Daily+Discussion+-+\"+&restrict_sr=on&sort=new&t=all)    - [**Monthly Skeptics Discussion thread**](https://www.reddit.com/r/CryptoCurrency/comments/l9pnns/monthly_skeptics_discussion_february_2021/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 582, "text": "Huge dip less than an hour ago, a bunch of coins down 20% or more. I personally don't really care what the cause was, because I see it as a 20% off sale on lots of coins. But just watching how this dip played out, it looks like almost every coin is now quickly rebounding. Lots of other folks also see this as a 20% off sale, I assume. Actually I just checked and most coins are already currently less than 15% down. That was fast.  Obviously crypto is one of the more volatile markets, but these rebounds have me excited for my quick investments I just put in at the dip. Anyone else excited?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 583, "text": "When I have the same interest or projected value on two different investments I tend to favor the one that is cheaper per share/coin.  My thinking, although flawed, is if it takes off I will be better off somehow.   Please no I should have bought, I shouldn't have sold, etc.  This is general market discussion, we all should have bought bitcoin many moons ago and held forever, save those stories for the campfire.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 584, "text": "There’s a lot of opinions about the best platform to buy and sell crypto. I’m trying to find the best platform and I would love to know the reasons as to why it’s the best. If anyone here has any knowledge, please send it my way! Thanks!", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 585, "text": "Hey r/CryptoCurrency, i am now a member for about one month and i am already registered on 3 exchanges, and have multiple hot and coldwallets.   Its my first month so and want to ask you guys of this is normal?   I participated in an AirDrop and „k-ching“ i got another wallet.   So how do you handle all your accounts and wallets?   Is there a serious source for AirDrops? I an scared by the many scammers you all warned about thats why i dont Trust all links on here :/   Thank you and HODL!  Edit: Autocorrect", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 587, "text": "For instance, I like the idea of Brave doing BAT. There isn't any real amount of money in it, but it's a neat passive way of clicking around for a little bit of BAT. What are some other ways? I also don't want to give away all my personal info for the coin.  I would just search the web, but I feel like this is an area where there are tons of scams abounding.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 588, "text": "So I’ve been thinking about trying day trade crypto, but it seems like the fees with Coinbase makes it nearly pointless without a swing over 5%. I don’t have enough to try and day trade stocks, so I want to try crypto.   Any platforms that allow you to day trade without fees?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[85, 94, "Organization"]]}
{"id": 589, "text": "Im seeing a lot of posts from newbies asking \"what's happening.\"   For those who are new here this is a small shakeout to try to make you sell your coins, it might go down further, it might not.  If you have been eyeing a certain coin that you want to buy, this is your opportunity.  Good luck and as you already know dont invest more than you can afford to lose.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 590, "text": "I bought about $500 of bitcoin and $25 of ethereum a couple weeks ago through the coinbase app. People suggested I go over to coinbase pro which is what I'm trying to do. I just tried to transfer all my bitcoin holdings to pro. I clicked deposit the max but my default portfolio on pro now says I'm only holding about $40.22 - Why isn't is around the $500 range?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 30, "Coin"], [42, 51, "Coin"], [82, 91, "Organization"], [126, 138, "Organization"], [203, 211, "Coin"]]}
{"id": 591, "text": "&#x200B;  # #1 Crypto Advice  There's a lot of newcomers asking for advices and investing \"tips\" to get into crypto. As with human behaviour, they go to the closest person they know in crypto for that. Now, here comes the problem...when the average joe/ new comers start looking at crypto, It means that we are in a bull run. And bull run in crypto is different from bull runs in stonks and every 0.000001 BTC HODLer becomes a financial advisor. People in stocks are happy with 10/15% gains they have in 12 months and consider it as an ATH and godsend. But, for crypto..10/15% growth can happen with a  \"Whale Alert\" or a Tweet.   &#x200B;  The same goes for bears too...now when a company/firm experiences that 15/20% or above loss when all is REKT for them. For example, take the E-cigarette company Juul..  [Altria's $13 Billion Juul Investment Is Going Up in Smoke](https://www.fool.com/investing/2019/09/30/altrias-13-billion-juul-investment-is-going-up-in.aspx)  It happened cuz the government cracked up on it for promoting teen addiction and stuff, they lost almost $13 Billion! Now in crypto, ask the 2018 HODLers like me and others what happened when Crypto crashed., \\*Insert vietnam flashbacks\\*. A few people still HODL and most people panicked and this sub was full of suicide help posts and Veterans helping out newbies to HODL and don't worry. So, conclusion: 15/20% loss is almost an \"uncommon\" event in crypto.  &#x200B;  Now, imagine what happens when that newbie friend/close one you suggested (shilled maybe) some coins sees these 15/20% loss?..They will break and history repeats. Let them decide for themselves...let them tip their toes with a small amount of DCA and experience loss. I am here with 300% gains BECAUSE I lost money on XRP and it's promises.  **Just because your portfolio is up 100% in this bull market doesn't make you a successful investor AND also you shouldn't advise anyone!**  **And firstly, who the hell is showing/revealing their portfolio to these people? Have you lost any sense?..There was a post where a guy bought BTC from his allowance money but when his mother discovered, she made him SELL as she thought BTC was a scam of wealthy people! Never ever reveal your funds to friends/relatives or anyone, there's enough surveillance from the block scanners and you shouldn't help the cause even more.**  **TL;DR : Just because you are in gains, doesn't mean you should advise someone..true HODLers and investors are shaped by losses/ bear markets not by their gains. And for god's sake, don't reveal your portfolio to anyone!**  # #2 The Meme Rant   I see many people requesting/ ranting to ban the memes and keep the sub healthy. Seriously, that's the solution? Memes are already banned on weekdays and only allowed on the weekends. What's more better? The days are categorised...weekdays can be used for discussion and stuff like these. Don't want to see memes? don't visit the sub in the weekends.   &#x200B;  I too feel the memes are becoming too mainstream too but the same people **UPVOTE** the same  repost memes that some users upload. Want to heavily reduce the incentive to reposters...See for the OC tag and maintain a \"RepostSleuthBot\". **DOWNVOTE** reposted/ memes you don't like. Enough downvotes and people will learn that this sub won't encourage reposted/low effort memes.   &#x200B;  Banning memes just kind of makes the sub look like some boring investor people sharing news articles and shilling coins and having discussion like these. When crypto goes mainstream, memes/top posts from here show up in r/all and events like that encourage more newbies to get in. What do ypou think happens when memes are banned, the next up are some ETH maxi accusing \"ETH Killer\" articles as shilling and want to ban them..it goes on and on and on...! Just **UPVOTE** what you like and **DOWNVOTE** what you don't like.  &#x200B;  # #3 Survivorship Bias  If you don't know what it means, here's a quick video with [Excellent explanation](https://www.youtube.com/watch?v=P9WFpVsRtQg) , Not a fan of videos?..Here's a [Wikipedia Article](https://en.wikipedia.org/wiki/Survivorship_bias) ,   TL;DR?.. I recommend watching the video but, survivorship bias is when you ask/ take advice from people who **SURVIVED** some event.   **Just like that, in crypto too..people tend to ask advice/ follow crypto investors who have 100/1000% gains, But the problem is that these people worked out well!** Yeah, you heard it right...these people had all the factors worked out for them..so it might be their LUCK too or SKILL, we can't tell which one!...But, what we can do is, **ASK THE PEOPLE WHO LOST MONEY!**..yep! that's right, ask those people who lost money and then try to NOT DO those mistakes! This for sure is better than asking a person who got rich!....  &#x200B;  Consider this scenario, two people want to invest in crypto in 2018! The first guy invests in ETH because he saw all the clickbait/Twitter shillings. The second guy too saw the same videos BUT about XRP(Yep that's more like me lol). The second guy thought XRP was cheaper and can get him more coins(We all have been there).   &#x200B;  Fast forward to today/2021...A new guy wants to ask these people what would they advise him..  **The ETH guy says..**  1. I'm in for Decentralised Tech 2. ETH is the new WEB 3.0 3. He's gonna have another extra 10x in ETH by December 2021 4. He says \"Institutions\" are buying ETH and so on...  All these things are true...BUT, the man got in because of Youtube clickbait/ Twitter shillings and will be on **\"TOLD YOU SO\".**   **The XRP guy says..**  1. Don't look at the price, see the market cap! 2. It's stupid to go for low price coins so that we can get more coins 3. Never go for centralised Crypto 4. Look who might own the whale wallets 5. See if the coin faces any regulatory action 6. See what exchanges list it and does the coin solve a problem?  Now all these are true too...BUT the ETH GAIN guy's statements can be seen all day 24/7 on twitter and youtube and the XRP LOSS guy's wisdom can be rarely seen!  TL;DR ? Never ask \"What to do\" advice from crypto gainers...ask \"What not to do\" advice from people who sustained losses.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[406, 410, "Coin"], [1758, 1762, "Coin"], [3705, 3709, "Coin"], [3724, 3728, "Coin"], [4912, 4916, "Coin"], [4949, 4957, "Organization"], [5017, 5020, "Coin"], [5074, 5078, "Coin"], [5255, 5259, "Coin"], [5309, 5313, "Coin"], [5372, 5376, "Coin"], [5430, 5434, "Coin"], [5507, 5515, "Organization"], [5526, 5534, "Organization"], [5586, 5590, "Coin"], [5948, 5952, "Coin"], [6030, 6034, "Coin"]]}
{"id": 592, "text": "So I've been hearing this quote in one form or the other over the past few years.  \"What do you mean sell my BTC for price X?! I will never sell my BTC! When the time comes, I will simply take out loans against my BTC.\"  I know my crypto pretty well but I'm not very finance savy in general unfortunately.  Can someone eli5 how this works? Naively reasoned you still have a loan to pay back so you'll need to liquidate the BTC anyway? But apparently this is not the whole picture.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[109, 113, "Coin"], [148, 151, "Coin"], [214, 217, "Coin"], [423, 427, "Coin"]]}
{"id": 593, "text": "So im totally new to the trading world and im just learning new stuff everyday, I see people investing in some coins and when i search them on coinbase or binance or even my wallet which is exodus i dont find them? like an example the ASKO coin, You can see it in coinbase and there is the option to buy it but you can’t send it to your wallet and in my exodus wallet ASKO coin isn’t available?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[143, 151, "Organization"], [155, 163, "Organization"], [235, 240, "Coin"], [368, 373, "Coin"]]}
{"id": 594, "text": "Insanely obvious scam to anyone here, but if any of your friends just getting into crypto say they found one on Craigslist, immediately tell them no.  Not gonna link it directly but it's maximcoin.org  If you want a laugh have a poke around.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 595, "text": "Hello, I’m currently thinking of actually investing in certain crypto currency in Coinbase and may I know which crypto I may at least start my small deposit on?  I’m more of a long term person who isn’t looking for “fast cash” or those who look for 1 day or 1 week stocks but more of a monthly or maybe annual holder.  So yeah, I’m thinking of slowly deposit $10 every month until I can afford to put $100 then slowly increase and so on, it’ll prolly take me years before I can withdraw them.  So which crypto is really recommended for me?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[82, 91, "Organization"]]}
{"id": 596, "text": "trying to understand the landscape here, what projects like irl to blockchain or tokens? Eg nfts for irl items?  im fairly certain that this has to be the future of finance (the future of the future). Is this just fomo on my part? In any case, Im thinking of putting all my money into something that seems legit. Even if its slightly sketch", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 597, "text": "I've yet to find a YouTuber that really sells me on a single coin. It's always a bunch of blabla really complicated speech with words that I barely understand and looking them up leads me into a rabbit hole for every single word. Even if I understand the words it's all just so diffuse and elusive \"they are making smart contracts but Faster!\" I mean what EXACTLY is the use case? What companies work with this coin and how is it solving their problems etc? Nobody talks about this.  Then it's just a bunch of TA.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 598, "text": "Rules would be;  - No posts about regrets / \"If I did X, then I'd have Y\" / etc  - No threads including low quality news or old news  - No threads/posts about \"Get ready for the crash, I just bought!\" or similar  - No meme threads  - No substanceless price prediction threads  There'd be a focused on news, discussion, and analysis.  I'd like to see;  - Threads discussing the pros/cons/upcoming features/etc of specific coins.  - Threads discussing price analysis and varying financial models.  - Threads discussing recent news and ramifications.  - Threads discussing investment strategies, and their pros/cons.  Still can be light hearted and fun, just not akin to a classroom full of screaming 15 year olds, competing for attention - like this subreddit currently is.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 599, "text": "Hello everyone,   Today I would like to share with you the results of another manipulation investigation that was recently completed on r/CryptoCurrency and r/CryptoMarkets. Most of the time investigations are handled behind the scenes so the culprits do not learn our methods and evade them, but in certain cases like this one I believe it is good to show people what to look out for.  Some background, more resources about digital manipulation, and a prior report can be found [here](https://old.reddit.com/r/CryptoCurrency/comments/d1qneb/crypto_reddit_manipulation_report_dream_network/).  **DISCLAIMER: Visit any of the links below at your own risk.**  Some are NSFW and others are redirects that may send you to an unknown location.  You may want to use a tool like https://wheregoes.com/ to examine redirect chains more safely, though these tools aren't bulletproof either  #The Fun Space Group  The Fun Space group arrived on our radar recently for posting redirect links mainly across r/CryptoMarkets and smaller crypto subs.  This is against Rule 1 in both subs because automod evasion obviously makes moderating harder, but it also sends the user to a destination they don't expect.  This might be done immediately or they might wait for the post to become popular and then sell it to a porn/malware distributor [as seemingly happened here](https://old.reddit.com/r/CryptoCurrency/comments/e0y94v/segwit_adoption_hits_another_ath_scaling_working/).  There is very little, if any, legitimate use for redirect domains and it is very inorganic behavior.  The typical [MO](https://en.wikipedia.org/wiki/Modus_operandi) for these bots is to periodically spam these redirect domains across 5 to 10 subreddits, always with a similar title and using a [TLD](https://en.wikipedia.org/wiki/Top-level_domain) like .fun or .space.  Note, this is not limited to crypto, I found several cases where it included gaming, science, and merchandise targeted spam as well.  You'll also see that these redirect posts are always upvoted to somewhere around 40 to 100 points, even though they are low quality and often posted in dead subs, which is clear [vote manipulation](https://www.reddit.com/r/CryptoCurrency/wiki/vote_manipulation)  A quick glance at these accounts might not look fishy because between spam campaigns they always have organic looking comments.  After digging a little deeper I noticed a few things.  These comments were in popular posts I had seen on r/all and they always had a lot of comments.  If you load all comments and ctrl+F \"title are hilarious\" [in this post](https://old.reddit.com/r/funny/comments/lg7gnv/not_very_tall_tale/), you'll see what I found.  3 different accounts placed the exact same comment in that thread.  What these bots are doing to simulate organic activity is finding popular threads on r/all and just copying an existing comment.  Usually they are among of hundreds or thousands of comments, so a human would never notice.  * https://www.reddit.com/user/rytron3000om ([archive](https://web.archive.org/web/20210212012912/https://old.reddit.com/user/rytron3000om/)) * https://www.reddit.com/user/Slavaighhj * https://www.reddit.com/user/rorimpotaFJ * https://www.reddit.com/user/realgagneWJ * https://www.reddit.com/user/Krapja9v * https://www.reddit.com/user/BaDeanAko099 * https://www.reddit.com/user/lilspicerxova * https://www.reddit.com/user/lusttforli * https://www.reddit.com/user/lbsdnvyp * https://www.reddit.com/user/wolfcubwolfc * https://www.reddit.com/user/kicheljek0 * https://www.reddit.com/user/georginasa * https://www.reddit.com/user/RumiOJ * https://www.reddit.com/user/ziarnica7p * https://www.reddit.com/user/freiherzyky * https://www.reddit.com/user/TheGetBizy * https://www.reddit.com/user/Osieczycec4 * https://www.reddit.com/user/Therockerroll  We have taken steps to prevent this kind of activity in the future and have of course banned all of these accounts, but awareness is important too.  This kind of activity multiplied on crypto reddit during the WallStreetBets saga, so keep an eye out for things like this and please continue reporting suspicious activity.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 600, "text": "I see a lot of new people, who just invested and stressing about the dip yesterday. Here is some information about emotionally investing and how to avoid it  The non-professional investor is typically putting hard-earned cash in investments for the sake of receiving a return. Still, they see their investments lose value due to market developments at times. The losses can cause stress and second-guessing. That is, many investors have a relatively low [risk tolerance](https://www.investopedia.com/terms/r/risktolerance.asp) when it comes to investing because losing money is painful.  But risk can be viewed as a guidepost for investing and investor behavior. Investors who enter into investments with a base level understanding of the risks involved can mitigate a great deal of the emotion associated with investing. In other words, challenges due to emotional investing can crop up when investors see unidentified or higher stake risks than they had originally ascertained.  # Investing emotions:  Being able to identify these emotions yourself is crucial, so here is a list of the most common emotions that can affect your investment:   1. **Unrealistic Expectations;** Replicating succes story's on your own investment   2. **Limited Patience:** Comon mistake is selling when the market dips. Be patience, in many cases if    you wait, it will go back up   3. **Peer Pressure:** DYOR, when friends, family, neigbhors talk about their gains, dont jump onboard,    but do your research   4. **Fear of Missing Out:** When a project has gained significant, the chances are people will take out    gains.   5. **Investment Regret**  all investors will experience loss from poor decisions at some point. Whether    you regret jumping on the bandwagon too late, made a poor projection, or have regrets based on    other factors, this issue has a tendency to repeat itself and lead to more regrets. Buyer’s remorse    can lead investors to cut their losses even if they end up losing money in the process.    6. **Overreaction Tendency:** Good or bad news can influence the market, but in different ways than    you expect. People reacting to it, can create the opisite effect  &#x200B;  https://preview.redd.it/mxa09t656mh61.jpg?width=660&format=pjpg&auto=webp&s=e658ed3580b73a7b40ce41acd3df4d7a7a1c2937  # Becoming a more disciplined investor  Nobody is immune to bias, however, it is possible to be mindful of the biases that affect us, and actively work to identify and prevent them from taking over our decision making. Biases can lead you to ignore opportunities, or the inverse, lead you to have a cluttered portfolio that doesn’t reflect your goals at all.  >“What is necessary to change a person is to change his awareness of himself.” — Abraham Maslow  *Here are a few steps to help you avoid emotional investing:*  &#x200B;  1. **Establish long term financial goals**   You need to take some time to think about what your long-term goals are. Have this goal in mind and with that, it doesnt matter what happens short term.  **2. Diversify your portfolio**  [Diversifying your portfolio](https://www.doughroller.net/investing/asset-allocation/the-how-to-guide-to-asset-allocation-and-picking-mutual-funds/) is a necessity for any smart investor, but when it comes to emotional investing it can play a different role. Having a portfolio that’s balanced and diversified in many areas can inadvertently prevent you from making rash decisions in a number of ways.   **3. Use news and hype for information, and not decision making**  Reacting to major news in the market is easy. This is where most of us begin making emotional investment decisions. The news causes us to react both positively and negatively, and it directly correlates to our investment decisions.   **4. Past performance doesn’t equal future performance of an asset**  Just remember that how a project has performed historically carries no true indication of how it will perform in the future. It’ is easy to make lazy assumptions and think that a company will continue its more recent trend, but that’s been proven wrong in so many cases.   **Investment strategy to avoid emotionally investing DCA (dollar cost average)**   [https://academy.binance.com/en/articles/dollar-cost-averaging-dca-explained](https://academy.binance.com/en/articles/dollar-cost-averaging-dca-explained)   The main benefit of dollar-cost averaging is that it reduces the risk of making a bet at the wrong time. Market timing is among the hardest things to do when it comes to trading or investing. Often, even if the direction of a trade idea is correct, the timing might be off – which makes the entire trade incorrect. Dollar-cost averaging helps [mitigate this risk](https://academy.binance.com/en/articles/a-beginners-guide-to-understanding-risk-management).   If you divide your investment up into smaller chunks, you’ll likely have better results than if you were investing the same amount of money in one large chunk. Making a purchase that’s poorly timed is surprisingly easy, and it can lead to less than ideal results. What’s more, you can eliminate some biases from your decision-making. Once you commit to dollar-cost averaging, the strategy will make the decisions for you.   Hope this information helps you, goodluck and enjoy the right  [Source 1](https://www.doughroller.net/investing/8-ways-avoid-emotional-investing/)  [Source 2](https://medium.com/revixinvestment/part-2-3-how-to-deal-with-your-emotions-when-investing-in-crypto-8d69bf48d500)  [Source 3](https://www.amakella.com/investing-emotions-in-the-stock-market-investor-psychology/)", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 601, "text": "Hi All. A recent [post](https://www.reddit.com/r/CryptoCurrency/comments/lk2rtw/the_ultimate_guide_to_earning_passive_income_with/) garnered a lot of attention and questions about the Nexo platform, so I thought I would repost some of my due diligence from r/sixfigurecrypto to the main r/CryptoCurrency sub to help out.   Nexo is a centralized asset management and loan platform. Nexo essentially offers two products: [high yield interest bearing](https://nexo.io/earn-crypto) accounts on digital assets and [overcollateralized loans](https://nexo.io/borrow). Their real money maker is in loans provision which[is absolutely booming](https://nexologist.com/loans)with >\\~2000% year-over-year growth in Jan-Feb loans from 2020 to 2021. They currently have over $4 billion in AUM as of 1/12/21, 1+ million users, and multiple (non-US) fiat onramps. They have a very visible CEO, Antoni Trenchev, who makes frequent appearances on Bloomberg for crypto segments. Nexo also has multiple strategic partnerships and meaningful memberships in the Swiss Fintech/Swiss Finance Tech Associations.   The fun part of this post will be discussions around the tokenomics . The NEXO token is easier to value than most cryptocurrencies as it is a dividend paying security (the major reason US access is restricted). The general model is annual dividends paid out in August with a base dividend based on a snapshot of your NEXO holdings and a loyalty dividend which is at least 30% of the overall dividend paid out as a percentage equal to the time held in your Nexo wallet from the prior ex-dividend date. The total dividend paid is defined as 30% of net profits allotted to all Nexo holders with exception of the buyback tokens (4.3MM currently). Admittedly, there has been a lack of transparency surrounding profits and cost of revenue. The visible loan data is currently only USDC/USDT loans as we do not know the total fiat loan percentage either. However, we can work backwards from the data we do have.   I’ll save you the bulk of sketchy math, but know that the dividend per token in 8/2020 was 0.0069969 on an estimated 20.42MM net profits meaning that the net profits as a percentage of total digital loans over the calendar year was \\~7%. Assuming the cost of revenue (bad assumption) and net profit as percentage of total digital loans remain unchanged, the dividend per token will increase to $0.108976 around a \\~15x increase. This is a bad assumption because the cost of revenue has surely increased likely due to advertising (see those Nexo adds everywhere?), gas fees, team growth, etc. Assuming the COR has doubled, the dividend per token will be 0.055, around an 8x increase from prior and would currently represent a 4% dividend at NEXO token value of 1.63.   The dividend is only part of the overall tokenomics, however. Other upwards price pressure includes the Nexo platinum status granting higher interest yield on assets and much lower loan APR. As you can see, from the loan data, this is a highly desirable benefit. The average dollar amount per loan is \\~8k and the median is \\~$1k signifying a huge number of small accounts taking loans. There has been >10% growth in unique Nexo accounts in the last 2 weeks alone. Nexo is attracting new users at a ridiculous rate that are depositing funds and taking loans. Some percentage of these will/have acquired Nexo tokens simply from an economical perspective. Growth = upward price pressure.  I am starting to realize the power of the moat Nexo is creating as users who take loans with them will have an overcollateralized amount of assets locked with Nexo. The Nexo platform works best when you take out loans against your Nexo (since it doesn’t pay interest), so you can either pay back your loan or buy more Nexo to either remove your other assets or to start earning interest with them. I firmly believe DeFi will grow, gain acceptance, and lower barriers to entry, but Nexo is protecting themselves very well by locking their users down with loans on the platform. The other obvious advantage Nexo has is its absurd advertising that will attract laypeople/crypto noobs at a much higher rate than DeFi platforms with no central marketing efforts.   Risks to Nexo are the competitive landscape with Celsius, SwissBorg, other central companies offering similar products and DeFi as a higher paying alternative. Other risks include regulatory concerns as the NEXO token is a security which complicates its regulation, especially with the US. Hacks, exploitations, platform risks, and lack of security compared to competitors (namely BlockFi) is also a concern. A large cryptocurrency correction incurring massive liquidations is also a risk. Yes, the loans are overcollateralized but I don’t believe Nexo could survive a 90%+ correction to ETH like we saw in 2018, especially as I suspect reckless crypto moonboys will be the ones taking at loans to leverage their position at the very top.   In short, Nexo boasts massive growth in users and loans granted, a working business model, a slick user interface, a new built-in exchange, an active community, a visible CEO (although less than Celsius’), and compelling tokenomics. I would argue Nexo offers stability against a market correction, as this will lock users into its platform who will need to pay interest on their loans at a minimum APR of 5.9%. With >$1 billion in loans taken out on Nexo over the last 45 days, you can count on a steady revenue stream.   Disclaimer, I hold a large bag of Nexo. If you're interested in other centralized, custodial project with high yield returns or as an investment, it is worth checking out YLD ([yield.app](https://yield.app)) as I expect them to gain traction in a similar trajectory to Nexo.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[184, 197, "Organization"], [323, 327, "Organization"], [381, 386, "Organization"], [929, 939, "Organization"], [1163, 1168, "Coin"], [1054, 1085, "Organization"], [1406, 1411, "Coin"], [1545, 1549, "Coin"], [2535, 2540, "Coin"], [2735, 2740, "Coin"], [3228, 3233, "Coin"], [3366, 3371, "Coin"], [3609, 3613, "Coin"], [3619, 3624, "Coin"], [4055, 4060, "Coin"], [3768, 3773, "Coin"], [3681, 3686, "Coin"], [4219, 4224, "Coin"], [4259, 4266, "Organization"], [4268, 4277, "Organization"], [4417, 4421, "Coin"], [4758, 4763, "Coin"], [4798, 4802, "Coin"], [5146, 5153, "Organization"], [4961, 4966, "Coin"], [5198, 5203, "Coin"], [5742, 5746, "Coin"]]}
