{"id": 3003, "text": "Arca to Join the Bitcoin Trust Race Competing Against Numerous Crypto Fund Rivals Another firm is joining the bitcoin trust sector, as the California fund manager Arca has filed a registration with the U.S. Securities and Exchange...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"], [17, 24, "Coin"], [163, 167, "Organization"], [202, 230, "Organization"]]}
{"id": 3004, "text": "Investment Firm Launches the First ‘Crypto Hedge Fund’ in Spain- Plans to Expand Across Europe, Latin America In Spain, an investment company has begun to promote what they called the “first crypto hedge fund.” The product has been registered in Malta...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3005, "text": "Nigerian Vice President Yemi Osinbajo Contradicts Central Bank, Says Cryptocurrencies Must Be Regulated and Not Prohibited In an apparent rebuke of the Central Bank of Nigeria (CBN), the Vice President of Nigeria Yemi Osinbajo says the country’s monetary authorities must...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[152, 181, "Organization"]]}
{"id": 3006, "text": "Chinese Authorities Warn About ‘Sophisticated’ Digital Yuan Scam- Promotes Access to a ‘$186M Secret’ Government Fund As China keeps paving the way to adopt its central bank digital currency (CBDC), scammers are also actively emerging on the scene. The police...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3007, "text": "China’s Bitcoin Mining Rig Manufacturers Pressed by Demand, Advance Orders, Devices Sold Out A regional report from China indicates that bitcoin mining rig manufacturers have seen a massive surge in demand since the price of the leading...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[137, 144, "Coin"], [8, 15, "Coin"]]}
{"id": 3008, "text": "177-Year-Old Swiss Bank Bordier to Offer Bitcoin and Other Crypto Trading Services A 177-year-old bank in Switzerland has enabled cryptocurrency trading within its services, with expectations to expand. Bordier & Cie SCmA added bitcoin and other...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[203, 221, "Organization"], [24, 31, "Organization"], [41, 48, "Coin"], [228, 235, "Coin"]]}
{"id": 3009, "text": "From Gold to Greenbacks: A Look at the US Dollar’s Devaluation, Manipulation and Militant Backing 228 years ago the U.S. dollar was created and ever since then, the national currency has been both powerful and controversial at the same...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3010, "text": "Dubai Based Crypto Investment Fund to Convert $750 Million Worth of BTC Into ADA and DOT Tokens A Dubai based crypto-based investment fund, FD7 Ventures says it will offload bitcoins worth $750 million and will use the proceeds to increase positions...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 71, "Coin"], [77, 80, "Coin"], [85, 95, "Coin"], [140, 152, "Organization"]]}
{"id": 3011, "text": "Fungram LTD Has Applied for Exempt Offering of Securities From the SEC PRESS RELEASE. On January 26, 2021, Fungram LTD, as a comprehensive blockchain enterprise serving the world, has applied for an Exempt Offering of Securities...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [67, 70, "Organization"], [107, 118, "Organization"]]}
{"id": 3012, "text": "Cyber Criminals Are Now Hiding Their Stolen Cryptos 13x Faster, Says Report A new report unveiled a growing trend of efforts from cybercriminals hiding their stolen cryptocurrencies through different transaction flows. Crystal Blockchain pointed out that...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[219, 237, "Organization"]]}
{"id": 3013, "text": "Philippine Crypto Exchange Demands Users Return Bitcoin Bought at $6,000 Following System Error Philippine crypto exchange Pdax recently suffered a costly technical failure - one that led to bitcoin trading at 300,000 Philippine pesos (around $6,000) –...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 26, "Organization"], [48, 55, "Coin"], [123, 127, "Organization"], [96, 122, "Organization"]]}
{"id": 3014, "text": "Spanish Real Estate Agency Offers an Apartment in Barcelona for Sale in Bitcoin- Taxes Must Be Paid in Fiat A Spanish real estate platform has listed its first-ever property for sale for cryptocurrency. The offer is entirely online, and whoever wants to buy...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[72, 79, "Coin"]]}
{"id": 3015, "text": "Hashbon Launches Its HASH Token and Gets Listed on Coinsbit PRESS RELEASE. Established in 2016, Hashbon aims to provide payment services for both business and individual clients. One of the key differences between Hashbon...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[214, 221, "Organization"], [0, 7, "Organization"], [21, 31, "Coin"], [51, 59, "Organization"], [96, 103, "Organization"]]}
{"id": 3016, "text": "Central Bank of Nigeria Governor Defends Decision to Exclude Crypto Players, Says the Order Is ‘in the Best Interests of Nigerians’ The governor of the Central Bank of Nigeria (CBN), Godwin Emefiele has defended the apex bank's decision to exclude cryptocurrency transactions from the banking...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[152, 181, "Organization"], [0, 23, "Organization"]]}
{"id": 3017, "text": "Berkshire Hathaway’s Charlie Munger Advises Investors to Never Buy Bitcoin or Gold Berkshire Hathaway's vice chairman and Warren Buffett's long-time business partner, Charlie Munger, has advised investors not to buy bitcoin or gold. He believes the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[83, 101, "Organization"], [0, 20, "Organization"], [67, 74, "Coin"]]}
{"id": 3018, "text": "Simplex and Skrill Broaden Cryptocurrency Convenience by Launching New Onramp Solutions As enthusiasm for cryptocurrency mounts amid strong demand from retail and institutional investors, financial service providers Simplex and Skrill are building more inroads into...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[216, 223, "Organization"], [228, 234, "Organization"], [0, 7, "Organization"], [12, 18, "Organization"]]}
{"id": 3019, "text": "Crypto Users Claim Popular Bitcoin Paper Wallet Generator Is Compromised, Millions Allegedly Stolen A number of forum posts and tweets say that the website bitcoinpaperwallet.com is compromised and people have said they have lost bitcoin using the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[230, 237, "Coin"], [27, 34, "Coin"], [156, 178, "Organization"]]}
{"id": 3020, "text": "Oxygen Protocol to List OXY Tokens on BitMax PRESS RELEASE. BitMax.io (BTMX.com), an industry-leading digital asset trading platform built by Wall Street quant trading veterans, has announced the joint primary listing of...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 80, "Organization"], [0, 15, "Organization"], [24, 34, "Coin"], [38, 44, "Organization"]]}
{"id": 3021, "text": "Cryptocurrency Adoption Passes Another Milestone Surpassing 100 Million Users According to a new study conducted by Crypto.com, the total number of global cryptocurrency users has surpassed 100 million for the first time ever....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[116, 126, "Organization"]]}
{"id": 3022, "text": "Craig Wright Plans to Take Legal Action Against BTC Developers, Hopes to Recover Over $3B in ‘Stolen Bitcoin’ Craig Wright, the individual that claims to be Satoshi Nakamoto, seems to be planning to initiate legal action against a number of open-source blockchain...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 51, "Coin"], [101, 109, "Coin"]]}
{"id": 3023, "text": "Coinbase Files for IPO via Direct Listing on Nasdaq — Valuation Soars Above $100 Billion Cryptocurrency exchange Coinbase has filed for an initial public offering with the U.S. Securities and Exchange Commission (SEC). The company has chosen the direct...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [45, 51, "Organization"], [113, 121, "Organization"], [172, 217, "Organization"]]}
{"id": 3024, "text": "Indian Central Bank Informs Government of Major Crypto Concerns — Digital Rupee ‘Receiving Our Full Attention’ India's central bank governor Shaktikanta Das has revealed that the bank has \"major concerns\" about cryptocurrencies, and it has informed the government of them....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 19, "Organization"]]}
{"id": 3025, "text": "Animoca Brands Brings “MotoGP™ Ignition” to Flow Blockchain, Announces First Collectibles NFT Sale PRESS RELEASE. 25 February 2021 - Animoca Brands, the developer and publisher of the successful blockchain games F1® DeltaTime and The Sandbox, is further...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[133, 147, "Organization"], [0, 14, "Organization"], [44, 59, "Organization"]]}
{"id": 3026, "text": "The US SEC Revokes Registration of Long Blockchain Corp’s Securities The U.S. Securities and Exchange Commission (SEC) says it has revoked the registered securities of Long Blockchain Corp (LBCC) after the company failed to...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[73, 118, "Organization"], [168, 195, "Organization"], [4, 10, "Organization"], [35, 68, "Organization"]]}
{"id": 3027, "text": "South Korean PC Gaming Rooms Rely on Crypto Mining to Profit During the Coronavirus Pandemic The coronavirus pandemic has significantly hit several entertainment routines of the people worldwide, and South Korea is not an exception. PC gaming rooms had...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3028, "text": "New Crypto Rules in Thailand Could Require Traders to Show Income Before Opening Trading Accounts Thailand seeks to introduce a new set of rules for retail crypto investors, specifically targeting those who want to open accounts. The Thai financial...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3029, "text": "Bitcoin Futures Open Interest Hits $19 Billion, Harsh Intraday Swings, Analyst Says ‘Fresh Rally’ Expected The start of the week saw digital currency markets drop significantly in value, as billions of dollars were shaved off the entire crypto economy’s...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 3030, "text": "Bitcoin Has No Intrinsic Value, Asset Is Too Volatile, Says Bank of Korea Governor Bank of Korea Governor Lee Ju-yeol has said that crypto assets like bitcoin have no intrinsic value - put simply, a measure of what...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[151, 158, "Coin"], [83, 96, "Organization"], [0, 7, "Coin"], [60, 73, "Organization"]]}
{"id": 3031, "text": "US Judge Dismisses Motion Against Bancor After Finding Allegations Inadequate to Give It Jurisdiction A Manhattan federal judge has dismissed a securities fraud class action against Bancor after ruling that the plaintiff's allegations were not enough to give...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 40, "Organization"], [182, 188, "Organization"]]}
{"id": 3032, "text": "Hathor Network, $HTR Live on KuCoin, Has Just Released Exciting News: The Detailed 2021 Roadmap PRESS RELEASE. Hathor Network ($HTR, live on KuCoin) has just released exciting news: The detailed 2021 Roadmap.Community projects are a priority and growing, especially...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 35, "Organization"], [128, 131, "Coin"], [17, 20, "Coin"], [141, 147, "Organization"], [0, 14, "Organization"], [111, 125, "Organization"]]}
{"id": 3033, "text": "Bitcoin Dump Saw Exchange Inflow Jump Over 1,000%, Whale Address Sells 2,700 Coins, F2pool Hawks 3,633 BTC On Sunday, February 21, the price of bitcoin touched a new all-time high (ATH) at $58,354 and at the time, inflow into exchanges spiked...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[144, 151, "Coin"], [0, 7, "Coin"], [103, 106, "Coin"]]}
{"id": 3034, "text": "Square Adds $170 Million More in Bitcoin to Balance Sheet — Company Now Holds 5% of Total Cash Reserves in BTC Square has bought more bitcoin, adding $170 million worth of the cryptocurrency to its balance sheet. The company now holds 5% of its cash...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[134, 141, "Coin"], [0, 6, "Organization"], [33, 40, "Coin"], [107, 110, "Coin"], [111, 117, "Organization"]]}
{"id": 3035, "text": "The Fed Is Carefully Examining Digital Dollar — Chairman Jerome Powell Says ‘Very High Priority Project for Us’ Federal Reserve Chairman Jerome Powell has provided an update on the progress of a digital dollar. He confirmed that it is a \"very high...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[112, 127, "Organization"], [4, 7, "Organization"]]}
{"id": 3036, "text": "Microstrategy Buys $1 Billion More Bitcoin — Company Now Holds Over 90,000 BTC Microstrategy has purchased an additional $1.026 billion worth of bitcoin, raising the total number of bitcoins it has accumulated to about 90,531. Its CEO...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 92, "Organization"], [145, 152, "Coin"], [182, 190, "Coin"], [0, 13, "Organization"], [35, 42, "Coin"], [75, 78, "Coin"]]}
{"id": 3037, "text": "xSigma Passes Security Audit and Prepares to Launch Stablecoin DEX With LP Rewards PRESS RELEASE. February 24, 2021 – xSigma, a decentralized exchange for stablecoin swaps, has announced details of its launch program. The DEX, which supports...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[118, 124, "Organization"], [0, 6, "Organization"]]}
{"id": 3038, "text": "India’s Warren Buffett Wants Regulators to Ban Bitcoin and Focus on Digital Rupee Indian billionaire Rakesh Jhunjhunwala, sometimes referred to as the Warren Buffett of India, says that the government should ban bitcoin. Calling the cryptocurrency \"speculation...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[47, 54, "Coin"]]}
{"id": 3039, "text": "Report: Bitcoin Mining Firm Northern Data AG Plans for a $500 Million IPO While the public prepares for the upcoming Coinbase public offering, the mining firm Northern Data AG is reportedly planning to go public as well....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[159, 175, "Organization"], [8, 15, "Coin"], [28, 44, "Organization"], [117, 125, "Organization"]]}
{"id": 3040, "text": "Bitfinex and Tether Fined $18.5M in Settlement With NY Attorney General, Both Firms Barred From Trading in the City Bitfinex and Tether have been banned from operating in New York and must pay a fine of $18.5 million as part of a settlement...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [13, 19, "Organization"], [116, 124, "Organization"], [129, 135, "Organization"]]}
{"id": 3041, "text": "Jigstack DAO Acquires Icorating.com Platform to Strengthen Its Token Launch Pad Lemonade A decentralized finance (defi) protocol announced that it officially acquired an initial coin offering (ICO) listing platform. Jigstack, who bought icorating.com, will migrate all...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[236, 250, "Organization"], [216, 224, "Organization"], [0, 8, "Organization"], [22, 35, "Organization"]]}
{"id": 3042, "text": "Topps Garbage Pail Kids Blockchain Collectibles Can Be Found at Target and Walmart The popular trading card company Topps has just launched the “2021 Garbage Pail Kids Food Fight” series today, and the trading card packs are...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [64, 70, "Organization"], [75, 82, "Organization"], [116, 121, "Organization"]]}
{"id": 3043, "text": "CoinEx Burns All 1.08 Billion Locked CET Allocated to the Team PRESS RELEASE. Hong Kong, February 23, 2021 - CoinEx, a global and professional cryptocurrency exchange service provider, announced on last Saturday that it has...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 40, "Coin"], [0, 6, "Organization"], [109, 115, "Organization"]]}
{"id": 3044, "text": "Federal Reserve Appoints Pro-Bitcoin Chief Innovation Officer A pro-bitcoin head of digital assets from TD Ameritrade has been appointed as the Federal Reserve System's chief innovation officer. This is \"a new...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 36, "Coin"], [104, 117, "Organization"], [68, 75, "Coin"], [0, 15, "Organization"], [144, 159, "Organization"]]}
{"id": 3045, "text": "Japanese Authorities Say the Majority of People Involved in Coincheck’s 2018 Hack Are Individuals With ‘High Social Status’ More details keep appearing from the police investigation into the 2018 Coincheck hack that stole $530 million from the crypto exchange. Japanese authorities revealed...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 71, "Organization"], [196, 205, "Organization"]]}
{"id": 3046, "text": "Bitcoin Price Drops 18%, Fed Discusses ‘Soft’ Inflation, Analyst Says BTC Sell-Off Attracts More Investors Digital asset markets are seeing some turbulence on Tuesday as the entire crypto market capitalization has lost 11% in value during the last 24...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [25, 28, "Organization"], [70, 73, "Coin"]]}
{"id": 3047, "text": "Moneygram Halts Using Ripple Due to SEC Lawsuit Over XRP Cryptocurrency Moneygram has announced that it has suspended using Ripple's platform due to the lawsuit against Ripple Labs and its executives by the U.S. Securities...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[72, 81, "Organization"], [124, 130, "Organization"], [53, 56, "Coin"], [169, 180, "Organization"], [0, 9, "Organization"], [22, 28, "Organization"], [36, 39, "Organization"]]}
{"id": 3048, "text": "Flow NFTs Are Coming to OpenSea PRESS RELEASE. February 23, 2021 - OpenSea, the largest marketplace for blockchain-enabled non-fungible tokens (NFTs), is in the process of building support for Flow,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"], [24, 31, "Organization"], [193, 197, "Organization"], [67, 74, "Organization"]]}
{"id": 3049, "text": "Janet Yellen Warns Bitcoin Is ‘Extremely Inefficient’ and ‘Highly Speculative’ as BTC Price Plunges U.S. Treasury Secretary Janet Yellen has warned about the dangers of bitcoin as the price of the cryptocurrency took a nosedive. She sees bitcoin...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[82, 85, "Coin"], [238, 245, "Coin"], [100, 113, "Organization"], [19, 26, "Coin"]]}
{"id": 3050, "text": "Thailand Authorities Are Targeting Japanese Crypto Holders to Boost Tourism Thailand seems to be interested in catching Japanese crypto holders’ attention via tourism. The country wants to establish a crypto-friendly touristic hotspot and the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3051, "text": "Speechwriter for Former US President George Bush Says BTC Rally Driven by ‘Historically Low Interest Rates’ A speechwriter for former U.S. President George W. Bush and a bitcoin critic, David Frum has claimed that the low-interest rates are fueling the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[54, 57, "Coin"], [170, 177, "Coin"]]}
{"id": 3052, "text": "PTERIA to Mars Celebrates a New All Time High While Bitcoin and the greatest part of altcoins are going down, Pteria DAO's token PTERIA could not be outdone and is currently on Mars,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[52, 59, "Coin"], [129, 135, "Coin"], [0, 6, "Coin"], [110, 121, "Organization"]]}
{"id": 3053, "text": "Cape Cod’s Largest Hospital Gets Bitcoin Donations Worth $800K One of Cape Cod’s largest hospitals received two bitcoin donations this year totaling $800,000 in value. The Massachusetts-based not-for-profit medical centre (NPO), Cape Cod...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 40, "Coin"], [112, 120, "Coin"]]}
{"id": 3054, "text": "Binance Suspends Ethereum and ERC-20 Token Withdrawals Before Quickly Reversing Course The rollercoaster-ride in cryptocurrency prices on Monday was accompanied by Binance’s fresh restrictions for ethereum and ERC-20 tokens.Ethereum Network Congestion Fingered as the Culprit...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [17, 25, "Coin"], [30, 42, "Coin"], [197, 205, "Coin"], [224, 232, "Coin"], [164, 172, "Organization"], [210, 223, "Coin"]]}
{"id": 3055, "text": "South Korean Financial Regulator Confirms Privacy Coin Delistings- Adds New Guidelines to Report Unusual Transactions South Korean financial watchdogs are about to start overseeing crypto-related activities in the nation, and additional barriers for exchanges keep appearing. Moreover, one of...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3056, "text": "Researcher Finds an Old Twitter Profile May Have Been Satoshi Nakamoto’s Account On February 22, 2021, an author published a post on substack.com about an anonymous Twitter account that may have belonged to the mysterious Satoshi...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3057, "text": "‘Bitcoin Is the Biggest Jailbreak in Human History,’ Says Philosopher Stefan Molyneux On February 19, the Canadian podcaster and Freedomain Radio host, Stefan Molyneux, discussed his thoughts about bitcoin following the crypto asset’s tumultuous rise capturing...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[1, 8, "Coin"], [198, 205, "Coin"]]}
{"id": 3058, "text": "Bitcoin Slides Over 13%, Veteran Trader Peter Brandt Suggests BTC Will Peak at $200k but Hints of Possible Deep Corrections Veteran trader Peter Brandt has implied in a tweet that bitcoin will go through deep price corrections before it gets to the $200,000 mark....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [62, 65, "Coin"], [180, 187, "Coin"]]}
{"id": 3059, "text": "Binance Blamed for Purposely Choking Ethereum’s Network The recent ramp higher in cryptocurrency prices has assuredly attracted its fair share of cheerleaders and detractors alike, but the reality of this climb...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [37, 46, "Organization"]]}
{"id": 3060, "text": "Nvidia Limits the Efficiency of Mining Ether Using Its GPUs by 50% Nvidia announced that it will start limiting the efficiency of mining ethereum or any other crypto using its new range of upcoming graphics processing...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [39, 44, "Coin"], [67, 73, "Organization"], [137, 145, "Coin"]]}
{"id": 3061, "text": "Russian Bill to Recognize Cryptocurrencies as Property Advances in Parliament Russia's parliament has advanced the bill that proposes to recognize cryptocurrencies as property. The proposed law will provide legal protection for cryptocurrencies but income...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3062, "text": "CyberFi – An Intelligent Trading and Automation Platform for DeFi While the decentralized finance (DeFi) space is not new, it has experienced massive growth to surpass $37 billion. Consequently, the sector attracted a lot...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 3063, "text": "Bitcoin Hashrate Hits 180 Exahash, Mining Difficulty Climbs Higher, Pools Jump by 35% The price of bitcoin has climbed to phenomenal heights during the last few weeks and this has fueled the crypto asset’s mining sector a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[99, 106, "Coin"], [0, 7, "Coin"]]}
{"id": 3064, "text": "Skybridge Capital Founder Predicts $100K Bitcoin Price This Year Due to ‘Heavy Demand’ and Diminishing Supply The founder of asset management firm Skybridge Capital, Anthony Scaramucci, has predicted that the price of bitcoin will reach $100,000 before the year-end simply...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 17, "Organization"], [41, 48, "Coin"], [147, 164, "Organization"], [218, 225, "Coin"]]}
{"id": 3065, "text": "‘Big Short’ Investor Michael Burry Warns Governments Could ‘Squash’ Bitcoin Hedge fund manager Michael Burry, famed for forecasting the 2008 financial crisis, has warned that governments could \"squash\" bitcoin in an inflationary crisis. Expecting...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 75, "Coin"], [202, 209, "Coin"]]}
{"id": 3066, "text": "Federal Reserve Bank President James Bullard Confident Bitcoin Not a Threat to US Dollar The president of the Federal Reserve Bank of St. Louis, James Bullard, has shared his view on the future of bitcoin. He is confident...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[55, 62, "Coin"], [0, 15, "Organization"], [197, 204, "Coin"], [110, 125, "Organization"]]}
{"id": 3067, "text": "Gold Bull Jeffrey Gundlach Says ‘BTC Maybe the Stimulus Asset’ Ahead of the Precious Metal Renowned gold bull and CEO of investment management firm Doubleline, Jeffrey Gundlach says bitcoin may be the \"stimulus asset\" while adding it \"doesn’t look...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[148, 158, "Organization"], [182, 189, "Coin"], [33, 36, "Coin"]]}
{"id": 3068, "text": "Pricing Gold, Food, and Altcoins With the BTC Denominator: How to Measure an Asset’s Worth in Bitcoin On February 21, bitcoin touched a lifetime price high at $57,844 per unit after the crypto asset’s market valuation crossed the $1 trillion zone...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[42, 45, "Coin"], [94, 101, "Coin"], [118, 125, "Coin"]]}
{"id": 3069, "text": "Chinese Tea Retailer Joins the Crypto Mining Industry After Hiring Two Roles to Lead Its ‘Bitcoin Business Plan’ A Chinese tea retailer is looking to make its inception into the bitcoin mining business. Publicly-listed Urban Tea announced the expansion of its operations...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[90, 97, "Coin"], [219, 228, "Organization"], [178, 185, "Coin"]]}
{"id": 3070, "text": "Elon Musk Says Holding Bitcoin Is Less Dumb Than Cash, Disputes Peter Schiff’s Claims About Money and BTC Tesla and Spacex CEO Elon Musk has clarified his position on bitcoin. Emphasizing that he is an engineer, not an investor, Musk says that...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 30, "Coin"], [102, 105, "Coin"], [116, 122, "Organization"], [106, 111, "Organization"]]}
{"id": 3071, "text": "Day Trader Dave Portnoy Disturbed by Bitcoin Price — Vows to Never Buy BTC Again Day trader Dave Portnoy has admitted that he is an idiot when it comes to bitcoin after the price of the cryptocurrency continually hit...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 44, "Coin"], [71, 74, "Coin"]]}
{"id": 3072, "text": "Bill Gates Neutral on Bitcoin but Says Cryptocurrency Is an Innovation the World Can Do Without Microsoft founder Bill Gates is no longer a bitcoin bear. He has now taken a neutral stance on bitcoin as an investment. However, as...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[191, 198, "Coin"], [22, 29, "Coin"], [140, 147, "Coin"]]}
{"id": 3073, "text": "Crypto Earning vs. Savings Accounts: How You Can Get Up to 17% Annually Holding Digital Assets The mainstream has caught a whiff of the gains cryptocurrencies like bitcoin and ethereum have seen, but many people are not aware of the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[164, 171, "Coin"], [176, 184, "Coin"]]}
{"id": 3074, "text": "Russian Crypto Mining Companies Are Expanding Capacity as the Country Becomes a ‘Preferred Hotspot’ Crypto mining operations have been witnessing some changes within the industry in terms of locations. A recent interview with the CEO of the mining...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3075, "text": "Troubled NZ Crypto Exchange Cryptopia Suffers Another Hack in the Midst of Liquidation Process Controversy still surrounds a liquidated New Zealand cryptocurrency exchange, which allegedly got hacked again. Adding to the $30 million stolen in 2019, Cryptopia reports...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 37, "Organization"], [249, 258, "Organization"]]}
{"id": 3076, "text": "Malaysian Police Bust Gang That Stole $2.15 Million Worth of Electricity to Mine Bitcoin Police in Malaysia's Jahor state have busted a seven-men gang that stole 8.6 million Malaysian ringgits ($2.15 million) worth of electricity to mine bitcoin...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[81, 88, "Coin"], [238, 245, "Coin"]]}
{"id": 3077, "text": "Study: Top-Tier Cryptocurrency Exchanges Increased Their Market Share by 13% Since October 2020 A recent study unveiled that top-tier cryptocurrency exchanges increased their market share since October 2020, in the context of lower-risk exchanges. The bitcoin bull...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[252, 260, "Coin"]]}
{"id": 3078, "text": "IMF Representative of Nigeria Calls for Caution Over the Use of Cryptocurrencies The International Monetary Fund (IMF) resident representative for Nigeria, Ari Aisen recently discussed the Central Bank of Nigeria (CBN) directive that targets crypto entities....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[189, 218, "Organization"], [0, 3, "Organization"], [85, 118, "Organization"]]}
{"id": 3079, "text": "NEXT.Chain, the Next DeFi Powerhouse to Host Its Liquidity Sale Event From the 24th of February PRESS RELEASE. While Ethereum has given way to a brave new world of decentralized financial applications that are completely permissionless, accessible and groundbreaking in...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [117, 125, "Organization"]]}
{"id": 3080, "text": "Paid in Bitcoin: NFL Offensive Tackle Russell Okung Considered the Highest Paid in the League At the end of December, the Carolina Panthers offensive lineman, Russell Okung told the public he would be getting half of his 13 million-dollar...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[8, 15, "Coin"]]}
{"id": 3081, "text": "Janet Yellen Stresses Importance of Crypto Regulation, Making Sure Bitcoin Is Not Used in Illicit Transactions U.S. Treasury Secretary Janet Yellen has reaffirmed that it is important to ensure that bitcoin and other cryptocurrencies are not used for illicit financing....", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[111, 124, "Organization"], [67, 74, "Coin"], [199, 206, "Coin"]]}
{"id": 3082, "text": "World’s Largest Asset Manager Blackrock Enters Bitcoin Space — Discusses What’s Driving Up BTC Price The world's largest asset manager with almost $9 trillion in assets under management, Blackrock, has started investing in bitcoin. Sharing his view on what's...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[30, 39, "Organization"], [47, 54, "Coin"], [187, 196, "Organization"], [91, 94, "Coin"], [222, 230, "Coin"]]}
{"id": 3083, "text": "Bitcoin’s Watershed Moment- Crypto Asset Now Commands a $1 Trillion Market Capitalization Bitcoin’s market capitalization has crossed the $1 trillion zone after the price per coin surpassed $53,650 per unit. The valuation comes 145 months after...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[90, 99, "Coin"], [0, 9, "Coin"]]}
{"id": 3084, "text": "North American Bitcoin ETF’s First Trading Day Captures $165M in Volume The North American Purpose Bitcoin ETF launch on Thursday saw massive demand, as more than $165 million in trade volume was recorded. In fact,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[99, 111, "Coin"], [15, 28, "Coin"]]}
{"id": 3085, "text": "How PIVX Is Bootstrapping the Revival of Privacy Coins Throughout its history, PIVX has marked many firsts on the crypto market. These include being the first PoS project to use zk-SNARKs, masternodes, blockchain...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 83, "Organization"], [4, 8, "Organization"]]}
{"id": 3086, "text": "Binance Coin Topples USDT to Become the Number Three Crypto After a 300% Price Surge The Binance token has toppled the stablecoin Tether to become the third-largest crypto asset by market capitalization. After starting the month of February a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[89, 102, "Coin"], [130, 136, "Coin"], [0, 12, "Coin"], [21, 25, "Coin"]]}
{"id": 3087, "text": "TimeCoin’s Special Token Sale PRESS RELEASE. The Special Token Sale of TimeCoin (TMCN) will be launched on February 15th with a 93% discount on the token's current market...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [81, 85, "Coin"]]}
{"id": 3088, "text": "Tezos Announces Major Upgrade to Improve Network Functionality Open-source platform Tezos has just announced Edo, its fifth and most ambitious upgrade to its blockchain to date. This upgrade will add the Sapling...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [84, 90, "Organization"]]}
{"id": 3089, "text": "US Authorities Take Action to Shut Down Crypto Trading Platform Allegedly Defrauding Thousands of Investors The New York attorney general and the U.S. Securities and Exchange Commission (SEC) have filed charges against a cryptocurrency trading platform that allegedly defrauded...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[146, 191, "Organization"]]}
{"id": 3090, "text": "US Government Expands Charges Against North Korean Hackers- Authorities Describe Them as The ‘World’s Leading Bank Robbers’ The U.S. Department of Justice (DOJ) unsealed new charges against the North Korean state-sponsored Lazarus Group. The hackers are allegedly responsible for stealing over...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[133, 161, "Organization"], [0, 13, "Organization"], [223, 236, "Organization"]]}
{"id": 3091, "text": "‘More Valuable Than Gold’- The Motley Fool Announces $5 Million Investment Into Bitcoin The fifth-largest investment website globally with over 80 million monthly visitors, The Motley Fool’s positive outlook for the future of bitcoin is another data...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 43, "Organization"], [80, 87, "Coin"], [226, 233, "Coin"], [177, 188, "Organization"]]}
{"id": 3092, "text": "BTC Transaction Stuck? Bitcoin Cash-Powered Accelerators Can Speed Up Transfers At the time of publication, there’s more than 69,000 transactions waiting in line to get confirmed by a bitcoin miner. Since bitcoin’s price rise,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 30, "Coin"], [205, 212, "Coin"], [0, 3, "Coin"], [184, 191, "Coin"]]}
{"id": 3093, "text": "Venture Capital Fund Yolo Invests in Digital Marketing Specialists eCartic PRESS RELEASE. Tallinn-based venture capital fund Yolo Investments has announced a new investment in digital marketing company eCartic.18th February 2021, Tallinn, Estonia - Venture...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 25, "Organization"], [125, 141, "Organization"], [67, 74, "Organization"], [202, 209, "Organization"]]}
{"id": 3094, "text": "Nigeria Crypto Ban: Bitcoin Sells for $76K as Deposits on Centralized Exchanges Plummet According to a website that tracks the price of bitcoin across the globe, the crypto asset’s selling price in Nigeria as of February 18...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 27, "Coin"], [136, 143, "Coin"]]}
{"id": 3095, "text": "As Millions Drown in Today’s Poverty Trap, Macro Strategist Raoul Pal Says ‘Bitcoin Is a Life Raft’ Global Macro Investor CEO, Raoul Pal, discussed the current economy this week and asked his 394,000 followers if people are using the wrong denominator...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[100, 121, "Organization"], [76, 83, "Coin"]]}
{"id": 3096, "text": "Canada Has Approved Two Bitcoin ETFs — First One Starts Trading Today Two bitcoin exchange-traded funds (ETFs) have been approved in Canada. Evolve Bitcoin ETF has become the second bitcoin ETF to get approval by Canada's...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 31, "Coin"], [148, 155, "Coin"], [74, 81, "Coin"]]}
{"id": 3097, "text": "Blockchain-Backed NFT Market Value Grew 299% in 2020 A report has unveiled figures that confirm the bullish run of non-fungible token markets over the last year. Two analytical firms behind the studies...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3098, "text": "Pionex Is a Crypto Exchange With Built-in Automated Trading Tools You Can Trust The international Pionex cryptocurrency exchange has been one of the fastest growing trading platforms in Asia in 2020 and it is now set to...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [98, 104, "Organization"]]}
{"id": 3099, "text": "Token-Driven Karaoke Platform Gets a Boost in South Korea as Pandemic Hits Over 2,100 Singing Rooms Coronavirus-driven lockdowns and social distancing limits affect people’s way of entertaining themselves, such as going to karaoke. In South Korea, that activity is too...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3100, "text": "Elon Musk’s Tesla Faces Scrutiny Over Potential Conflict of Interest in $1.5 Billion Bitcoin Purchase Tesla is facing more scrutiny over its $1.5 billion dollar bitcoin purchase. A Tesla board member who reportedly approved the company's bitcoin buy deal...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[12, 17, "Organization"], [85, 92, "Coin"], [102, 107, "Organization"], [161, 168, "Coin"], [181, 186, "Organization"], [238, 245, "Coin"]]}
{"id": 3101, "text": "German Cannabis Firm Hedges Bitcoin to Protect from Massive Currency Devaluation On Tuesday, the cannabis firm Synbiotic SE, a publicly-traded company in Germany that’s listed on the Frankfurt Stock Exchange and Xetra, has announced it...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 35, "Coin"], [111, 123, "Organization"], [183, 207, "Organization"], [212, 217, "Organization"]]}
{"id": 3102, "text": "Publicly-Listed Chinese Lottery Firm Acquires Bitcoin Mining Pool Btc.com A U.S. publicly-listed Chinese sports lottery firm is extending its arms into the crypto industry by announcing another related maneuver. 500.com Ltd announced it...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 53, "Coin"], [212, 223, "Organization"], [66, 73, "Organization"]]}
{"id": 3103, "text": "xSigma Prepares to Launch Its Stablecoin DEX With Major Backers PRESS RELEASE. xSigma is a decentralized exchange and liquidity mining platform that supports stablecoin swaps. It enables dollar-pegged assets to be traded onchain with...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 85, "Organization"], [0, 6, "Organization"]]}
{"id": 3104, "text": "Survey Finds Many Finance Managers Are Not Planning to Hold BTC— Volatility Cited as Key Concern A new poll of finance managers by Gartner Finance finds that a majority are not planning to hold bitcoin as a corporate asset. In...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 63, "Coin"], [131, 138, "Organization"], [194, 201, "Coin"]]}
{"id": 3105, "text": "Blockchain.com Raises $120 Million in a Strategic Financing Round, Firm’s Institutional Arm Swells On Wednesday, as the leading crypto asset bitcoin has been riding above the $50k handle, the well known firm Blockchain.com announced the company has...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"], [141, 148, "Coin"], [208, 222, "Organization"]]}
{"id": 3106, "text": "Privacy Coin Verge Suffers Third 51% Attack, Analysis Shows 200 Days of XVG Transactions Erased According to various reports, the cryptocurrency network Verge has suffered a 51% attack that led to a massive 560,000+ block reorganization. Analysts believe the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 18, "Organization"], [153, 158, "Organization"], [72, 75, "Coin"]]}
{"id": 3107, "text": "MahaDAO to List MAHA and ARTH With BitMax.io PRESS RELEASE. BitMax.io (BTMX.com), an industry-leading digital asset trading platform built by Wall Street quant trading veterans, has announced the listing of MahaDao under...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [60, 80, "Organization"], [16, 20, "Coin"], [24, 29, "Coin"], [35, 44, "Organization"], [207, 214, "Organization"]]}
{"id": 3108, "text": "Peter Schiff Admits Bitcoin Could Reach $100K After BTC Price Soars Past His Expectations Gold bug Peter Schiff has revised his bitcoin prediction after the price of the cryptocurrency exceeded his expectations, reaching an all-time high above the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 27, "Coin"], [52, 55, "Coin"], [128, 135, "Coin"]]}
{"id": 3109, "text": "Dubai Government Licensing Entity Now Accepts Bitcoin for Payments A government-owned entity in Dubai has started accepting bitcoin, ether and tether as payment for its services, according to local media reports.Kiklabb is a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[124, 131, "Coin"], [133, 138, "Coin"], [143, 149, "Coin"]]}
{"id": 3110, "text": "Blockchain Firm Asks Nevada State for Permission to Build a Crypto ‘Smart City’ in Storey County A crypto \"smart city\" could become a reality in Nevada’s desert, as a blockchain firm applied to make it possible. The investment company asked...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3111, "text": "The Man Behind Wallex and EURST Simone Mazzuca is innovative in his style of management. Being the founder of Wallex and creator of the EURST, he is agile and motivated...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[15, 21, "Organization"], [26, 31, "Coin"], [110, 116, "Organization"], [136, 141, "Coin"]]}
{"id": 3112, "text": "Spanish Treasury Secretary Says Cryptocurrencies Carry a ‘Risk of Default’, Repeats Bank of Spain’s Lack of Regulation Rhetoric The government of Spain continues to harden its stance against widely adopting cryptocurrencies. The Spanish Secretary of State for the Economy recently expressed her...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[84, 97, "Organization"], [0, 16, "Organization"], [132, 151, "Organization"]]}
{"id": 3113, "text": "Polkadot Lays Out Its Plans for Parachain Rollout as the Token’s Price Climbs The price of Polkadot’s native token hit an all-time high (ATH) this week, soaring above $30, as the company laid out the next steps...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [91, 100, "Coin"]]}
{"id": 3114, "text": "Mexican Companies Are Willing to Join the Bitcoin Bandwagon in the Wake of Tesla’s Investment, Says Expert Bitcoin-buying frenzy among major companies could hit Mexican firms soon, as interest keeps increasing across the country. An expert is expecting that local businesses...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[41, 50, "Coin"], [75, 80, "Organization"], [107, 114, "Coin"]]}
{"id": 3115, "text": "NYDIG Registers for a Bitcoin ETF, Morgan Stanley Named a Participant in SEC Filing Just recently, during Microstrategy’s “Bitcoin for Corporations” event, Stone Ridge Asset Management and New York Digital Investment Group (NYDIG) founder, Ross Stevens, explained that...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[189, 230, "Organization"], [35, 49, "Organization"], [156, 184, "Organization"], [0, 5, "Organization"], [22, 29, "Coin"], [106, 119, "Organization"], [73, 76, "Organization"], [123, 130, "Coin"]]}
{"id": 3116, "text": "Cream Iron Bank $36M Flash Loan Attack: Markets Re-Enabled While Asset Borrow Is Paused Following the Cream Iron Bank flash loan attack, preliminary findings of a probe have shown that contracts and markets still function normally. As a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 15, "Organization"], [102, 117, "Organization"]]}
{"id": 3117, "text": "Litecoin Attempts to Redeem Charlie Lee’s ‘Original Sin’ as LTC Markets Gain Momentum Gradual warming to cryptocurrencies by financial companies combined with both retail investments and institutional interest has carved the way for litecoin’s renewed momentum in...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [60, 63, "Coin"]]}
{"id": 3118, "text": "Microstrategy to Sell $600 Million Worth of Convertible Notes to Buy More Bitcoin The publicly listed company Microstrategy announced that it has plans to purchase more bitcoin after acquiring 71,079 bitcoin during the last six months. On...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"], [74, 81, "Coin"], [110, 123, "Organization"], [200, 207, "Coin"]]}
{"id": 3119, "text": "Bitcoin Hits $50K, Jumps 200% in 3 Months, USD Shorts Touch a Decade High The price of bitcoin touched an all-time high surpassing the $50k handle on February 16, 2021. Cryptocurrency advocates celebrated the milestone as bitcoin has...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [87, 94, "Coin"], [222, 229, "Coin"]]}
{"id": 3120, "text": "Elon Musk Urges Dogecoin Whales to Dump Their Coins — Even Offers to Pay Them Tesla CEO Elon Musk believes that too many dogecoins are held by too few whales and has made them a huge offer. He will...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[16, 24, "Coin"], [121, 130, "Coin"], [78, 83, "Organization"]]}
{"id": 3121, "text": "Argentinean Prosecutor Investigates Alleged Bitcoin Scam Ganancias Deportivas In Mendoza, Argentina, law enforcement launched an investigation against a sports-related investment site for presumably being a bitcoin scam. Among the inquiries, authorities are...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[44, 51, "Coin"], [207, 214, "Coin"]]}
{"id": 3122, "text": "Bluezelle is Resisting Censorship with a New Developer Grant: Interview with Neeraj Muraka Online censorship has taken front and center since the sweeping ban of former U.S. President Donald Trump from every social outlet he's been a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 3123, "text": "Nigeria Crypto Ban: Stakeholder Body, Politicians Assail Central Bank’s Directive to Financial Institutions A body representing cryptocurrency and blockchain stakeholders in Nigeria has joined other crypto industry players in assailing the recent Central Bank of Nigeria (CBN)...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[247, 276, "Organization"]]}
{"id": 3124, "text": "Bitcoin Payments for Private Flights Soar, 20% of Privatefly’s Revenue Stems from Crypto Cryptocurrency users are leveraging their new-found wealth to fly more often with private jets. This week the directional aviation company Privatefly revealed that close...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [50, 60, "Organization"], [228, 238, "Organization"]]}
{"id": 3125, "text": "Mexico’s Third-Wealthiest Individual Adds Bitcoin to His Twitter Bio Just recently the Mexican billionaire, Ricardo Salinas Pliego, joined Elon Musk and a number of high-profile people, by adding the bitcoin hashtag to his...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[42, 49, "Coin"], [200, 207, "Coin"]]}
{"id": 3126, "text": "Tackling Crypto Mass Adoption: Jax.Network’s Mission PRESS RELEASE. Even though Bitcoin and Ethereum are called ‘cryptocurrencies’ people still treat them like assets instead of currencies. People are not spending cryptocurrencies...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[80, 87, "Coin"], [92, 100, "Coin"], [31, 42, "Organization"]]}
{"id": 3127, "text": "Paypal to Expand Its Crypto Services Offering to the UK Paypal’s cryptocurrency services are coming to the United Kingdom, as the digital payments giant is now targeting non-U.S. countries. Buy, sell and hold digital...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [56, 62, "Organization"]]}
{"id": 3128, "text": "Allianz Economic Advisor Says Argument for Bitcoin Is Evolving — More Companies Will Embrace BTC as Form of Payment Allianz's chief economic advisor, Mohamed El-Erian, says that the argument for investing in bitcoin has reached a pivot point. He sees more companies following...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [43, 50, "Coin"], [93, 96, "Coin"], [116, 123, "Organization"], [208, 215, "Coin"]]}
{"id": 3129, "text": "Morgan Stanley: Cryptocurrencies Here to Stay as Serious Asset Class, Bitcoin Making Progress to Replace Dollar Morgan Stanley's chief global strategist says that \"regardless of where the price of bitcoin goes next, cryptocurrencies are here to stay as a serious...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"], [70, 77, "Coin"], [111, 126, "Organization"], [197, 204, "Coin"]]}
{"id": 3130, "text": "Bitcoin Snaps Back After Slight Dip, Current BTC Chart ‘Is Near Identical to August 2017’ Digital currency prices are on the move again, after tumbling a hair downwards during Sunday evening’s trading sessions. On Sunday the price of bitcoin...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [45, 48, "Coin"], [234, 241, "Coin"]]}
{"id": 3131, "text": "Bitcoin Games Releases ‘The Angry Banker’, Hosts a $12,000 Tournament Bitcoin Games releases its first exclusive slot game The Angry Banker with a $12,000 tournament!First Exclusive Slot Game Since LaunchOur very own premium gaming...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[70, 83, "Organization"], [0, 13, "Organization"]]}
{"id": 3132, "text": "US Government Won’t Allow Corporates to Keep Replacing Dollars With Bitcoin, Warns Investment Advisor Dan Nathan, the founder of Risk Reversal Advisors, says that the U.S. government will not keep allowing corporations like Elon Musk's Tesla to replace...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 75, "Coin"], [236, 241, "Organization"], [0, 13, "Organization"], [167, 182, "Organization"]]}
{"id": 3133, "text": "Jed McCaleb Sells $22 Million Worth of XRP, Ripple Cofounder’s Stash Could Run Dry by May During the last few weeks, the former Ripple executive Jed McCaleb has reportedly been selling millions of XRP tokens and every sale has been...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[128, 134, "Organization"], [197, 200, "Coin"], [39, 43, "Coin"], [44, 50, "Organization"]]}
{"id": 3134, "text": "Red Envelopes and BCH: Prominent Mining Execs Jiang Zhuoer and Jihan Wu Bolster Bitcoin Cash In recent days, bitcoin cash has seen significant gains, and supporters of the digital currency have been positive about specific developments, like the internet...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[18, 21, "Coin"], [80, 92, "Coin"], [109, 121, "Coin"]]}
{"id": 3135, "text": "‘Black Swan’ Author Pulls a 180- Nassim Taleb Says ‘Bitcoin’s a Failure, at Least for Now’ On February 12, the well known Lebanese-American essayist and risk analyst, Nassim Nicholas Taleb, declared that the leading digital currency bitcoin is a failure,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[52, 59, "Coin"], [233, 240, "Coin"]]}
{"id": 3136, "text": "El Español Says Spanish Authorities Joint Statement Is a Warning to Companies in the Wake of Tesla’s BTC Buy The Spanish financial markets watchdog and the country’s central bank criticized — again — cryptocurrencies as an investment asset. The entities issued a joint...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[101, 104, "Coin"]]}
{"id": 3137, "text": "Indian Official Provides Updates on Crypto Bill and Transition Period for Crypto Holders: Report As the Indian government gets closer to moving forward with the cryptocurrency bill, an official from the Ministry of Finance reportedly explained what discussions...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3138, "text": "Darknet Market Joker’s Stash Retires After Raking in $1 Billion in Cryptocurrencies One of the largest darknet marketplaces for selling identity data and stolen credit card information, Joker’s Stash retired last month after making off with...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[15, 28, "Organization"], [186, 200, "Organization"]]}
{"id": 3139, "text": "Mirror Trading International Named Biggest Crypto Scam of the Year After Raking in $589 Million Blockchain analysis firm, Chainalysis' latest crime report has named Mirror Trading International (MTI) as the biggest cryptocurrency scam of 2020. Chainalysis arrived at this...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 28, "Organization"], [244, 255, "Organization"], [165, 199, "Organization"], [122, 133, "Organization"]]}
{"id": 3140, "text": "Elon Musk Could Face SEC Investigation Over Tesla’s Bitcoin Buy, Lawyers Warn The U.S. Securities and Exchange Commission (SEC) could investigate Elon Musk over Tesla's $1.5 billion bitcoin purchase, some legal experts have warned, including a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 24, "Organization"], [52, 59, "Coin"], [82, 127, "Organization"], [161, 166, "Organization"]]}
{"id": 3141, "text": "Candidate for Mayor Andrew Yang Plans to Make New York City a Bitcoin Hub Former presidential candidate Andrew Yang is running for mayor of New York City. He has promised that as mayor he would invest in making...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[62, 69, "Coin"]]}
{"id": 3142, "text": "Using Bitcoin With Apple Pay: Bitpay Adds Apple Pay Support — Google Pay, Samsung Pay to Follow Bitcoin payments service provider Bitpay has added support for Apple Pay. Holders of a Bitpay prepaid Mastercard in the U.S. can now add it...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[6, 13, "Coin"], [30, 36, "Organization"], [96, 103, "Coin"], [130, 136, "Organization"], [183, 189, "Organization"]]}
{"id": 3143, "text": "Earn Yield Farming Rewards with DeFi Yield Protocol (DYP) PRESS RELEASE. DeFi Yield Protocol (DYP) is a decentralized yield farming platform that allows liquidity providers to earn rewards in Ethereum and its native...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[192, 200, "Coin"], [73, 98, "Organization"], [32, 57, "Organization"]]}
{"id": 3144, "text": "Kim Dotcom Publishes a Website That Highlights the Benefits of Bitcoin Cash On February 12, the founder of the now-defunct file-sharing website Megaupload and cryptocurrency proponent, Kim Dotcom tweeted about a new website he created that...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[63, 70, "Coin"], [144, 154, "Organization"]]}
{"id": 3145, "text": "Twitter Stock Jumps 20% Following Reports the Company Is Weighing the Possibility of Adding BTC Buoyed by reports that Twitter has been studying the possibility of adding bitcoin to its balance sheet, the company’s stock surged to a new...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [92, 95, "Coin"], [119, 126, "Organization"], [171, 178, "Coin"]]}
{"id": 3146, "text": "Bitcoin’s Rapid Increase Should Compel Crypto Investors to Own Gold, Says Top Miner Sandeep Biswas, chief executive officer of Newcrest Mining, one of the world's biggest gold miners, has said that the sharp increase in bitcoin prices...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [220, 227, "Coin"]]}
{"id": 3147, "text": "Amazon Is Working on Digital Currency Solutions— Pilot Project Set to Launch in Mexico The e-commerce giant is preparing to explore the crypto business, as a recent job listing suggests. Amazon is looking to launch a pilot project...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [187, 193, "Organization"]]}
{"id": 3148, "text": "South Korean Court Orders Bithumb to Compensate Users for an Accidental BTC Withdrawal Case in 2018 A South Korean court ordered one of the biggest domestic crypto exchanges to compensate victims of an “accidental withdrawal” incident in 2018. Bithumb has...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[26, 33, "Organization"], [72, 75, "Coin"], [244, 251, "Organization"]]}
{"id": 3149, "text": "Colombia’s Financial Superintendent Approves Nine Crypto Platforms to Work With National Banks In Colombia, the entity managed by the Ministry of Finance and Public Credit, the Financial Superintendence of Colombia (Superfinanciera) has revealed the authorization of...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3150, "text": "2021 Crypto Market Stats Show a Number of Other Coins Gained More Than Bitcoin During the end of 2020 and into 2021, a great number of digital assets have seen significant gains and the bearish season that followed...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[71, 78, "Coin"]]}
{"id": 3151, "text": "Bitcoin ETF Approved: First North American Bitcoin ETF Set to Trade on Toronto Stock Exchange The first bitcoin exchange-traded fund (ETF) in North America has been approved to launch in Canada. Purpose Bitcoin ETF, an alternative mutual fund, is...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[195, 214, "Organization"], [104, 111, "Coin"], [0, 7, "Coin"], [43, 50, "Coin"]]}
{"id": 3152, "text": "Miami Going Full Bitcoin: City Supports Efforts to Hold Bitcoin in Treasury, Allow Tax Payments in BTC The U.S. city of Miami is going full bitcoin. The city commissioners have voted to support the mayor's resolution to allow payments in bitcoin...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 24, "Coin"], [56, 63, "Coin"], [140, 147, "Coin"]]}
{"id": 3153, "text": "US Treasury Secretary Janet Yellen Says ‘the Misuse of Cryptocurrencies Is a Growing Problem’ Janet Yellen, the new U.S. Treasury Secretary, has warned about \"a growing problem\" from \"the misuse of cryptocurrencies.\" She emphasized that \"cryptocurrencies have been...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [116, 129, "Organization"]]}
{"id": 3154, "text": "Oldest US Bank BNY Mellon Sets Up Crypto Unit to Offer Bitcoin Services The Bank of New York Mellon, BNY Mellon, has set up a digital asset unit. The oldest bank in the U.S. plans to \"hold,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 26, "Organization"], [55, 62, "Coin"], [72, 99, "Organization"], [101, 111, "Organization"]]}
{"id": 3155, "text": "Anonymous DeFi Project Core Announces New Token Project Core, an anonymous and hyped DeFi project, has announced Delta, a new product and token. Core says this will \"close the gap\" between options...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 27, "Organization"], [113, 118, "Coin"]]}
{"id": 3156, "text": "Massive 70 MW Bitcoin Mining Rig Shipped to Russia Big moves are happening within the bitcoin mining industry in Russia. An unnamed miner sent what seems to be the largest single batch of...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[14, 21, "Coin"], [86, 93, "Coin"]]}
{"id": 3157, "text": "Market Cap of Exchange-Issued Tokens Surpasses $43 Billion, Binance’s BNB Token Surges 150% Buoyed by bitcoin’s recent spike, altcoins including exchange-issued tokens recently made significant gains, while several of these crypto-assets went on to set new all-time...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[70, 79, "Coin"], [60, 67, "Organization"]]}
{"id": 3158, "text": "Sandbox Games and NFTs: Microsoft and Enjin Issue Minecraft-Compatible Blockchain Collectibles Players who enjoy the best-selling video game Minecraft will be able to transfer blockchain-based non-fungible token (NFT) assets into the game. Microsoft and the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 33, "Organization"], [38, 43, "Organization"]]}
{"id": 3159, "text": "Belgium Energy Minister’s Twitter Account Hacked- Fake Ethereum Giveaway Advertised The official Twitter account of Belgium’s Minister of Energy was the recent victim of a high-profile hacking incident. Tinne Van der Straeten’s profile was...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[55, 63, "Coin"]]}
{"id": 3160, "text": "Mysterious Address With $3 Billion in Dogecoin Sends Cryptic Binary Messages to Elon Musk Ever since the infatuation between Elon Musk and the meme-based cryptocurrency dogecoin, a number of people have looked at the asset critically. News.Bitcoin.com recently...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 46, "Coin"], [169, 177, "Coin"]]}
{"id": 3161, "text": "2021 Bitcoin Price Predictions: Analysts Forecast BTC Values Will Range Between Zero to $600K As bitcoin has touched new price highs on Thursday nearing the $50k handle, people have been curious as to where the price will go...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[5, 12, "Coin"], [50, 53, "Coin"], [97, 104, "Coin"]]}
{"id": 3162, "text": "Reddit Post Reporting Tesla’s Bitcoin Purchase From a Month Ago Was a Hoax A Reddit post that predicted Tesla’s $1.5 billion purchase of bitcoin on Monday has been revealed as a hoax, after the New York Post...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[30, 37, "Coin"], [137, 144, "Coin"], [104, 109, "Organization"], [0, 6, "Organization"]]}
{"id": 3163, "text": "Apple Well Positioned to Offer Crypto Trading — Analyst Says Company Should Hold Bitcoin in Treasury Apple Inc. is well positioned to offer cryptocurrency trading, according to an analyst with global investment bank RBC Capital Markets. Not only will Apple...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [81, 88, "Coin"], [216, 235, "Organization"], [251, 256, "Organization"]]}
{"id": 3164, "text": "Mastercard Will Start Supporting Cryptocurrencies Directly on its Network Payments giant Mastercard has announced that it is preparing to allow a number of cryptocurrencies to move through its network directly. Customers, merchants, and...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [89, 99, "Organization"]]}
{"id": 3165, "text": "Analysts Expect Flood of Companies to Follow Tesla and Hold Bitcoin —Twitter Already Considering Following Tesla's move to invest $1.5 billion in bitcoin, analysts are predicting that a flood of other companies will follow suit. Mad Money's Jim...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[45, 50, "Organization"], [60, 67, "Coin"], [69, 76, "Organization"], [107, 112, "Organization"], [146, 153, "Coin"]]}
{"id": 3166, "text": "ECB President Christine Lagarde Says ‘It’s out of the Question’ That Central Banks Would Hold Bitcoin The president of the European Central Bank (ECB), Christine Lagarde, has clarified whether central banks will start holding bitcoin now that a growing number...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"], [123, 150, "Coin"], [94, 101, "Coin"], [226, 233, "Coin"]]}
{"id": 3167, "text": "Major Malaysian Bank Kenanga Acquires 19% Stake in a Crypto Exchange One of Malaysia’s top investment banks has bought a 19% stake in a local crypto exchange via its private equity arm. The Kenanga Investment...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[190, 197, "Organization"], [21, 28, "Organization"]]}
{"id": 3168, "text": "Europol Arrests 10 Members of a Sim Swapping Criminal Gang That Stole Cryptocurrencies Worth $100 Million The European law enforcement agency, Europol, has arrested 10 people believed to be members of the criminal gang that stole cryptocurrencies with an estimated...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [143, 150, "Organization"]]}
{"id": 3169, "text": "Earn Money by Selling NFT Properties in Upland PRESS RELEASE. Hidden among a press release published on November 10, 2020 is one of the most significant developments in blockchain history: By partnering...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3170, "text": "Elon Musk Shoots Down Crypto Wallet App Freewallet After It Tried to Ride His Dogecoin Fame An attempt to capitalize on the ongoing hype around Dogecoin has backfired for the crypto wallet app Freewallet after it was called out online...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[40, 50, "Organization"], [78, 86, "Coin"], [193, 203, "Organization"], [144, 152, "Coin"]]}
{"id": 3171, "text": "Crypto Portfolio Tracking App Apologizes for Racist Messages Sent to Customers- Investigations Underway The crypto portfolio tracker Blockfolio, owned by the exchange FTX, got its messaging system compromised, as racist notifications started to appear. Blockfolio’s users received...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[167, 170, "Organization"], [133, 143, "Organization"], [253, 263, "Organization"]]}
{"id": 3172, "text": "All-Star Celebrity Line-Up Launches Ethernity – A Debut Collection of NFTs Winklevoss Twins, Swish DJ Alesso, and 76ers owner Michael Rubin debut digital artworks alongside an all-star celebrity line-up. The non-fungible tokens (NFTs) are a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 45, "Organization"]]}
{"id": 3173, "text": "Bitcoin Marketplace Keepchange Suffers Data Breach — No Funds Stolen During the Incident A bitcoin company is the latest victim of a data breach incident, where hackers managed to access customers’ full names and email addresses. Moreover,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 30, "Organization"]]}
{"id": 3174, "text": "Lindsay Lohan Tweets ‘Bitcoin to the Moon’- Celebrities Are Flocking to Crypto in Great Number Ever since bitcoin and a number of other digital assets started seeing price gains 11 months ago, a great number of celebrities started jumping...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 29, "Coin"], [106, 113, "Coin"]]}
{"id": 3175, "text": "The Many Facts Pointing to Chainlink’s Sergey Nazarov Being Satoshi Nakamoto During the last few years, smart contracts and blockchain oracles have transformed the crypto industry, and one specific project called Chainlink is the most...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[27, 36, "Organization"], [213, 222, "Organization"]]}
{"id": 3176, "text": "UN Report: North Korea Stockpiles $316 Million in Cryptocurrencies From Cyberattacks A panel of experts at the United Nations says that North Korea has amassed $316 million in cryptocurrencies from various cyberattacks on crypto exchanges...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[111, 125, "Organization"], [0, 2, "Organization"]]}
{"id": 3177, "text": "Antier Solutions Executes Transactions Worth $100 Million on Blockchain MLM Platforms PRESS RELEASE. After transforming businesses across various industries, blockchain has combined with MLM (Multi-level Marketing) to bring profound, positive changes in the industry. India’s...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 16, "Organization"]]}
{"id": 3178, "text": "Haunted by Past Elon Musk Predictions, Gold Bug Peter Schiff Tears Into Tesla’s BTC Acquisition After previously claiming that Elon Musk was too smart to buy bitcoin, Euro Pacific Capital CEO Peter Schiff is reacting angrily to reports that...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[72, 77, "Organization"], [80, 83, "Coin"], [158, 165, "Coin"], [167, 187, "Organization"]]}
{"id": 3179, "text": "Indian Finance Minister Answers Questions on Cryptocurrency Plans and Ban Proposal India's Finance Minister Nirmala Sitharaman has answered some questions regarding cryptocurrency in Rajya Sabha, the upper house of India's parliament. The questions include measures...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3180, "text": "Central Bank of Nigeria Denies It Has Placed New Restrictions on Cryptocurrencies — Uses Debunked Claims to Justify New Directive Following the outcry over the Central Bank of Nigeria's latest directive that targets cryptocurrencies, the institution has reaffirmed its stance with another statement. In...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 23, "Organization"], [160, 183, "Organization"]]}
{"id": 3181, "text": "Launchpool Plans to Launch an Egalitarian Model for All Stakeholders Launchpool : noun - A group of crypto industry participants who pool together resources to launch projects. The concept behind the project is to...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3182, "text": "Seized Silk Road Bitcoin Worth $3 Billion Likely Linked to Disgraced US Secret Service Agent  Over $3 billion worth in bitcoin seized by the U.S. Department of Justice (DOJ), belonging to Silk Road, are likely linked to a former...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 24, "Coin"], [141, 173, "Organization"], [69, 86, "Organization"]]}
{"id": 3183, "text": "Crypto Financial Services Firm Blockfi Launches Competitive Bitcoin Trust The cryptocurrency financial services firm Blockfi has launched a bitcoin-based trust that offers custody from Fidelity Digital Asset Services. Blockfi’s investment vehicle aims to...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 67, "Coin"], [140, 147, "Coin"], [31, 38, "Organization"], [117, 124, "Organization"], [218, 225, "Organization"]]}
{"id": 3184, "text": "South Korean Crypto Exchange Becomes the First Overseas Platform Legally Recognized in China A South Korean cryptocurrency exchange announced it established its first legally recognized branch in China. Although the nation banned all local crypto trading services,...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3185, "text": "Bitcoin Futures Open Interest Smashes $15 Billion, CME Registers Over $33 Million in ETH Contracts Following the revelation that Tesla now owns $1.5 billion in bitcoin, crypto spot markets across the board skyrocketed. Data shows that crypto derivatives markets...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[85, 88, "Coin"], [0, 7, "Coin"], [129, 134, "Organization"], [160, 167, "Coin"]]}
{"id": 3186, "text": "Expert warns Hackers are Targeting Russian Government’s IT Infrastructure to Mine Cryptocurrencies A state-affiliate cybersecurity expert warned about hackers exploiting the Russian government’s IT facilities to mine cryptocurrencies. The deputy director of the National Coordination Center...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3187, "text": "Mad Money’s Jim Cramer Says Tesla, Paypal, Mastercard Are Pushing Bitcoin More Into Mainstream Mad Money host Jim Cramer has applauded Elon Musk and Tesla for their bitcoin investment. He said that Tesla, Paypal, and Mastercard are pushing...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 33, "Organization"], [66, 73, "Coin"], [217, 227, "Organization"], [35, 41, "Organization"], [43, 53, "Organization"], [165, 172, "Coin"], [205, 211, "Organization"], [198, 203, "Organization"]]}
{"id": 3188, "text": "Bitcoin Taps $48K- Traders Discuss Overheated Stats and a Possible Chinese New Year Dump The price of bitcoin soared to new heights after Tesla informed the public that it added $1.5 billion to the company’s balance sheet. Bitcoin...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [102, 109, "Coin"], [138, 143, "Organization"], [223, 230, "Coin"]]}
{"id": 3189, "text": "Free TON and Dune Network to Merge Following Successful Vote, Free TON Gains Top Researchers Free TON is a community driven blockchain network with a focus on decentralized governance based on the open-source TON project which was previously developed...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[13, 25, "Organization"], [0, 8, "Organization"], [93, 101, "Organization"], [62, 70, "Organization"]]}
{"id": 3190, "text": "Indian Crypto Exchanges Flooded With INR Deposits and New Users After Elon Musk’s Tesla Revealed Bitcoin Purchase Indian crypto exchanges have been experiencing a flood of INR deposits and surging trading volumes since it was revealed that Elon Musk's Tesla purchased...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[97, 104, "Coin"]]}
{"id": 3191, "text": "Beijing’s $1.5 Million Digital Yuan Giveaway: China to Airdrop Digital Currency for Chinese New Year China is giving away 10 million yuan in its central bank digital currency in Beijing. Recipients can spend the digital yuan during the Chinese...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3192, "text": "Indian Government Confirms Crypto Bill Is Being Finalized — Existing Laws Inadequate The Indian government has spoken about the cryptocurrency bill again. This time, the minister of state for finance has clarified the status of the...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3193, "text": "Average Crypto Trading Fees 2020 – Cryptowisser Finds Industry Leaders Still Have Higher Fees PRESS RELEASE. Cryptowisser, who operates the world’s largest crypto exchange list, has published the second installment of its quarterly empirical report on trading fees...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 47, "Organization"], [109, 121, "Organization"]]}
{"id": 3194, "text": "Serbian National Arrested and Extradited to the US for His Role in a $70M Crypto Mining Case A Serbian national has been extradited to the United States to face charges of defrauding investors out of more than $70 million through a...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3195, "text": "Etoro’s Gooddollar Basic Income Initiative Aims to Fund 1 Million New Users With New Referral Program An incentive of 100G$ will be given to registered users for new referrals, and 50G$ to new users as a ‘welcome bonus.' Etoro, one...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [221, 226, "Organization"]]}
{"id": 3196, "text": "Estonia’s Government Still Wants to Implement Stricter Rules for Licensing Crypto Firms The new administration in Estonia is still planning to pursue an agenda to tighten rules for companies dealing with cryptocurrencies. The Ministry of Finance...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3197, "text": "Cordoba Becomes the First Argentinean Province to Impose Taxes on Crypto-Related Activities In Argentina, a provincial legislature has voted in favor of a bill to impose new taxes on gross incomes from crypto transactions. Cordoba's central...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3198, "text": "Human Rights Foundation’s Alex Gladstein Calls Bitcoin ‘An Escape Hatch From Tyranny’ The Human Rights Foundation (HRF)’s Alex Gladstein has heaped praise on bitcoin saying it's an escape hatch from tyranny and that there is more...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[47, 54, "Coin"], [90, 119, "Organization"], [0, 24, "Organization"]]}
{"id": 3199, "text": "Linkin Park’s Mike Shinoda Auctions his First Non-Fungible Token Musician Mike Shinoda, guitarist and founding member of the American rock band Linkin Park, has auctioned his first non-fungible token (NFT) for a charitable...", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 3200, "text": "Bitcoin Price Surpasses $44k Handle, ETH Futures Launch, Tesla’s Balance Sheet BTC Praised The price of bitcoin touched a new all-time high on Monday after the community discovered that Elon Musk’s firm Tesla added $1.5 billion worth...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [37, 40, "Coin"], [79, 82, "Coin"], [104, 111, "Coin"], [203, 208, "Organization"], [57, 62, "Organization"]]}
{"id": 3201, "text": "Cardano Token Pips Dot Into Fifth Place After Price Surges by 85% —Elon Musk Endorsed Dogecoin Sets New All Time High The Cardano network token has toppled Dot to become the crypto-asset with the fourth-highest market capitalization. This new Cardano position comes after its price...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 22, "Coin"], [86, 94, "Coin"], [156, 159, "Coin"], [122, 129, "Coin"], [243, 250, "Coin"], [0, 7, "Coin"]]}
{"id": 3202, "text": "Tesla Has $1.5 Billion Worth of Bitcoin on Its Balance Sheet, Plans to Accept BTC for Products The publicly listed firm Tesla has announced in a Securities and Exchange Commission (SEC) Form 10-k filing that the company has purchased $1.5 billion...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [32, 39, "Coin"], [78, 81, "Coin"], [145, 185, "Organization"]]}
{"id": 3203, "text": "Paxful Celebrates the Real Reasons People Use Bitcoin Everyday With #BitcoinForAll Giveaway Paxful, one of the largest peer-to-peer cryptocurrency marketplaces in the world, is celebrating the real reasons people use bitcoin everyday with a special $15,000...", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [46, 53, "Coin"], [92, 98, "Organization"]]}
