{"id": 4742, "text": "Core contributors, investors debate Yearn token mint After a stormy weekend for DeFi's original yield vault, dust is settling and a path forward is being paved", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 41, "Coin"]]}
{"id": 4743, "text": "85% Dogecoin rally shows r/Wallstreetbets isn't done with DOGE yet Dogecoin rallied by more than 85%, suggesting r/Wallstreetbet’s crypto wing may have decided that they weren’t done with DOGE yet.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 13, "Coin"], [58, 63, "Coin"], [67, 76, "Coin"], [188, 193, "Coin"]]}
{"id": 4744, "text": "Robinhood and GameStop proved we need a new financial system It’s time to shine for DeFi, as the old financial system has rotted and degenerated and has been the main villain amid the GameStop saga.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [14, 23, "Organization"], [184, 193, "Organization"]]}
{"id": 4745, "text": "Can banks be their own bank? Deutsche Bank, BNY Mellon plan custody services  Experts say building custody solutions is tricky, but will become crucially important as crypto grows more valuable.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 42, "Organization"], [44, 54, "Organization"]]}
{"id": 4746, "text": "Congress worries crypto used to fund domestic terrorism, Capitol insurrection U.S. Congress subcommittee says that bank reporting methods led to Capitol attack arrests but worries that Bitcoin might have helped fund the insurrection.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[185, 193, "Coin"]]}
{"id": 4747, "text": "DeFi wars heat up as Curve Finance TVL hits $3.99B, surpassing Uniswap Curve Finance has surpassed Uniswap’s total value locked, a sign that competition between DeFi protocols is heating up.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 39, "Coin"]]}
{"id": 4748, "text": "YouTube star Mr Beast, with 50M subscribers,  becomes a verified Brave browser publisher  Mr Beast, joins almost 1 million other verified Brave publishers, potentially exposing some of his  subscribers to Brave browser and its native BAT token.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[234, 238, "Coin"], [0, 8, "Organization"]]}
{"id": 4749, "text": "Canadian investment firm Accelerate Financial files for Bitcoin ETF Calgary-based financial services firm Accelerate Financial Technologies is planning to list its Bitcoin ETF on the Toronto Stock Exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[56, 64, "Coin"], [164, 172, "Coin"]]}
{"id": 4750, "text": "Bitcoin and altcoins correct after Yellen’s ‘illicit financing’ critique Janet Yellen’s critical comments about cryptocurrencies put a damper on the wider market just as Ethereum price reached a new all-time high.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [170, 179, "Coin"]]}
{"id": 4751, "text": "Bernie Sanders mitten memes immortalized in new NFT collection He may not be president, but Bernie Sanders will live on as long as blockchain exists, thanks to a series of NFTs celebrating his mittens.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4752, "text": "Cointelegraph launches Markets Pro crypto intelligence platform, powered by The TIE The live beta test suggests that historical analysis of crypto markets, combined with real-time conditions and investor sentiment, can be extremely informative.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"], [23, 34, "Organization"]]}
{"id": 4753, "text": "Bitcoin mining operator Northern Data reportedly considering $500M IPO Swiss investment bank Credit Suisse is reportedly backing German Bitcoin mining operator Northern Data in its $500 million IPO.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [136, 144, "Coin"], [93, 106, "Organization"]]}
{"id": 4754, "text": "Portuguese power company to accept Bitcoin for electricity bills Some Portuguese residents will reportedly be able to pay for electricity in Bitcoin starting from February.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 43, "Coin"], [141, 149, "Coin"]]}
{"id": 4755, "text": "Whale who sold Bitcoin before 2020 crash cashed out $156M before this week's 20% dip A serial seller with a lot of BTC to their name chose to divest themselves of a large chunk of Bitcoin just before Monday's crash to $47,400.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[15, 23, "Coin"], [115, 119, "Coin"], [180, 188, "Coin"]]}
{"id": 4756, "text": "Africa to bring 100 million users to DeFi in three years from now, says founder of Cardano  Cardano founder Charles Hoskinson predicts that the DeFi revolution will take place in the developing world.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4757, "text": "Bahrain central bank licenses Sharia-compliant crypto exchange Bahrain-based crypto exchange CoinMENA acquired a major license ahead of its launch in several countries including the UAE and Saudi Arabia.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4758, "text": "Overstock spins its blockchain subsidiary into investment fund Overstock subsidiary Medici Ventures will cease providing all previous services pending a full conversion into a limited partnership fund.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4759, "text": "Newsweek's positive coverage of Bitcoin underscores paradigm shift in public perception The publication explores whether Bitcoin will become the new gold standard.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 40, "Coin"], [121, 129, "Coin"]]}
{"id": 4760, "text": "BlockFi exec explains institutional outlook on altcoins  He says that institutional players look for certain volume and market cap levels when considering altcoins.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4761, "text": "Altcoins nurse double-digit losses as Bitcoin bulls fight to retake $49K A renewed wave of selling briefly pushed Bitcoin price below $45,000, and the majority of altcoins saw their double-digit losses increase.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 46, "Coin"], [114, 122, "Coin"]]}
{"id": 4762, "text": "China turns up pace on CBDC release, tests infrastructure prior to adoption The yuan is not seen as a major currency. Could digitizing it change that? China is breaking new ground in the Shenzhen region and beyond.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4763, "text": "Secure Bitcoin self-custody: Balancing safety and ease of use  With Bitcoin’s price clocking $40,000 recently, safe and secure measures for storing the valuable digital asset are once again on the agenda.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 15, "Coin"], [68, 77, "Coin"]]}
{"id": 4764, "text": "Surge in Bitcoin energy consumption sparks debate in crypto community  Bitcoin energy consumption has been at its highest historical levels since late 2020, according to Digiconomist’s Bitcoin Energy Consumption Index.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[9, 17, "Coin"], [71, 79, "Coin"], [170, 182, "Organization"]]}
{"id": 4765, "text": "Yearn.finance eyes new all-time high — Can YFI  price reach the next $66K target?  YFI price can break above $50,000 if Bitcoin continues to consolidate in the near term.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[43, 48, "Coin"], [120, 128, "Coin"], [83, 87, "Coin"]]}
{"id": 4766, "text": "Miami mayor aiming for 'the most progressive crypto laws' “We want to make sure that we believe that if all things are equal, we win,\" said Mayor Francis Suarez.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4767, "text": "Jack Dorsey commits $1M to Coin Center on top of Grayscale's $2M donation  The D.C.-based advocacy group just raised millions for its ongoing research and lobbying efforts. Here’s how the numbers broke down.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[27, 38, "Organization"], [49, 61, "Organization"]]}
{"id": 4768, "text": "Pro traders buy the dip as bears push Bitcoin price to the edge of $30K After correcting 15%, Bitcoin price dropped to $30,000 but derivatives indicators suggest pro traders are buying the dip.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 46, "Coin"], [94, 102, "Coin"]]}
{"id": 4769, "text": "Devs ditching old ‘Ethereum killers’ for DeFi, NFTs and newer chains: Report  Developers are switching their efforts to DeFi as it takes a larger slice of the crypto market.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 28, "Coin"]]}
{"id": 4770, "text": "Cointelegraph Consulting: BTC whales buying big as retail goes bullish Big BTC holders continue to accumulate as recent news supports the bullish sentiment.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"], [26, 30, "Coin"], [75, 79, "Coin"]]}
{"id": 4771, "text": "Many pieces of the Diem puzzle still missing as launch gets delayed Besides securing approval from Swiss regulators, Diem seems likely to face opposition from government regulators in many countries.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4772, "text": "DOGE is now supported at 1,800 ATMs in 45 US states U.S. citizens can now purchase Dogecoin from ATMs in 45 of the country’s 50 states.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"], [83, 92, "Coin"]]}
{"id": 4773, "text": "Akoin rolled out in $2B medical metropolis in Kenya Akon’s Akoin cryptocurrency is set to become the exclusive cryptocurrency of the Mwale Medical and Technology City in Kenya.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [59, 65, "Coin"]]}
{"id": 4774, "text": "Winklevoss brothers top Forbes Bitcoin billionaires list Forbes has named the six biggest winners of this latest cryptocurrency rally, including the Winklevoss brothers and Bloq’s Matthew Roszak.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4775, "text": "Here’s why Bitcoin price is struggling to reclaim $38,000 Bitcoin price may have flipped $35,000 back to support but data shows this week’s 15% move may have prompted top traders to open short positions.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 18, "Coin"], [58, 66, "Coin"]]}
{"id": 4776, "text": "Price analysis 2/12: BTC, ETH, ADA, XRP, DOT, BNB, LTC, LINK, XLM, BCH Altcoins are soaring to new highs while Bitcoin price trades in a sideways range near the $47,000 support.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 24, "Coin"], [36, 39, "Coin"], [41, 44, "Coin"], [26, 29, "Coin"], [31, 34, "Coin"], [46, 49, "Coin"], [51, 54, "Coin"], [56, 60, "Coin"], [62, 65, "Coin"], [67, 71, "Coin"], [111, 119, "Coin"]]}
{"id": 4777, "text": "Ultra-rare alien CryptoPunk NFT sells for 605 ETH, or $750,000 The NFT market is getting molten hot as a rare \"alien\" CryptoPunk sells for over $750,000", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 49, "Coin"]]}
{"id": 4778, "text": "Poll finds four in 10 Brits believe the stock market is as risky as crypto  A new poll has found that 42% of Brits believe it is now safe to invest in cryptocurrency.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4779, "text": "Price analysis 1/25: BTC, ETH, DOT, XRP, ADA, LINK, LTC, BCH, BNB, XLM Altcoins continue to trend higher, but Bitcoin price needs to turn $35,000 to support in order for the entire market to gain momentum.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 24, "Coin"], [26, 29, "Coin"], [31, 34, "Coin"], [36, 39, "Coin"], [41, 44, "Coin"], [46, 50, "Coin"], [52, 55, "Coin"], [57, 60, "Coin"], [62, 65, "Coin"], [67, 71, "Coin"], [110, 118, "Coin"]]}
{"id": 4780, "text": "Decentralization in the centers of power: Learn crypto from Biden's SEC chair pick, part 3/3 The next leader of the U.S. securities regulator seems to be sympathetic to the mission of decentralization.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4781, "text": "Gamified yield farming with nonfungible tokens Game developers are now trying to use the foundational premise put forth by NFTs and to marry the idea with that of yield farming.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4782, "text": "The year 2021 will bring DeFi into adolescence 2021 will be a pivotal year for DeFi by transforming the way we see financial services and the future of money.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4783, "text": "$45B DeFi market cap and soaring TVL suggest the best is yet to come  The decentralized finance market cap has reached $45 billion as the total value locked in DeFi continues to rise to new highs.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 37, "Coin"]]}
{"id": 4784, "text": "Regulators dial up the heat: Dash, ZEC and Monero reach boiling point? Can privacy coins be better managed to satisfy both law enforcement interests and those who like the greater anonymity they provide?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 33, "Coin"], [35, 39, "Coin"], [43, 50, "Coin"]]}
{"id": 4785, "text": "Number of financial planners investing in crypto increases by 50% A survey published by Bitwise has found that nearly 10% of investment advisors have made client portfolio allocations into crypto assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4786, "text": "Black Americans are changing the face of crypto and blockchain through education In honor of Black History Month, Cointelegraph is recognizing Black Americans who are innovating in the blockchain and cryptocurrency space.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[114, 127, "Organization"]]}
{"id": 4787, "text": "Where does this 28% Bitcoin price drop rank in history? Not even in the top 5 At 28%, this weekend's BTC price action was decidedly average compared to the cryptocurrency's run-up to 2017 all-time highs.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 28, "Coin"], [101, 105, "Coin"]]}
{"id": 4788, "text": "DeFi will provide good regulatory test for SEC, says Commissioner Peirce  The SEC commissioner described the DeFi space as \"a work in process\" but overall \"alluring.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4789, "text": "Thailand stock exchange to open digital asset trading... without crypto?  Thailand’s stock exchange doesn’t want cryptocurrencies included on its new digital asset trading platform.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4790, "text": "Crypto is ‘poorest hedge’ for drawdowns in equities, JPMorgan analysts say Analysts bashed Bitcoin despite JPMorgan co-president Daniel Pinto claiming that Bitcoin adoption is inevitable at some point.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[53, 62, "Organization"], [91, 98, "Coin"], [107, 116, "Organization"], [156, 164, "Coin"]]}
{"id": 4791, "text": "Spike in DeFi lending pushes Compound (COMP) price to a new high at $570 New entrants to the DeFi sector and established traders looking to borrow funds have pushed the price of Compound (COMP) to a new all-time high.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 38, "Coin"], [39, 43, "Coin"], [188, 192, "Coin"], [178, 187, "Coin"]]}
{"id": 4792, "text": "Komainu to store crypto confiscated by UK law enforcement   The Assistant Commissioner of the City of London Police said the partnership with Komainu would help in “denying criminality the proceeds of crime.\"", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [142, 150, "Organization"]]}
{"id": 4793, "text": "Dutch Bitcoin exchange drags central bank to court over wallet KYC rule One Dutch Bitcoin exchange has taken legal action against the central bank over its controversial crypto wallet verification law.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[63, 67, "Coin"]]}
{"id": 4794, "text": "Enterprise meets DeFi: Organizations work toward adopting blockchain tech Enterprise DeFi adoption is in development, but a number of challenges must be addressed before it’s ready for the mainstream.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4795, "text": "OKCoin delists two Bitcoin forks over ‘malicious misinformation’ campaign OKCoin cites actions antithetical to Bitcoin's open ethos as the reason for delisting BCH and BSV", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [19, 27, "Coin"], [74, 81, "Coin"], [111, 121, "Coin"], [160, 164, "Coin"], [168, 171, "Coin"]]}
{"id": 4796, "text": "Zcash (ZEC), Kusama (KSM) and Hedget (HGET) soar as Bitcoin hits $40K  Zcash, Kusama and Hedget are a few of the projects seeing their token values increase due to the unique set of issues they address.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [7, 10, "Coin"], [13, 20, "Coin"], [21, 24, "Coin"], [30, 37, "Coin"], [38, 42, "Coin"], [52, 60, "Coin"], [71, 76, "Coin"], [78, 84, "Coin"], [89, 96, "Coin"]]}
{"id": 4797, "text": "More than 80% of LINK is controlled by 125 wallets New research from Glassnode indicates the top 1% of Chainlink holders control nearly 81% of the token’s supply.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 22, "Coin"], [69, 79, "Organization"], [103, 113, "Coin"]]}
{"id": 4798, "text": "New report predicts NFTs will explode in popularity during 2021 NFTs are pumping right now, with a new report identifying more NFT sales in the last 24 hours than during the entirety of 2020.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4799, "text": "Major Malaysian financial firm to invest in regulated crypto exchange Malaysian financial services firm Kenanga Investment Bank Berhad is getting into digital assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[104, 134, "Organization"]]}
{"id": 4800, "text": "Coinbase unveils plans for direct stock listing  The San Francisco-based digital currency exchange plans to go public later this year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 4801, "text": "Four of the top 70 crypto assets by market cap are Bitcoin Crypto data sites are double-counting tokenized Bitcoin, with three BTC tokenization protocols representing more than 1.4% of the reported altcoin market cap.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 59, "Coin"], [107, 114, "Coin"], [127, 131, "Coin"]]}
{"id": 4802, "text": "Exchange-traded products abound, but crypto is still waiting for an ETF Swiss SIX Exchange has listed BTCetc Bitcoin ETP, a new crypto ETP product backed by London investment firm ETC Group.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[72, 90, "Organization"], [180, 190, "Organization"]]}
{"id": 4803, "text": "2 key Bitcoin price indicators show pro traders are waiting for $36K Bitcoin price rallied back to $35,000, but key indicators show top traders are proceeding with caution.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[6, 14, "Coin"], [69, 77, "Coin"]]}
{"id": 4804, "text": "American Cancer Society launches first-ever Crypto Cancer Fund  The American Cancer Society and The Giving Block have created a new research fund that accepts crypto donations.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4805, "text": "Blockchain.com follows other exchanges in delisting XRP Ripple's woes multiply as Blockchain.com becomes the latest exchange to suspend trading of XRP.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[147, 150, "Coin"], [0, 14, "Organization"], [52, 55, "Coin"], [56, 65, "Coin"], [82, 96, "Organization"]]}
{"id": 4806, "text": "USDT-settled futures contracts are gaining popularity — Here’s why Crypto exchanges offer USDT- and BTC-settled perpetual futures contracts, but which is best suited for the average trader?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[100, 103, "Coin"]]}
{"id": 4807, "text": "Dollar weakness meets alt season: Is Bitcoin price about to hit $50K? The price of Bitcoin is getting closer to the next major psychological resistance.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 45, "Coin"], [83, 91, "Coin"]]}
{"id": 4808, "text": "NFT market top signal? Fake Banksy nets over $1 million in ETH from NFT sales With a charity and some slapdash art theory as a cover, a copycat makes off with 512 ETH in NFT sales.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[59, 63, "Coin"], [163, 167, "Coin"]]}
{"id": 4809, "text": "Bitcoin price hits $50K after bullish outlook from Citigroup and Goldman Sachs Bullish maneuvers from MicroStrategy, Goldman Sachs and Citigroup are just a few of the factors backing Bitcoin's rally back to $50,000.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [51, 61, "Organization"], [102, 115, "Organization"], [65, 78, "Organization"], [117, 130, "Organization"], [135, 145, "Organization"], [183, 192, "Coin"]]}
{"id": 4810, "text": "Tether to report reserves and pay $18.5M fine after settlement with NYAG New York regulators are forcing Tether to be fully transparent about its reserves, at the cost of not serving New York residents.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[105, 112, "Organization"], [0, 7, "Organization"]]}
{"id": 4811, "text": "Financial advisers are betting on Bitcoin as a hedge  A new Bitwise survey highlights a more favorable attitude toward Bitcoin and cryptocurrencies.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 42, "Coin"], [119, 127, "Coin"]]}
{"id": 4812, "text": "JPMorgan Chase execs weigh in on stablecoin regulation, crypto competition While the OCC's new stablecoin guidance doesn't have an impact on JPM Coin, it could lead to crypto payments if there's demand", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"], [141, 149, "Coin"]]}
{"id": 4813, "text": "Ethereum-based domain names go mainstream with Cloudflare integration  Unstoppable Domains' integration with Cloudflare means any browser on the internet can now access the Ethereum-based .crypto extension.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [47, 58, "Organization"], [109, 120, "Organization"]]}
{"id": 4814, "text": "Coinbase outage caused crypto purchase issues, not an intentional ban  Coinbase posted an in-depth explanation of its Jan. 29 platform difficulties.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [71, 80, "Organization"]]}
{"id": 4815, "text": "Theta blockchain launches first decentralized exchange dubbed ThetaSwap Blockchain-based video streaming network Theta now has its own decentralized exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"], [62, 72, "Organization"], [113, 119, "Coin"]]}
{"id": 4816, "text": "DOGE price surge: The power of memes and social media on full display Dogecoin, the quintessential meme crypto, is being pulled on a leash by yet another social media-driven hype.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"], [70, 78, "Coin"]]}
{"id": 4817, "text": "Scams are driving South African authorities to regulate crypto trading  The Financial Sector Conduct Authority is demanding tighter regulatory control over cryptocurrency.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4818, "text": "Synthetix announces $12 million raise led by Paradigm, Coinbase Ventures, and IOSG As the crypto community debates VCs participating in DAOs, Synthetix welcomes three new Spartans", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [45, 53, "Organization"], [55, 72, "Organization"], [142, 152, "Organization"]]}
{"id": 4819, "text": "Senator to launch Financial Innovation Caucus to educate lawmakers on crypto Cynthia Lummis, a U.S. senator who openly owns Bitcoin, will launch a Financial Innovation Caucus to educate her fellow senators about BTC and crypto assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[124, 131, "Coin"], [212, 216, "Coin"]]}
{"id": 4820, "text": "Major exchange lists token of project delivering new use cases for BTC The native token of a crypto project that brings apps and smart contracts to Bitcoin has been listed by a major exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[67, 71, "Coin"], [148, 156, "Coin"]]}
{"id": 4821, "text": "Crypto project brings apps and smart contracts to Bitcoin A crypto project is bringing apps and smart contracts to Bitcoin — and offers the first consensus algorithm to span two blockchains.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[50, 58, "Coin"], [115, 123, "Coin"]]}
{"id": 4822, "text": "Bitcoin price is sideways, silver hits a 7-year high and XRP’s rally pops While Bitcoin trades sideways, the price of silver rushed to a 7-year high and XRP surprised new investors with a sharp 50% sell-off.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[80, 88, "Coin"], [153, 157, "Coin"], [0, 8, "Coin"], [57, 63, "Coin"]]}
{"id": 4823, "text": "Crypto market cap breaks $1 trillion following jaw-dropping rally The combined value of all cryptocurrencies just hit $1 trillion as Bitcoin and Ether continue to surge.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[133, 141, "Coin"], [145, 151, "Coin"]]}
{"id": 4824, "text": "CoinShares to launch $200m Bitcoin ETP on Swiss stock exchange CoinShares' CSO says the firm is “starting 2021 off with a bang” by launching a $200 million physically-backed Bitcoin ETP on Switzerland’s SIX exchange.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [27, 35, "Coin"], [63, 73, "Organization"], [174, 182, "Coin"], [189, 215, "Organization"]]}
{"id": 4825, "text": "Ledger owners report chilling threats after 20K more records leaked  “Are you able to imagine all the possible consequences that can occur to you and your loved ones?” said the scammer.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4826, "text": "Mark Cuban talks Bitcoin HODLers and blockchain stocks in recent AMA \"Stocks will be on the blockchain in the future,\" predicted the billionaire.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[17, 25, "Coin"]]}
{"id": 4827, "text": "Privacy in blockchain and crypto is a major concern for users, study reveals  Privacy is still one of the most important features of cryptocurrencies for traders according to data.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4828, "text": "Belarusian government explores potential move into crypto mining The Ministry of Energy of the Republic of Belarus has launched an investigation into the potential pros and cons of crypto mining.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4829, "text": "All of the Federal Reserve's wire and ACH systems go down \"A Federal Reserve operational error resulted in disruption of service in several business lines,\" said Jim Strader from the Richmond Fed.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 42, "Coin"]]}
{"id": 4830, "text": "Key Bitcoin price indicators signal bulls bought the $43K retest Bitcoin’s recent 26% drop sent weak hands running for the hills, but derivatives data shows BTC’s setup is still bullish.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Coin"], [65, 75, "Coin"], [157, 163, "Coin"]]}
{"id": 4831, "text": "Bitcoin bulls eye $50K as data show BTC’s liquid supply in steady decline Several altcoins surged to new all-time highs while Bitcoin price consolidated in preparation for a renewed push to the $49,000 level.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [36, 42, "Coin"], [126, 134, "Coin"]]}
{"id": 4832, "text": "Hanwha to acquire $52M stake in crypto exchange Upbit’s parent company Hanwha Investment and Securities reached an agreement to buy 2.06 million shares from Upbit operator Dumanu.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 56, "Organization"], [70, 103, "Organization"], [157, 163, "Organization"]]}
{"id": 4833, "text": "Bitcoin volatility almost returned to 'Black Thursday' levels in January A report from Kraken has identified last month’s BTC volatility at levels not seen since the ‘Black Thursday’ crash of early 2020.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [87, 94, "Coin"], [122, 126, "Coin"]]}
{"id": 4834, "text": "Bitcoin bull run could end if institutions go under, Komodo exec speculates  The likelihood of such a scenario is tenuous but not impossible.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"]]}
{"id": 4835, "text": "WATCH: Top cryptocurrency trends in 2021, according to the Cointelegraph crew See what the Cointelegraph crew thinks are the most important trends of 2021 in our latest video.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[59, 73, "Organization"], [91, 105, "Organization"]]}
{"id": 4836, "text": "As Visa and Mastercard raise fees, merchants may look to crypto Cryptocurrencies have fees, but so do payment cards.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 8, "Organization"], [12, 23, "Organization"]]}
{"id": 4837, "text": "Bloomberg's Mike McGlone says BTC could be headed to $50K as gold loses appeal The Bitcoin-to-gold price ratio could shoot to 100x with the digital asset’s volatility possibly dropping to gold levels by 2024.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[30, 34, "Coin"]]}
{"id": 4838, "text": "Nigeria's SEC suspends planned crypto regulations amid central bank ban Nigeria’s securities regulator has backed the central bank’s crypto ban by suspending its planned regulatory framework for digital assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4839, "text": "Thailand tourism board targets wealthy Japanese crypto holders Well-heeled Japanese crypto holders are being targeted by Thailand’s tourism industry.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4840, "text": "Here’s why IOST, Horizen (ZEN) and Avalanche (AVAX) surged as Bitcoin crashed Strong fundamentals and new offerings explain why IOST, Horizon (ZEN) and Avalanche (AVAX) rallied higher as Bitcoin price pulled back.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 15, "Coin"], [17, 25, "Coin"], [26, 29, "Coin"], [35, 44, "Coin"], [46, 50, "Coin"], [62, 69, "Coin"], [128, 132, "Coin"], [134, 142, "Coin"], [143, 146, "Coin"], [152, 162, "Coin"], [163, 167, "Coin"], [187, 195, "Coin"]]}
{"id": 4841, "text": "DeFi snowball will turn into a Web 3.0 avalanche We are at a pivotal moment in the history of the internet. And DeFi is a symptom of the real shift from centralized services to decentralized.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4842, "text": "SEC’s Division of Examinations issues Risk Alert on digital assets The Risk Alert seemed to take particular aim at broker-dealers, who have been \"inadequate\" in their AML compliance.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4843, "text": "Leverage traders 'flushed out' by late-February crypto crash: Glassnode Crypto analytics provider Glassnode argues the late February BTC crash may have been a healthy reset that flushed excessive leverage out of the market.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[133, 137, "Coin"]]}
{"id": 4844, "text": "Robinhood announces plans to offer crypto deposits and withdrawals Robinhood’s reputation has taken a battering lately, but it hopes to regain credibility among the crypto community by introducing cryptocurrency transfers.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [67, 79, "Organization"]]}
{"id": 4845, "text": "Altcoins soar after 10% Bitcoin price breakout flips $33K back to support Altcoins soared higher as Bitcoin price reclaimed $33,000 as support just one day before a record $4 billion BTC futures expiry.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 32, "Coin"], [100, 108, "Coin"], [186, 187, "Coin"]]}
{"id": 4846, "text": "Pantera Capital CEO doubles down on $115K Bitcoin prediction for 2021 Pantera Capital CEO Dan Morehead believes that propelled adoption will drive the Bitcoin price above $100,000 by August 2021.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 15, "Organization"], [42, 49, "Coin"], [151, 159, "Coin"], [70, 85, "Organization"]]}
{"id": 4847, "text": "The staking race: Late entrant Ethereum lags behind rivals with Eth2 The second-biggest cryptocurrency is only the fourth-ranked staking network, but it’s looking to catch up to the rest.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 40, "Organization"], [64, 69, "Organization"]]}
{"id": 4848, "text": "Coinbase users can now report their crypto taxes using CoinTracker Filing 2020 taxes may be slightly less complicated for Coinbase users than it was before.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [55, 67, "Organization"], [122, 131, "Organization"]]}
{"id": 4849, "text": "Dutch crypto exchange users bemoan additional KYC requirements  Bitstamp traders based in the Netherlands now have even more regulatory hoops to scale before being able to withdraw their funds.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[64, 73, "Organization"]]}
{"id": 4850, "text": "XRP risks losing top-5 crypto status as Polkadot, Cardano market caps hit $21B A second usurping of XRP by Polkadot leaves it perilously close to exiting the top five cryptocurrencies by market cap.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Coin"], [40, 48, "Organization"], [100, 104, "Coin"], [107, 116, "Organization"], [50, 58, "Organization"]]}
{"id": 4851, "text": "Retail is here: The virtuous cycle of social engagement with crypto The recent Bitcoin rally is driving crowds of new retail investors to crypto markets, and the Main Street itself deserves the credit.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[79, 87, "Coin"]]}
{"id": 4852, "text": "Web-based YIELD App looks to tackle DeFi's 'inherent complexity'  YIELD App launched the public beta of its web platform Friday. Its target audience is retail investors looking for easy exposure to DeFi.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 19, "Organization"], [66, 75, "Organization"]]}
{"id": 4853, "text": "Run, blockchain, run! DeFi adoption needs faster block times Low-cost, low-latency and highly scalable blockchain infrastructure — that is what will lead crypto and DeFi to real mass adoption.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4854, "text": "Digital art project sells out $10M in NFTs in four days Early adopters have scooped up over 15,300 Hashmask NFTs as one \"card\" has gone on sale for 97 ETH.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[151, 154, "Coin"]]}
{"id": 4855, "text": "As Bitcoin price sees sub-$30K, do bears control the BTC market now?  The price of Bitcoin dropped below $30,000 in a quick swoop on the third retest in two weeks of the support area.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 11, "Coin"], [53, 57, "Coin"], [83, 91, "Coin"]]}
{"id": 4856, "text": "Pretrial settlement not in the cards in SEC vs. Ripple case Both parties are currently not considering terms for a pretrial settlement.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 55, "Coin"]]}
{"id": 4857, "text": "One-stop-shop for DeFi to make staking easy, accessible and affordable A platform is billing itself as a one-stop-shop for DeFi that delivers interoperability across multiple blockchains.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4858, "text": "eToro warns users crypto trading may become limited due to 'unprecedented demand'  Exchange platform eToro is struggling amid surging demand for crypto, sending an email to all users warning of possible trading limitations this weekend.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4859, "text": "As Bitcoin rises above $41K, can Coinbase keep up with the rally? Major crypto exchange Coinbase appears to be operating smoothly even as Bitcoin sets a new price high above $41,000.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 11, "Coin"], [33, 42, "Organization"], [88, 97, "Organization"], [138, 146, "Coin"]]}
{"id": 4860, "text": "Binance Coin becomes the third-largest crypto following parabolic rally Binance Coin overtakes Tether to become the third-largest cryptocurrency by market capitalization after Bitcoin and Ether.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 12, "Coin"], [72, 84, "Coin"], [95, 101, "Coin"], [176, 184, "Coin"], [188, 193, "Coin"]]}
{"id": 4861, "text": "Bitcoin ‘ascendant’ as GameStop saga unfolds, Bitfinex CTO says The GameStop short squeeze and Bitcoin have a lot more in common than appears at the surface, according to Paolo Ardoino.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [23, 32, "Organization"], [46, 54, "Organization"], [95, 103, "Coin"], [68, 77, "Organization"]]}
{"id": 4862, "text": "Bitcoin prints biggest hourly candle in history after BTC rebounds strongly to $54K Fresh criticism from the U.S. treasury secretary fuels an already fierce correction, briefly taking Bitcoin to $47,400 lows.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [54, 57, "Coin"], [184, 192, "Coin"]]}
{"id": 4863, "text": "JPMorgan note to clients endorses 1% allocation to Bitcoin as a hedge Bitcoin would serve as a hedge against fluctuations in traditional assets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [51, 59, "Coin"], [70, 78, "Coin"]]}
{"id": 4864, "text": "Here's why altcoins are dropping as Bitcoin price inches closer to $50,000 The altcoin market crashed as Bitcoin achieved a new all-time high and made its way towards $50,000.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 44, "Coin"], [105, 113, "Coin"]]}
{"id": 4865, "text": "Institutions and miners accumulating through Bitcoin chop; whales uncertain Bitcoin in, and Bitcoin out: major players are deploying different strategies as BTC consolidates well under $58,400 highs.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[45, 53, "Coin"], [76, 84, "Coin"], [92, 100, "Coin"], [157, 161, "Coin"]]}
{"id": 4866, "text": "Crypto-friendly faces poised for positions in Biden administration The crypto industry appears to be abuzz with potential, given confirmed and possible appointments in the Biden administration.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4867, "text": "Tokenization of assets is not taking off, but it really should For years, tokenization has been hyped to be one of the most interesting use cases of blockchain, but it hasn’t gained its momentum yet.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4868, "text": "UK investment manager sells off half BTC holdings after $750M win \"The economic environment for Bitcoin right now could not be better,\" said Duncan MacInnes.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 41, "Coin"], [96, 104, "Coin"]]}
{"id": 4869, "text": "Genesis Mining head forecasts importance of layer-two Bitcoin solutions  He feels Bitcoin might need such solutions, even with the coin in a store of value role.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[54, 62, "Coin"], [0, 15, "Organization"], [82, 90, "Coin"]]}
{"id": 4870, "text": "WallStreetBets Coin becomes #1 on CoinMarketCap... kind of The new coin suddenly appeared at the top of CoinMarketCap's rankings, but is r/Wallstreetbets really coming to crypto?", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4871, "text": "India's central bank ‘very much in the game‘ with digital currency project The Reserve Bank of India is getting ready to launch its own central bank digital currency.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4872, "text": "DeFi exchange protocol DFX raises $5M in seed funding led by Polychain Capital Polychain Capital has bet on a new decentralized finance exchange protocol looking to boost the adoption of stablecoins in DeFi.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 27, "Coin"], [61, 78, "Organization"], [79, 96, "Organization"]]}
{"id": 4873, "text": "Guggenheim CIO expects Bitcoin to drop to $20,000  Guggenheim Partners’ Scott Minerd now expects Bitcoin to drop to $20,000 after predicting a $400,000 long-term price target a month ago.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[23, 31, "Coin"], [97, 105, "Coin"]]}
{"id": 4874, "text": "Private finance emerges as crypto’s next major growth catalyst GameStop saga catalyzes private finance to ascend rapidly, with on-chain privacy solutions and synthetic asset pools cropping up across the crypto space.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[63, 72, "Organization"]]}
{"id": 4875, "text": "Bitcoin price chart shows 'Elon Musk' pump was an outlier — So what happens now?  The price of Bitcoin has shown weakness after failing to clear $38,000", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [95, 103, "Coin"]]}
{"id": 4876, "text": "Dacxi joins self-regulating trade group CryptoUK as executive member The exchange will unite with Binance.UK, Coinbase, CryptoCompare, Ripple, eToro, and others in leading the association’s strategic direction.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[98, 105, "Organization"], [110, 118, "Organization"], [135, 141, "Organization"], [143, 148, "Organization"]]}
{"id": 4877, "text": "Tezos (XTZ), Synthetix (SNX) and Yearn.finance (YFI) lead the DeFi revival Tezos, Synthetix and Yearn.finance are the most recent top performers in what appears to be a DeFi sector revival.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [7, 10, "Coin"], [13, 23, "Coin"], [24, 27, "Coin"], [33, 46, "Coin"], [48, 51, "Coin"], [75, 80, "Coin"], [82, 92, "Coin"], [96, 109, "Coin"]]}
{"id": 4878, "text": "Japanese exchange Coincheck to list NFTs by Chiliz and Socios The Coincheck crypto exchange will list Chiliz and Socios' non-fungible tokens on its new NFT marketplace.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[62, 75, "Organization"], [18, 28, "Organization"]]}
{"id": 4879, "text": "UK firm launches service for company treasuries to invest in Bitcoin U.K.-based crypto firm BCB Group is looking to provide corporations with a way to put Bitcoin on their balance sheet by launching a dedicated treasury.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[61, 69, "Coin"], [92, 101, "Organization"], [155, 163, "Coin"]]}
{"id": 4880, "text": "Ether is flying to the moon? Here’s what’s fueling the ETH rocket DeFi, institutions and Eth2: What are all the factors fueling Ether’s current rally to its all-time highs?", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Coin"], [55, 59, "Coin"], [89, 93, "Coin"], [128, 136, "Coin"]]}
{"id": 4881, "text": "As DeFi booms, Ethereum’s blockchain competitors are catching up Decentralized finance participants eye a “multichain” future as Ethereum’s DeFi-powering peers continue to attract users and projects.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[15, 25, "Coin"], [129, 140, "Coin"]]}
{"id": 4882, "text": "Law Decoded: Bank payments going global with stablecoins and CBDCs, Jan. 15–22  Retail users may have to wait in much of the world, however.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4883, "text": "As Ether price breaks all-time high Buterin's ETH holdings up 8x in a year Ethereum co-founder Vitalik Buterin has seen the value of his personal ETH stash soar over 700% in a single year.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[3, 9, "Coin"], [46, 50, "Coin"], [75, 84, "Coin"], [146, 150, "Coin"]]}
{"id": 4884, "text": "Seven times that US regulators stepped into crypto in 2020 From capping off the era of ICOs to tightening regulations on private wallets, U.S. financial watchdogs waded deeper into the crypto land than ever in 2020.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4885, "text": "Asia accounts for almost half of global crypto trading: Messari report  Crypto activity in Asia is equivalent to that in the U.S. and Europe combined.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4886, "text": "DeFi giant Aave hits a new high at $520, TVL rises to $4.96 billion  AAVE price rallied to a new high at $520, pushing the DeFi protocol’s TVL to $4.96 billion.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 16, "Coin"], [41, 45, "Coin"], [69, 74, "Coin"], [139, 143, "Coin"]]}
{"id": 4887, "text": "Here’s why HedgeTrade (HEDG), The Graph (GRT) and UMA are rallying Strong use cases and future growth possibilities appear to be pushing the price of HedgeTrade, The Graph and UMA higher.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[11, 21, "Coin"], [23, 27, "Coin"], [30, 39, "Coin"], [41, 44, "Coin"], [50, 54, "Coin"], [150, 160, "Coin"], [162, 171, "Coin"], [176, 180, "Coin"]]}
{"id": 4888, "text": "DEX goals diverge as SushiSwap (SUSHI) and Uniswap (UNI) rally to new highs The goals and development of SushiSwap and Uniswap are diverging as each exchange’s governance token reaches new all-time highs.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 31, "Coin"], [32, 37, "Coin"], [43, 51, "Coin"], [52, 55, "Coin"], [105, 115, "Coin"], [119, 127, "Coin"]]}
{"id": 4889, "text": "While Washington dithers, Wyoming and other US states mine for crypto gold While Wyoming was luring crypto businesses, such as Ripple Labs, New York’s AG was bringing enforcement action against Bitfinex.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[127, 138, "Organization"], [194, 202, "Organization"]]}
{"id": 4890, "text": "Snoop Dogg and Gene Simmons join Elon Musk’s ‘Dogecoin army’  DOGE is rallying once again after Elon Musk, Snoop Dogg and Gene Simmons tweet Doge Army memes.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 55, "Coin"], [62, 67, "Coin"]]}
{"id": 4891, "text": "'I've taken a neutral view' on Bitcoin, says Bill Gates   \"Bitcoin can go up and down just based on the mania or whatever the views are,\" said the Microsoft co-founder.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[31, 38, "Coin"], [59, 67, "Coin"]]}
{"id": 4892, "text": "Glassnode predicts BTC break-out as investors refuse to realize losses  Despite on-chain metrics indicating Bitcoin investors will soon face losses, Glassnode believes BTC is ready to bounce.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[19, 23, "Coin"], [108, 116, "Coin"], [168, 172, "Coin"]]}
{"id": 4893, "text": "PayPal to offer crypto payments for merchants, limited trading on Venmo After their limited crypto trading service \"exceeded expectations,\" the company will double down on crypto, blockchain, and digital currencies in 2021", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[66, 72, "Organization"], [0, 7, "Organization"]]}
{"id": 4894, "text": "Bakkt has no plans to support XRP, says CEO Bakkt's CEO did not mention whether the company decided to stay away from XRP due to Ripple’s ongoing legal issues.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[30, 33, "Coin"], [129, 138, "Coin"], [118, 122, "Coin"]]}
{"id": 4895, "text": "MicroStrategy raising $600M…. no, $900M to buy more Bitcoin Should the purchase go as planned, the business intelligence firm will hold more than $3.5 billion in Bitcoin as a reserve asset.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 13, "Organization"], [52, 59, "Coin"], [162, 170, "Coin"]]}
{"id": 4896, "text": "Bitcoin subreddit hits 2M subscribers following GameStop controversy More than 200,000 Redditors joined the page last week.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [48, 56, "Organization"]]}
{"id": 4897, "text": "Avalanche (AVAX), Matic and Celo rally while Bitcoin price pulls back Ethereum network competitors like Avalanche, Matic and Celo are seeing substantial gains as high gas fees push users to search for cheaper alternatives.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Coin"], [11, 15, "Coin"], [45, 53, "Coin"], [18, 23, "Coin"], [28, 33, "Coin"], [70, 79, "Coin"], [104, 113, "Coin"], [115, 121, "Coin"], [125, 130, "Coin"]]}
{"id": 4898, "text": "3 reasons Bitcoin tumbled below $30,000 in a surprise overnight correction  Bitcoin's fall from from $37,000 to below $30,000 within 48 hours saw the biggest daily red candle ever.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 18, "Coin"], [76, 86, "Coin"]]}
{"id": 4899, "text": "Robinhood reportedly allowing instant deposits for crypto purchases again as DOGE surges The feature was originally suspended on Jan. 29.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"], [77, 82, "Coin"]]}
{"id": 4900, "text": "Bitcoin price must now hold above these levels to break $60K  It’s important for Bitcoin to hold above $50,000 for more upside.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [81, 88, "Coin"]]}
{"id": 4901, "text": "Reddit co-founder hoists the Bitcoin flag on Twitter amid price surge Alexis Ohanian is the latest social media and tech personality to update his Twitter bio to read “#Bitcoin.”", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [29, 37, "Coin"], [45, 53, "Organization"]]}
{"id": 4902, "text": "The institutionalization of BTC: Mining may be more profitable than buying Regardless of Bitcoin’s price or future economic scenarios, Bitcoin mining will be a profitable activity.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 31, "Coin"], [89, 99, "Coin"], [135, 142, "Coin"]]}
{"id": 4903, "text": "Dubai financial regulator working on regulations for cryptocurrencies The Dubai Financial Services Authority is reportedly looking to introduce two crypto-related consultation papers as part of its business plan in 2021.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4904, "text": "US Treasury Secretary Yellen says crypto misuse is a growing problem  The private sector invests enormous resources to help the government combat crypto crimes, U.S. Treasury Secretary Janet Yellen said.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4905, "text": "Long Blockchain Corp has officially been delisted by SEC  The beverage maker turned Bitcoin mining company has failed to file its financial reports with the SEC.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[84, 91, "Coin"]]}
{"id": 4906, "text": "Solana announces DeFi hackathon offering $200k in seed funding Solana will host a DeFi hackathon offering a $200,000 prize pool and $200,000 in seed funding to aspiring developers.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4907, "text": "Bullish or bearish? PayPal hosts $242M in crypto trading over 24 hours Daily crypto volume on payments giant PayPal have surged to record highs above $240 million.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[20, 27, "Organization"], [109, 116, "Organization"]]}
{"id": 4908, "text": "Major exchanges struggle as Bitcoin pumps on $1.5B Tesla investment As usual, when Bitcoin pumps and traders need stable exchanges more than ever, some are almost guaranteed to go down.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 36, "Coin"], [51, 57, "Organization"], [83, 91, "Coin"]]}
{"id": 4909, "text": "Bitcoin volatility lower than 2017 levels as price smashes $51K Bitcoin volatility is not at the same level seen during the 2017 bull run, but analysts still say lower price swings are necessary to maintain upward momentum.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [64, 71, "Coin"]]}
{"id": 4910, "text": "Hold your horses! $9K Bitcoin price drop not a trend change, data says Traders are freaking out about today’s 27% Bitcoin price drop but historical data show sharp corrections are natural even during bull markets.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[22, 29, "Coin"], [114, 122, "Coin"]]}
{"id": 4911, "text": "Bullish crypto events of 2020 that will drive historic adoption These are 2020’s most important events in crypto that will have a lasting effect on the adoption of blockchain and digital currencies.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4912, "text": "Following Brexit, the UK asks crypto industry about rules for cross-border stablecoins In addition to trying to define stablecoins, the U.K. is looking to establish how close it wants its crypto laws to be to other countries.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4913, "text": "Crypto investors should consider buying gold, Newcrest Mining CEO says Gold should help crypto investors hedge against the risks of highly unstable prices of cryptos like Bitcoin, the CEO of Newcrest Mining said.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 61, "Organization"], [191, 206, "Organization"]]}
{"id": 4914, "text": "This year will produce gains some might call 'shocking,' Diginex CEO says  With Bitcoin on a dramatic price run, 2021 could be an eventful year for the crypto industry.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[57, 65, "Organization"], [80, 88, "Coin"]]}
{"id": 4915, "text": "Polkadot skyrockets nearly 30% to $10 billion market cap: What’s behind the rally? The price of DOT, the native cryptocurrency of Polkadot, surged 24% on the day to achieve a $10 billion valuation.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Coin"], [130, 138, "Coin"]]}
{"id": 4916, "text": "Crypto leaders back MIT’s four-year initiative to harden Bitcoin’s security Crypto industry captains are throwing their support behind a long-term project from MIT’s Digital Currency Initiative to enhance Bitcoin’s security.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[57, 66, "Coin"], [205, 215, "Coin"]]}
{"id": 4917, "text": "Ether price finally beats its 2018 all-time high, surpassing $1,428 A three-year hodl for Ether investors finally comes good as the largest altcoin surges into unknown territory on Tuesday.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [90, 96, "Coin"]]}
{"id": 4918, "text": "Gas fee proposal could create ‘positive feedback loop’ for ETH price: Grayscale Grayscale believes EIP-1559, a proposal to burn Ethereum gas fees, could be extremely bullish for Ether’s price.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[59, 63, "Coin"], [70, 80, "Organization"], [80, 90, "Organization"], [128, 137, "Coin"], [178, 186, "Coin"]]}
{"id": 4919, "text": "Cointelegraph Consulting: Research outlines how DeFi can merge with traditional finance New research finds that regulated financial institutions can interface with decentralized finance via digital asset marketplaces.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"]]}
{"id": 4920, "text": "Here are the best and worst times of the day to use Ethereum Avoiding U.S. trading hours could save you a gwei or two.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[52, 61, "Coin"]]}
{"id": 4921, "text": "OLB Group enables crypto payments for thousands of US merchants  Small businesses can now accept cryptocurrency payments using OLB’s point-of-sale technology.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 4922, "text": "Bitcoin's Twitter-volume spikes to new all-time highs on Elon pump  Elon Musk has pushed Bitcoin’s social sentiment into new highs on Twitter.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Coin"], [89, 99, "Coin"], [134, 141, "Organization"], [10, 17, "Organization"]]}
{"id": 4923, "text": "DeFi lending and borrowing, explained As DeFi protocols continue to garner mainstream traction, here’s an introduction to how lending and borrowing work on these platforms.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4924, "text": "Moving beyond the crisis narrative: Crypto in a post-pandemic world Over the last decade, crypto has weathered what feels like crisis after crisis. It’s time to think about what comes next.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4925, "text": "FTX lists GameStop after Reddit-fueled 200% rally in two days Reddit’s r/Wallstreetbets is beating hedge funds at their own game.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[10, 19, "Organization"], [0, 4, "Organization"]]}
{"id": 4926, "text": "UK’s FCA crypto derivatives ban may push retail investors to riskier grounds  U.K.’s FCA banning retail investors from engaging with crypto derivatives takes away risk hedging opportunities.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4927, "text": "No, Goldman Sachs isn’t a bearish indicator for Bitcoin The Bitcoin market is a different beast compared to late 2017 when Goldman Sachs balked at launching its crypto trading desk.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 17, "Organization"], [48, 56, "Coin"], [60, 67, "Coin"], [123, 136, "Organization"]]}
{"id": 4928, "text": "Kraken users demand refunds over flash-crash liquidations Margin traders on Kraken are outraged after a flash-crash triggered wholesale liquidations while the exchange was inaccessible to users.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [76, 83, "Organization"]]}
{"id": 4929, "text": "Different kind of gas fees: Electrocoin enables crypto petrol payments in Croatia One Tifon executive thinks foreign tourists will likely contribute to the development and growth of crypto payments in the country.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 40, "Coin"]]}
{"id": 4930, "text": "Following V2 plans, Balancer raises $5 million from Three Arrows & DeFiance Two of the largest crypto funds join Pantera Capital and Alameda Research in contributing to Balancer's $12 million series A funding round", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[113, 128, "Organization"], [133, 149, "Organization"], [52, 64, "Organization"]]}
{"id": 4931, "text": "Experts: Gold outflows are pushing Bitcoin higher Gold's prospects seem to dim as Bitcoin's glitter", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 43, "Coin"], [82, 92, "Coin"]]}
{"id": 4932, "text": "XRP price gains 86% after r/Wallstreetbets’ crypto wing says 'pump it' XRP price rallied 86% as members of a Reddit-based investing group shifted their focus from Dogecoin.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Coin"], [71, 75, "Coin"], [163, 171, "Coin"]]}
{"id": 4933, "text": "Huobi Korea scores certification from Korea Internet and Security Agency The South Korean arm of global crypto giant Huobi has acquired an ISMS certification to comply with the upcoming Special Payment Act.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [117, 123, "Organization"]]}
{"id": 4934, "text": "Bitcoiner loses almost $100K of BTC in wallet transfer bungle The Redditor attempted to transfer a wallet to a new computer without confirming the password to the private keys was accessible.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 36, "Coin"]]}
{"id": 4935, "text": "Cointelegraph Consulting: Gauging the impact of ETH shortages on exchanges On-chain data shows that ETH is quickly vanishing from exchanges. Cointelegraph Consulting explores the causes and impact of this trend.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 52, "Coin"], [100, 104, "Coin"], [0, 24, "Organization"], [141, 165, "Organization"]]}
{"id": 4936, "text": "r/Wallstreetbets vs. Wall Street: A prelude to DeFi bursting onto the scene? Was stock trading app Robinhood the villain in the GameStop saga? “In a decentralized trading market, no one would have that power.”", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[99, 109, "Organization"], [128, 137, "Organization"]]}
{"id": 4937, "text": "Decentraland celebrates 1 year anniversary with virtual party  The virtual world is celebrating in style with “live” DJ sets and a new club reveal.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 4938, "text": "Bitcoin billionaire set to run for California governor  Early Bitcoin investor Chamath Palihapitiya is eying running for governor of California.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"], [62, 70, "Coin"]]}
{"id": 4939, "text": "NYDIG files for US-based Bitcoin ETF, with Morgan Stanley on board The crypto-focused financial services company has filed S-1 paperwork with the SEC, reigniting the debate over a Bitcoin ETF.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[180, 188, "Coin"], [25, 32, "Coin"]]}
{"id": 4940, "text": "Kenetic co-founder purchases .NFT domain extension for $84K \"The possibilities of the NFT domain are endless,\" said Jehan Chu.", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 4941, "text": "With Yellen confirmed, Treasury moves forward with stalled crypto monitoring rule The Treasury has opened up the comment period for its self-hosted wallet requirements for another 60 days.", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
