{"id": 5156, "text": "For all the promise that blockchain technology has shown to improve our lives and provide better ways of conducting services, some still doubt its efficacy.  […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5157, "text": "Trezor, a crypto hardware wallet maker, recently rubbished all claims that its devices suffered a data breach. The firm called it a hoax and said […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"]]}
{"id": 5159, "text": "For years, crypto enthusiasts have fought for continued adoption across the world. However, one of the primary hurdles for this to work has always been […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5161, "text": "The US Congress had seen a new bill introduced on Wednesday night. Should this bill be passed, a blanket regulation on all stablecoins operating in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5162, "text": "Nine lawmakers within the US House of Representatives have teamed up to seek clarity regarding regulations over the custody of digital currencies for broker-dealers, asking […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[26, 28, "Organization"]]}
{"id": 5163, "text": "Japan has been raising a lot of red flags over China and the country’s planned release of a state-backed digital currency. In the face of […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5167, "text": "Black Manta Capital Partners is teaming up with Finoa, “the world’s first fully digital (warm-storage) custody and asset-servicing solution built on a crypto-native banking infrastructure” to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 28, "Organization"], [48, 53, "Organization"]]}
{"id": 5170, "text": "Chainalysis, a platform that offers “cryptocurrency investigation and compliance solutions” to regulators and government agencies, has just announced investigation and compliance support for Dash and […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [191, 195, "Coin"]]}
{"id": 5171, "text": "Grayscale’s Ethereum Investment Trust (ETHE) has had its share crash, going down 50% in value in just over four days within the secondary OTC markets. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[39, 43, "Organization"], [0, 37, "Organization"]]}
{"id": 5172, "text": "The United Kingdom is one of the top tech hotspots in the world. However, the country is gradually becoming a crypto haven. Earlier this month, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5178, "text": "Binance is the world’s largest cryptocurrency exchange, managing billions of dollars in daily trading volumes. However, the exchange has also not been afraid to cut […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 5181, "text": "ICONLOOP, “Korea’s leading enterprise blockchain technology company,” is working on a mobile driver’s license built on blockchain technology, according to a press release from the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5186, "text": "LINE, Japan’s messaging giant, announced that it is closing its crypto exchange in Singapore and is re-launching it as a worldwide renewed portal in the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"]]}
{"id": 5188, "text": "Bitcoin prices are crashing and creating a panic in the market. On Friday, the price of one Bitcoin reached $4,900, creating a new bottom this […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[92, 99, "Coin"], [0, 7, "Coin"]]}
{"id": 5189, "text": "Crypto derivatives platform Delta Exchange announced interest-bearing accounts for its customers on Wednesday. The accounts will bring up to 10% interest for the customers on […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[28, 42, "Organization"]]}
{"id": 5190, "text": "As the Reserve Bank of India (RBI) was forced to repeal the crypto ban that it had enacted, a boom of new cryptocurrency exchanges had […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 28, "Organization"], [30, 33, "Organization"]]}
{"id": 5193, "text": "The New York Supreme Court recently rejected Bitfinex and its sister company Tether’s appeal in an ongoing dispute with the New York Attorney General. The […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[45, 53, "Organization"], [77, 85, "Organization"]]}
{"id": 5194, "text": "The sentiment of professional traders within the Bitcoin (BTC) market isn’t easy to read, with only a few indicators capable of accurately gauging it. Analysts […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[49, 56, "Coin"], [58, 61, "Coin"]]}
{"id": 5196, "text": "LedgerX stands as a regulated US-based crypto derivatives exchange and clearinghouse. While many players within the traditional finance industry have opted to move into the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5200, "text": "Tax authorities in New Zealand have seemingly received the approval to start collecting information related to traders from cryptocurrency exchanges. The office wants to ensure […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5201, "text": "Jay Hao stands as the CEO of OKEx, and has recently announced that the exchange is gearing towards increasing the security of its various fund […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 33, "Organization"]]}
{"id": 5202, "text": "Huobi Group, a “leading global digital asset financial service provider,” has just announced Star Atlas, an analytics tool for on-chain analysis the group is launching. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"]]}
{"id": 5203, "text": "Huobi Group, a blockchain-focused company, has announced what it is calling Huobi DeFi Labs, according to a press release. “Huobi DeFi Labs is the platform […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [76, 81, "Organization"], [124, 129, "Organization"]]}
{"id": 5204, "text": "Huobi Global, a self-described “world-leading company in blockchain industry with a mission to making breakthroughs in core blockchain technology and the integration of blockchain technology […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 12, "Organization"]]}
{"id": 5207, "text": "The DeFi space is a very competitive one, indeed, with more protocols entering the arena than there are leaving. As one would imagine, the space […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5211, "text": "Coinbase, one of the world’s heavyweight cryptocurrency exchanges, has recently invested 1.1 million in USDC to the decentralized finance protocols of PoolTogether and Uniswap. Pushing […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[104, 108, "Coin"], [0, 8, "Organization"]]}
{"id": 5212, "text": "Share buybacks have been prevalent throughout these past two decades, with corporations across the globe buying their own stocks in record amounts. However, this isn’t […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5215, "text": "Bitcoin traders are in a constant struggle to analyze the possibility of BTC breaking out and maintaining the $12,000 level. However, another cryptocurrency going by […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"], [73, 76, "Coin"]]}
{"id": 5217, "text": "Transaction fees on the Ethereum network recently reached a new all-time high of $23 on average. This rise helped miners earn over $22.75 million in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 32, "Coin"]]}
{"id": 5218, "text": "LoanScan suggests that around $89 million was liquidated on the crypto lending platform Compound in the past 24 hours after the price of DAI was […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [88, 96, "Coin"], [137, 140, "Coin"]]}
{"id": 5221, "text": "In September, the liquidator of the defunct cryptocurrency exchange Grant Thompson said users who have their funds in the crypto exchange will be allowed to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[68, 82, "Organization"]]}
{"id": 5222, "text": "Six more members have been added into the Liquid Federation, the group in control and governing of the Liquid sidechain, which itself is a network […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[42, 59, "Organization"], [103, 109, "Organization"]]}
{"id": 5224, "text": "Dragon Payments Ltd., a British cryptocurrency exchange, is getting ready to call it quits as it has now been forced into compulsory liquidation.  According to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 20, "Organization"]]}
{"id": 5228, "text": "Kelly Loeffler, the Republican Senator from the state of Georgia, has reached a compromise on the improper trading charge leveled against her. In a tweet […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5219, "text": "Bitmain, the largest manufacturer of mining equipment in the crypto industry, is gearing up to face its future without longtime chief executive Jihan Wu. However, the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5220, "text": "The liquidated amount on leverage trading platform BitMEX has been significant over the last 30 days. Data gathered by InsideBitcoin.com shows that at least $826 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 57, "Organization"], [119, 132, "Organization"]]}
{"id": 5223, "text": "Turkey is gearing up to host the first large scale, the international crypto event of 2020, seeking to make its reputation as a blockchain pioneer […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5225, "text": "Skew, a data analytics provider that provides information regarding cryptocurrency exchanges, stated that around $190 million sell and $6.1 million buy liquidations have occurred in Bitcoin. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"], [182, 189, "Coin"]]}
{"id": 5226, "text": "The Tezos Foundation, one of the most reputable crypto firms in the world, has reduced the percentage of its Bitcoin portfolio. According to the firm’s biannual report that […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 20, "Organization"], [109, 116, "Coin"]]}
{"id": 5227, "text": "Fidelity Digital Assets has now signed itself up as one of ErisX’s clearinghouse members. This comes in a bid to leverage the central limit of […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 23, "Organization"], [59, 64, "Organization"]]}
{"id": 5229, "text": "The liquidated amount on leverage trading platform BitMEX has been significant over the last 30 days. Data gathered by InsideBitcoin.com shows that at least $826 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 57, "Organization"], [119, 132, "Organization"]]}
{"id": 5230, "text": "With the massive price dip that Bitcoin (BTC) has seen on Thursday, a cascade of forced liquidations on derivative exchanges, such as Bitfinex and BitMEX. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 39, "Coin"], [41, 44, "Coin"], [134, 142, "Coin"], [147, 153, "Coin"]]}
{"id": 5231, "text": "Crypto wallet and blockchain security firm BitGo recently announced that it is supporting INX Limited, a Gibraltar-based crypto company operating the first security token IPO […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[90, 101, "Organization"], [43, 48, "Organization"]]}
{"id": 5232, "text": "Chinese cryptocurrency exchange OKEx is planning to restart withdrawals in Bitcoin. The firm stopped withdrawals in October after its founder was taken into custody by […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 36, "Organization"]]}
{"id": 5233, "text": "The team behind Dash has made a recent announcement. This announcement pertained to their tokens being entered into the vibrant DeFi ecosystem of Ethereum. The […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[146, 154, "Coin"], [16, 20, "Coin"]]}
{"id": 5234, "text": "It takes only a few minutes of investigation to show that one of the biggest selling points for the Ethereum ecosystem is the decentralized finance […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[100, 108, "Coin"]]}
{"id": 5235, "text": "dForce, the decentralized finance (DeFi) services provider, has reportedly refunded all user funds after completing the recovery process from a previous hack.  Earlier this week, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"]]}
{"id": 5236, "text": "The Balancer pool, one of the newest and most exciting decentralized finance (DeFi) pools, witnessed a security breach over the weekend. According to a company […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Organization"]]}
{"id": 5237, "text": "The Graph stands as an indexing protocol that allows its developers to use a scalable method in the access of data, focused on Web 3.0 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5238, "text": "Uniswap, one of the most popular decentralized exchanges (DEXs), issued out a campaign where it airdropped UNI tokens to past Uniswap users, doing so in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [107, 110, "Coin"], [126, 133, "Organization"]]}
{"id": 5239, "text": "Crypto exchange service provider, CoinEx, has been listed on the OneSwap’s ONES token, making it the first cryptocurrency exchange to have been listed on the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 40, "Organization"], [75, 79, "Coin"], [65, 74, "Organization"]]}
{"id": 5240, "text": "Yam stands as the very first Decentralized Finance (DeFi) clone protocol that was themed on food. In its move, the protocol had managed to successfully […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5241, "text": "The decentralized finance (DeFi) space has grown significantly in the past year, moving from a billion-dollar market to almost $10 billion in assets locked in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5242, "text": "The 28th of August, 2020 saw Binance Futures launch its DeFi Composite Index. This Index stands as a basket of DeFi tokens that had originally […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 44, "Organization"]]}
{"id": 5243, "text": "Andre Cronje stands as the creator of Yearn Finance, and has recently, and stealthily, published his third protocol on GitHub since August. This latest protocol, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[38, 51, "Organization"]]}
{"id": 5244, "text": "CER Live, a crypto exchange ranking platform, has recently given out a report. This report indicated that of the top 25 decentralized exchanges (DEXs), 14 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5245, "text": "Bitcoin, the world’s biggest cryptocurrency, has started to see the correction after it managed to reach the highest price in two years. As is typical, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 5246, "text": "Stolen funds from this year’s infamous hack of the KuCoin exchange were found to be on the move. Recently, $3.5 million of the hacked funds […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[51, 66, "Organization"]]}
{"id": 5247, "text": "The DeFi ecosystem has always been plagued by exploits and hacks. With the sheer amount of money flowing through that space at this time, it’s […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5248, "text": "When a coin outperforms strongly in a red day(s) for markets, it is time to sit up and take notice – Elrond (EGLD) is just […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[101, 107, "Coin"], [109, 113, "Coin"]]}
{"id": 5249, "text": "The DeFi space is a very competitive one, indeed, with more protocols entering the arena than there are leaving. As one would imagine, the space […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5250, "text": "Binance Smart Chain, the DeFi network for Binance, managed to surpass Ethereum in terms of throughput. This comes primarily thanks to the cripplingly high gas […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 19, "Organization"], [42, 49, "Coin"], [70, 78, "Coin"]]}
{"id": 5251, "text": "The r/SatoshiStreetbets stands as the crypto equivalent of the now-famous r/WallStreetBets. Now, however, it seems to want to take that extra step only a crypto […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5252, "text": "Uniswap stands as the first-ever decentralized exchange (DEX) that has managed to achieve $1 billion in 24-hour trade volume. This comes due to a dramatic […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 5253, "text": "Less than two days after its launch, the Uniswaps’ trading volume has already exceeded the trading volume of many cryptocurrencies on crypto exchanges, with only […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[41, 49, "Coin"]]}
{"id": 5254, "text": "Matic, a blockchain scalability solution, is laying down some hefty claims. According to Matic, its network has the potential of supercharging the Ethereum ecosystem. These […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [89, 94, "Organization"]]}
{"id": 5255, "text": "OpenSea has revealed that Binance’s non-fungible tokens recorded very impressive trades and accounted for a sizable chunk of the OpenSea portal during its January activity. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [26, 35, "Coin"], [129, 136, "Organization"]]}
{"id": 5256, "text": "Decentralized Finance (DeFi) insurer Covered Protocol suffered a minting attack earlier on Monday, which saw its price dropping by 97% shortly after the attack. However, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[37, 53, "Organization"]]}
{"id": 5257, "text": "An anonymous user recently hacked into the Twitter accounts of cryptocurrency exchange Binance and its CEO Changpeng Zhao. The hack has rattled the crypto community […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[87, 94, "Organization"]]}
{"id": 5155, "text": "Judge Alvin Hellerstein of a federal district court in the United States (US), has struck out a securities fraud class action against Bancor, an Israel-based […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[134, 140, "Coin"]]}
{"id": 5158, "text": "In the class-action lawsuit against MakerDAO, accusing the group of misrepresenting the risks that were associated with its DAI stablecoin, a small lull occurred. This […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[36, 44, "Organization"], [124, 127, "Coin"]]}
{"id": 5160, "text": "Japan’s top policymakers appear to be disillusioned with the prospect of China running away as the world’s sole power when it comes to CBDC development. This […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5164, "text": "XRP Price Prediction – February 16 Ripple technical levels flash negative signals following rejection at $0.33. The Rising wedge pattern suggests that a dive to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[35, 41, "Organization"]]}
{"id": 5165, "text": "Censorship has always been one of the biggest problems, and circumventing; it has been one of Bitcoin’s most significant alluring properties. The latest in such occurrences […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[94, 103, "Coin"]]}
{"id": 5166, "text": "Criptolago, a cryptocurrency exchange in Venezuela, will now allow for citizens to pay for transactions in Petro via a text message. Petro, of course, is […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"]]}
{"id": 5168, "text": "Today, Reddit announced that it had launched the Ethereum-based token program that it had previously hinted at, and was highly anticipated within the social platform’s […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[7, 13, "Organization"], [49, 57, "Coin"]]}
{"id": 5169, "text": "With the blockchain and crypto spaces growing significantly, professional auditors have begun to tout their roles in stabilizing the industries. In an interview with industry […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5173, "text": "Currency.com recently announced that it has been awarded a bespoke license for blockchain firms in Gibraltar. The Belarus- based company claims to have a $20 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5174, "text": "Alpha Sigma Capital (ASC), an “investment fund focused on blockchain companies that have successfully built a user base, demonstrating real-world uses for their decentralized ecosystems,” […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[21, 24, "Organization"], [0, 19, "Organization"]]}
{"id": 5175, "text": "The XinFin Network, a self-described “global open source Hybrid Blockchain protocol/platform with independent community contributors,” has seen a significant influx of user activity in the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 18, "Organization"]]}
{"id": 5176, "text": "Compliance with security and data regulations has always been a significant issue for cryptocurrency projects, especially as regulators appear to be taking a hard-line approach […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5177, "text": "Aspire Technology, “the developer of digital asset creation technologies,” has revealed that its ASP and GASP tokens are now available on the HitBTC cryptocurrency exchange, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 17, "Organization"], [142, 148, "Organization"], [97, 100, "Coin"], [105, 109, "Coin"]]}
{"id": 5179, "text": "Bitcoin, the world’s biggest cryptocurrency, has started to see the correction after it managed to reach the highest price in two years. As is typical, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Coin"]]}
{"id": 5180, "text": "Hong Kong has maintained a friendly relationship with cryptocurrency companies setting up in its region so far. However, this cordial relationship appears to be nearing […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5182, "text": "Mark Cuban, the billionaire investor and owner of the Dallas Mavericks, has had quite a lot to say about cryptocurrencies in the past few weeks. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5183, "text": "Hugo Sergio Mejia stands as a peer-to-peer crypto trader that has gotten into a fair amount of trouble. The 49-year-old has recently pleaded guilty on […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5184, "text": "California’s Public Employees’ Retirement System (CalPERS) now owns over 100,000 shares in bitcoin mining firm RIOT Blockchain following further stake made during Bitcoin’s late rally […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[111, 126, "Organization"], [50, 57, "Organization"], [0, 48, "Organization"]]}
{"id": 5185, "text": "It was back in April of 2020. The COVID-19 pandemic was in full swing, and the world’s economy and crypto space were monumentally crippled. The […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5187, "text": "OKCoin made an announcement regarding its senior management. Hong Fang, having served as the company’s Chief Operating Officer (COO), will replace Tim Byon as the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"]]}
{"id": 5191, "text": "The interest rate swap market, which is a $341 trillion industry, was bound to make an entry into the crypto sector as well. Delta Exchange […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[125, 139, "Organization"]]}
{"id": 5192, "text": "Huobi, one of the world’s biggest crypto exchanges, has recently integrated its price data with the Chainlink ecosystem. This was done in an effort to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [100, 109, "Coin"]]}
{"id": 5195, "text": "Alt season has come once more, though this time, it isn’t as prolific as it once was. CEX.IO has recently started to report a spike […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[86, 92, "Organization"]]}
{"id": 5197, "text": "Cryptocurrency markets remained turbulent throughout August. The smaller altcoins witnessed growing volatility while Bitcoin maintained a steady streak between $11,000 and $12,000. The growth of […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[117, 124, "Coin"]]}
{"id": 5198, "text": "Billions of USD has been poured into hundreds of so-called decentralized finance (DeFi) apps by various investors. These apps allow users to borrow, lend, and […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5199, "text": "Eterbase stands as a crypto exchange based in Slovakia and is the latest victim of a hacker group. The exchange lost $5.4 million in cryptocurrencies, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5205, "text": "Retail investing is alive and growing, despite several large investment firms ignoring it in favour of the big-ticket items. However, a recent research report has […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5206, "text": "Tether has slowly, but surely, worked its way to becoming the third-largest cryptocurrency the world has to offer. This would mean surpassing Ripple’s XRP, but […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Coin"], [142, 150, "Organization"], [151, 154, "Coin"]]}
{"id": 5208, "text": "CoinShares, a platform that offers “digital investment strategies” for traders, is launching what it calls the CoinShares Gold and Cryptoassets Index. This is a platform […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"]]}
{"id": 5209, "text": "WordPress sites are embracing the crypto age, and it appears that it’s getting more lucrative for them as well. Months after launching a WordPress plug-in to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5210, "text": "Bitwise Asset Management stands as one of the leading crypto fund managers out there. The firm has announced recently that its 10 Crypto Index Fund […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 24, "Organization"]]}
{"id": 5213, "text": "Coin Metrics, one of the top data and analytics platforms in the crypto space, has recently rebuffed one of the industry’s fables. Earlier this week, the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 12, "Organization"]]}
{"id": 5214, "text": "Opyn stands as a protocol that offers options for DeFi Tokens, Ether (ETH) as well as an insurance service regarding Compound deposits. However, the Opyn […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[63, 68, "Coin"]]}
{"id": 5216, "text": "Solidus Technologies, a “UK-based technology company with a core focus on Blockchain Technology and Artificial Intelligence,” has just scored a €100m contract and partnership with […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 20, "Organization"]]}
{"id": 5258, "text": "Seems AWS is having some issues, and those issues are stretching out to crypto exchanges. An outage on Amazon’s AWS services has resulted in numerous […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[103, 111, "Organization"]]}
{"id": 5259, "text": "KuCoin, a “global cryptocurrency exchange for numerous digital assets and cryptocurrencies,” has announced it will allow users to buy Bitcoin with PayPal on the platform […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [134, 141, "Coin"]]}
{"id": 5260, "text": "The Balancer pool, one of the newest and most exciting decentralized finance (DeFi) pools, witnessed a security breach over the weekend. According to a company […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Organization"]]}
{"id": 5261, "text": "According to reports, hackers recently attacked the Ethereum network as they tried to exploit parity nodes. There were reports that some Parity Ethereum nodes could […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[52, 60, "Coin"], [144, 152, "Coin"]]}
{"id": 5262, "text": "One of the top cryptocurrency exchanges of the world, Bitfinex, had recently added yet another offering on its expanding list: Margin trading support for the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5264, "text": "KuCoin, one of the more significant crypto exchanges out there, has recently revealed that it had made dealings with Poloniex, another crypto exchange. This comes […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [117, 125, "Organization"]]}
{"id": 5265, "text": "Santiment, a crypto data provider, has recently revealed the top DeFi platforms in July, if one looks at the development activity in particular. This list […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"]]}
{"id": 5266, "text": "Aave stands as having made a very important step as a decentralized finance (DeFi) project: it has officially transferred governance rights over to its token […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Coin"]]}
{"id": 5267, "text": "The cryptocurrency industry has been affected by a series of hacks this past year. In most of the attacks, the victimized company usually engages professional […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5269, "text": "Regulators across the world have put pressure on crypto exchanges to adopt know your customer (KYC) protocols for wallet holders on these exchanges. Banks and […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5270, "text": "Bitfinex announced the summary removal of 87 trading pairs from its platform. These pairs will be removed completely, with the changes itself coming into effect […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5271, "text": "With Bitcoin seeing a downright miraculous rally up to $40,000 apiece, it’s no surprise that the asset has started to smash through its all-time high […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[5, 12, "Coin"]]}
{"id": 5275, "text": "It was in 2008 when the enigmatic Satoshi Nakamoto published an online paper, outlining the vision for Bitcoin as a whole. The concept was bold, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[103, 110, "Coin"]]}
{"id": 5277, "text": "The Brave browser is set to cap off an incredible year. However, the service could also have to disappoint several of its users following a […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 9, "Organization"]]}
{"id": 5279, "text": "Ledger, one of the world’s leaders in hardware wallet production, will now make it possible for its online customers to issue out payments through the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"]]}
{"id": 5280, "text": "Non-fungible tokens will have a new place to live thanks to the launch of Nifty Gateway 2.0. Nifty, for those who may not know, is […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[93, 98, "Organization"]]}
{"id": 5281, "text": "XRP has been making some progress in boosting the amount of exchange that lists the Ripples-owned coin. Quite recently, the currency has started to be […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Coin"], [84, 91, "Organization"]]}
{"id": 5284, "text": "Around 10.6% of all the circulating supply of Bitcoin is, as it stands now, held by only five centralized exchanges. This comes according to Chain.Info, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[46, 53, "Coin"]]}
{"id": 5285, "text": "As the crypto space at large is trying to break out of its bear market, lasting almost three years, overall, crypto attacks and scams are […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5287, "text": "It’s been two years since the CryptoKitties game “broke” the Ethereum network it initially launched in, but now it seems to be doing the same […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[61, 69, "Coin"]]}
{"id": 5290, "text": "TokenAnalyst, a crypto intelligence firm, has officially shut its doors. The company made the announcement on Tuesday via a medium post, stating that it will […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 12, "Organization"]]}
{"id": 5292, "text": "The Graph stands as an indexing protocol that allows its developers to use a scalable method in the access of data, focused on Web 3.0 […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5294, "text": "Regulatory approval appears to be a limiting factor for Coinbase, one of the world’s top cryptocurrency exchanges. In a recent appearance, the exchange’s chief executive, Brian […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[56, 64, "Organization"]]}
{"id": 5295, "text": "Coinbase stands as one of the giants within the crypto exchange space, and it seems that it will now start venturing within the crypto lending […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5300, "text": "As the crypto market is hotly anticipating the largest US cryptocurrency exchange Coinbase to go public, the company will also launch a secondary market along. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[82, 90, "Organization"]]}
{"id": 5301, "text": "Eterna, a blockchain investment company, has partnered up with the venture capital fund, Borderless Capital. Together, they launched the Eterna Borderless Venture Studio, dedicated to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [89, 107, "Organization"]]}
{"id": 5305, "text": "As it stands now, Singapore is one of the new frontiers of the crypto industry. The country has recently opened its doors to the crypto […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5307, "text": "Christine Coley, the chief executive of Binance.US, has explained that the coronavirus outbreak could have helped the company’s Asian business. In an interview with Bloomberg on March […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[165, 174, "Organization"], [40, 47, "Organization"]]}
{"id": 5313, "text": "Binance, the world’s largest cryptocurrency exchange, has announced support for a new asset that is backed 1:1 with the Ontology cryptocurrency. This asset, called ONT-33D, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [120, 128, "Coin"]]}
{"id": 5315, "text": "It seems that almost every week, Binance is pushing and expanding into some new field, technology, company, or country. Its most recent such venture is […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[33, 40, "Organization"]]}
{"id": 5316, "text": "Binance, the world’s largest cryptocurrency exchange in terms of trading volume, has added Bitcoin/USD Quarterly Futures which house leverage up to 125x, according to a […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5317, "text": "Binance has recently allowed its clients to leverage a new crypto derivative product. One of the biggest cryptocurrency exchanges has recently launched its iteration of […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5318, "text": "One of the biggest crypto exchanges the world has to offer, Binance, has now officially listed the Synthetix (SNX) token on its exchange platform. This […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[60, 67, "Organization"], [99, 108, "Coin"], [110, 113, "Coin"]]}
{"id": 5320, "text": "Binance, one of the largest crypto exchanges the world has to offer, has recently announced the launch of “Build for Bharat.” This stands as a […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5321, "text": "Binance, one of the world’s largest cryptocurrency exchanges, has come under fire again for an alleged role in facilitating money laundering. Earlier this week, Japanese exchange […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5263, "text": "Bitfinex, a prominent crypto exchange, has renewed its push to try and locate, then possibly recover, over $800 million in user funds. These funds were […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5268, "text": "The 28th of August, 2020 saw Binance Futures launch its DeFi Composite Index. This Index stands as a basket of DeFi tokens that had originally […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[29, 44, "Organization"]]}
{"id": 5272, "text": "FTX, Binance US, as well as OKCoin, have been rated the least expensive spot crypto exchanges within use. This comes from research that was conducted […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Organization"], [5, 15, "Organization"], [28, 34, "Organization"]]}
{"id": 5273, "text": "Glassnode, a crypto data provider, has recently revealed that the Bitcoin (BTC) reserves on crypto exchanges have recently fallen to a 12-month low. This runs […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [66, 73, "Coin"], [75, 78, "Coin"]]}
{"id": 5274, "text": "The United States Marshals Service (USMS) is on the hunt for a custody partner as it continues to take down cryptocurrency criminals across the country. Yesterday, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 34, "Organization"], [36, 40, "Organization"]]}
{"id": 5276, "text": "Xfers has made an announcement recently, one regarding the release of its new stablecoin: The XSGD. This comes after the company had received an e-money […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 5, "Organization"], [94, 98, "Coin"]]}
{"id": 5278, "text": "A massive rally pushed the second-largest cryptocurrency, Ethereum, to an all-time high of $1,470 today. However, at the same time, a large number of transactions […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[58, 66, "Coin"]]}
{"id": 5282, "text": "New York appears to be reconsidering its approach to regulation for crypto firms as its Virtual Currency License continues to be a brick wall guarding […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[88, 112, "Organization"]]}
{"id": 5283, "text": "KuCoin, one of the more significant crypto exchanges out there, has recently revealed that it had made dealings with Poloniex, another crypto exchange. This comes […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [117, 125, "Organization"]]}
{"id": 5286, "text": "Dogecoin, the dog-themed cryptocurrency, has witnessed an astronomical rise in the past few days, promoting industry insiders’ attention. However, celebrities and crypto newbies are also […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Coin"]]}
{"id": 5288, "text": "Binance is already the largest cryptocurrency exchange in the world. However, the firm also appears to be making a bit of a splash in mining […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5289, "text": "One of the biggest crypto exchanges on US soil, Coinbase, has recently tested the Clearview AI facial recognition technology. According to news reports done by […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 56, "Organization"]]}
{"id": 5291, "text": "Coinbase, the United States based cryptocurrency exchange, has acquired Tagomi, a cryptocurrency brokerage platform also based in the US, according to Crowdfund Insider. The goal, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"], [72, 78, "Organization"], [151, 168, "Organization"]]}
{"id": 5293, "text": "Coinbase stands as one of the largest crypto exchanges the world has to offer, with the exchange itself based in the US. Now, however, it […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5296, "text": "Coinbase caused a bit of a stir last month after the firm announced a policy restricting employees from airing their political beliefs. Since the policy […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5297, "text": "Coinbase, of the largest crypto exchanges out there, has started to make an aggressive hiring campaign in Japan. This comes several years after the exchange […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5298, "text": "Ripple Labs has faced significant setbacks since the Securities and Exchange Commission (SEC) filed a lawsuit against it last week. Now, it appears poised to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 11, "Organization"], [53, 87, "Organization"], [89, 92, "Organization"]]}
{"id": 5299, "text": "The Bitcoin price has continued to push even further after breaking the previous all-time high it reached in 2018. Now, it has hit another all-time […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 11, "Coin"]]}
{"id": 5302, "text": "Xangle Research has recently given out a report. This report showed that the Japanese financial watchdog, the Financial Services Agency (FSA), is more inclined to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 15, "Organization"], [110, 135, "Organization"], [137, 140, "Organization"]]}
{"id": 5303, "text": "BitMEX, is one of the most popular cryptocurrency exchanges but it seems to have had a bit of a rough streak in July. BitMEX is one […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [118, 124, "Organization"]]}
{"id": 5304, "text": "South Korea has been a relatively crypto-friendly state, with businesses thriving in the country amid a set of progressive laws. However, the country’s banking sector is […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5306, "text": "The Binance crypto exchange has made an announcement today. As of now, it holds one of the first referral/affiliate programs within the crypto exchange market, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 11, "Organization"]]}
{"id": 5308, "text": "Cryptocurrency exchange Binance is busy expanding its range of services. It recently launched Binance Loans and is now offering interest discount to early borrowers. Binance […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[24, 31, "Organization"], [166, 173, "Organization"]]}
{"id": 5309, "text": "Binance is continuing to increase its empire and suite of businesses. Its latest acquisition is that of market index aggregator Coinmarketcap. According to an official blog […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [128, 141, "Organization"]]}
{"id": 5310, "text": "Crypto exchange giant Binance recently acquired CoinMarketCap, which is a move that shocked the crypto community. Before this acquisition, CoinMarketCap claimed the real adjusted trading […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[48, 61, "Organization"], [139, 152, "Organization"], [22, 29, "Organization"]]}
{"id": 5311, "text": "Binance, the world’s largest cryptocurrency exchange, has added support for a few more countries to buy Bitcoin with a debit card. More specifically, the exchange […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[104, 111, "Coin"], [0, 7, "Organization"]]}
{"id": 5312, "text": "Binance, one of the biggest cryptocurrency exchanges the world has to offer, has recently recorded one of the highest quarterly volumes the exchange has seen. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5314, "text": "Binance, the world’s largest cryptocurrency exchange, is partnering with BitPay, the “world’s largest provider of blockchain payment services, to push BUSD to more customers. BUSD […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[73, 79, "Organization"], [151, 155, "Coin"], [0, 7, "Organization"], [175, 179, "Coin"]]}
{"id": 5319, "text": "Binance US CEO Catherine Coley said during her recent appearance in a podcast that banks holding digital assets provide validity to the industry. People will […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 10, "Organization"]]}
{"id": 5322, "text": "Binance, the world’s largest crypto exchange, is making changes to its futures structures as the company recovers from internal sabotage. Yesterday, the exchange’s Vice President […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"]]}
{"id": 5323, "text": "Binance, a major global crypto exchange, has recently made its services available to residents of North Carolina, doing so through its US arm: Binance US. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 7, "Organization"], [143, 153, "Organization"]]}
{"id": 5324, "text": "Asset storage has always been a prominent issue in the cryptocurrency space. With the industry gaining more mainstream attention, it is worth understanding what drives […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5329, "text": "Jesse Powell stands as the CEO of Kraken, and it seems that he’s extremely bullish for Bitcoin. It’s Powell’s opinion that Bitcoin will soon breach […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[34, 40, "Organization"], [87, 94, "Coin"], [123, 130, "Coin"]]}
{"id": 5335, "text": "The 3rd of April, 2020, marked the end of a nine-month probationary period that the Malaysia based crypto trading firm, Tokenize Malaysia, had gone through. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[120, 137, "Organization"]]}
{"id": 5337, "text": "Marcus Swanepoel, the chief executive of cryptocurrency exchanges Luno, has revealed that speculation and investments are the two biggest drivers of customers to his platform. […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[66, 70, "Organization"]]}
{"id": 5325, "text": "Cryptocurrencies are seeing a massive sell-off after Bitcoin (BTC) and Ethereum (ETH) hit all-time highs last week. But Binance (BNB) has seen a surge in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[129, 132, "Coin"], [53, 60, "Coin"], [62, 65, "Coin"], [71, 79, "Coin"], [81, 84, "Coin"], [120, 127, "Coin"]]}
{"id": 5326, "text": "China’s dominance on the global blockchain and mining space isn’t news. For a country that has shown to be anti-crypto, China sure does have a […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5327, "text": "Decentralized applications (dApps) are apps built on blockchain-based platforms such as Ethereum. While some of these are of the finance variety or in other industries, […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[88, 96, "Coin"]]}
{"id": 5328, "text": "The United Kingdom Financial Conduct Authority (FCA) has clarified a regulatory mishap that concerned cryptocurrency exchange Kraken, after it seemed to have confused the firm […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[126, 132, "Organization"], [4, 46, "Organization"], [48, 51, "Organization"]]}
{"id": 5330, "text": "Bitcoin’s performance has become a source of interest, particularly following a bullish run maintained for the past few weeks. However, Kraken, one of the industry’s top […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Coin"], [136, 142, "Organization"]]}
{"id": 5331, "text": "The rise in Bitcoin’s price has left many scrambling for a reason, especially with institutional demand being perceived as the biggest driver of the current […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[12, 21, "Coin"]]}
{"id": 5332, "text": "Kraken stands as a US-based crypto exchange, and boasts of being one of the first exchanges out there. According to a new report, Bitcoin’s overall […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 6, "Organization"], [130, 139, "Coin"]]}
{"id": 5333, "text": "Siam Commercial Bank, one of Thailand’s top banks, has announced a new investment venture that will see it become part of the growing decentralized finance […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 20, "Organization"]]}
{"id": 5334, "text": "XRP has been making some progress in boosting the amount of exchange that lists the Ripples-owned coin. Quite recently, the currency has started to be […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 3, "Coin"], [84, 91, "Organization"]]}
{"id": 5336, "text": "Grayscale stands as a major crypto asset management firm owned by the Digital Currency Group (DCG). As it stands now, the firm is making plans […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 9, "Organization"], [70, 92, "Organization"], [94, 97, "Organization"]]}
{"id": 5338, "text": "Huobi University has recently published an opinion piece by one Leon Li, the CEO of Huobi Group, which is entitled “Blockchain Industry and Its Outlook,” […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 16, "Organization"], [84, 95, "Organization"]]}
{"id": 5340, "text": "India’s problems with cryptocurrency-enabled criminal activity don’t appear to be stopping anytime soon, as authorities have arrested another citizen of conducting fraudulent operations with the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5341, "text": "India’s crypto regulation is subject to significant uncertainty, as legal disputes are prolific. The Reserve Bank of India, or RBI, didn’t have the authority to […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[101, 122, "Organization"], [127, 130, "Organization"]]}
{"id": 5342, "text": "OKEx, a popular cryptocurrency exchange, has finished what it calls its Beacon Program, the European Edition, according to a press release. This program hosted “masterclasses” […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 4, "Organization"]]}
{"id": 5343, "text": "Top cryptocurrency spot and derivatives exchange OKEx has integrated Unstoppable Domains, a leading blockchain domain provider, into its platform. With the integration, users now have […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[49, 53, "Organization"], [69, 88, "Organization"]]}
{"id": 5345, "text": "Changpeng (CZ) Zhao, the CEO of Binance, has taken to twitter in order to showcase the first beat transaction that the crypto exchange had made […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[32, 39, "Organization"]]}
{"id": 5347, "text": "Alameda Research and Framework Ventures stand as but two of some of the biggest figures in DeFi that have opted to back dHEDGE, a decentralized […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 16, "Organization"], [21, 39, "Organization"]]}
{"id": 5348, "text": "The Ethereum Network just can’t seem to get a handle on the massive gas fees it’s suffering. The network is quite literally too popular for […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Coin"]]}
{"id": 5349, "text": "Kain Warwick stands as the founder of the Synthetix DeFi protocol, and is one of the most prominent figures within the DeFi space as a […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5352, "text": "Bitfinex announced the summary removal of 87 trading pairs from its platform. These pairs will be removed completely, with the changes itself coming into effect […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 8, "Organization"]]}
{"id": 5353, "text": "An anonymous user recently hacked into the Twitter accounts of cryptocurrency exchange Binance and its CEO Changpeng Zhao. The hack has rattled the crypto community […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[87, 94, "Organization"]]}
{"id": 5354, "text": "The Bitfinex crypto exchange had seen a catastrophic hack some four years ago, seeing a staggering 119,756 Bitcoin (BTC) be stolen from it back in […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[4, 12, "Organization"], [107, 114, "Coin"], [116, 119, "Coin"]]}
{"id": 5339, "text": "Cryptocurrency fraud is currently running rampant across several countries. India is one of the countries with the most common of such criminal activities, and law […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5344, "text": "Signature Bank has been extending dozens of loans more under the Paycheck Protection Program, particularly to cryptocurrency firms, than previously was reported. Signature Bank Moving […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[0, 14, "Organization"]]}
{"id": 5346, "text": "Yearn Finance, a decentralized finance (DeFi) protocol, is currently one of the world’s top cryptocurrency projects right now. Headlining what appears to be a strong DeFi […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": []}
{"id": 5350, "text": "One of the top cryptocurrency exchanges of the world, Bitfinex, had recently added yet another offering on its expanding list: Margin trading support for the […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[54, 62, "Organization"]]}
{"id": 5351, "text": "The world of cryptocurrencies is plagued with a somewhat surprising amount of tribalism. The main gist of it is that pure-Bitcoin (BTC) supporters usually referred […]", "meta": {}, "annotation_approver": null, "comments": [], "labels": [[122, 129, "Coin"], [131, 134, "Coin"]]}
